[
    {
        "text": "FFS the dick comparison thing. WTF. I wanna bet the one suggesting it is a closet-Homo-sexual who wanted to explore/take advantage of his naive teenage friends. I swear sometimes boys are simple minded. And who the fuck is stupid enough to write it in a public chat for every1 to see??? OMG WTF!!",
        "id": 3,
        "like_count": 0,
        "author": "@Ianthe22"
    },
    {
        "text": "these shows are always so awkward and cringy",
        "id": 4,
        "like_count": 0,
        "author": "@jaydunna2645"
    },
    {
        "text": "Now you know how hard it is for boys/men too to not go \"Woah!\" all the time in public.",
        "id": 8,
        "like_count": 1,
        "author": "@fu6817"
    },
    {
        "text": "The guys are so cringe.  It has to be an act.  They can't be that shy or scared.",
        "id": 13,
        "like_count": 0,
        "author": "@semi6544"
    },
    {
        "text": "0:44 it's called being sexually repressed, fanfan",
        "id": 24,
        "like_count": 1,
        "author": "@bgregz"
    },
    {
        "text": "bruh ur abouta get banned L-O-L",
        "id": 25,
        "like_count": 0,
        "author": "@sillerdays9831"
    },
    {
        "text": "since i dont like vaping, i imagine fanfan sitting in a really cold room",
        "id": 33,
        "like_count": 17,
        "author": "@Moloch6666"
    },
    {
        "text": "I'll take this comment section as a platform for ruling out personal shit-bits and my questions in that regard, so please take the following with a pinch'a salt! Here I go:\n\nWhat is it with koreans and big booba?\nI don't mean to say, that this was an explicit factor for korean people.\n\nBut I noticed, that korean artworks are more explicit about ideal representations, so it might be all-that, only.\n\nI'm just sooo fed up with that absolute display of a correct majority or quasi-orthographical approach of the korean culture.\nIt shows little regret in \"apparently unending excess\", imo.\n\nI can simply already picture the resulting conceit of \"having to be correct/normal\" and the painfully fatal resolutions made by applying all that without visible regrets.\n\nI have never been to Korea, so I might simply have a bad source for my references here, as well.\nWhat's Your take on that?",
        "id": 36,
        "like_count": 0,
        "author": "@jaredreynold6336"
    },
    {
        "text": "What the hell is a BJ ?",
        "id": 40,
        "like_count": 0,
        "author": "@theguywhoaskedandcares5576"
    },
    {
        "text": "8:45 \n\nyou have been to korea.\nkorean girls don't usually show that much skin.\n\nmaybe in Taiwan. (not sure about mainland.)",
        "id": 45,
        "like_count": 3,
        "author": "@porcorosso4330"
    },
    {
        "text": "WHAT?? THAT CRAZY",
        "id": 54,
        "like_count": 0,
        "author": "@AntzoGraphics"
    },
    {
        "text": "wtf is this finfon -sourGummiees LOL",
        "id": 56,
        "like_count": 0,
        "author": "@ciscasaclang3378"
    },
    {
        "text": "this video would be mad funnier if they just put one dude in the room with all 4 girls at the same time, they would 180 switch from the screaming in this video to just being mega shy and awkward 😂",
        "id": 58,
        "like_count": 52,
        "author": "@jfork101"
    }
]