[
    {
        "text": "I tried Versace Eros and its basic as the School of Scent said, not worth the buy.",
        "id": 2,
        "like_count": 0,
        "author": "@abdulrahmanali122"
    },
    {
        "text": "dior homme sport 2021 is way too citrusy for me it makes me go nose blind in seconds",
        "id": 14,
        "like_count": 0,
        "author": "@jyn99"
    },
    {
        "text": "Oud Touch is absolutely useless. It smells disgusting .",
        "id": 21,
        "like_count": 0,
        "author": "@Itdoesntmakesense2me"
    },
    {
        "text": "ASAD is maybe nice to many, but it doesn't smell expensive, and although i am not a huge fan of Elixir, ASAD misses out the things that makes people like it so much imo. I would personally wear ASAD over Elixir however as i am not a fan of the liquorice tbh.",
        "id": 34,
        "like_count": 1,
        "author": "@Mitchcraft."
    },
    {
        "text": "Would never recommend Eros for a teenager! That's a club fragrance.  Also Profondo is too heavy for an  office.",
        "id": 37,
        "like_count": 0,
        "author": "@denissemarshall9806"
    },
    {
        "text": "Too bad Eros doesn't work on my skin. The sourness in it reminds me of urine.",
        "id": 40,
        "like_count": 0,
        "author": "@samasamah"
    },
    {
        "text": "Omar, can Muslims wear Boozy fragrances that have actual booze in it? I always wonder about that. I myself am muslim so far i haven’t bought any fragrances with booze because i am not sure yet.",
        "id": 49,
        "like_count": 0,
        "author": "@Wisdom887"
    },
    {
        "text": "on my opinion only jpg fragrances i like is le beau and ultra and both scandals and i hate elixir and le parfum they just smell very very bad on my opinion",
        "id": 50,
        "like_count": 0,
        "author": "@viljamilindnvall"
    },
    {
        "text": "Omar, don't tell them please about AF 1981x, I wanna be the only 30 years old teenager who's wearing this . 😁",
        "id": 51,
        "like_count": 0,
        "author": "@LyubomirX"
    }
]