[
    {
        "text": "I just got an ender 3 s1 for $260, I’m so excited",
        "id": 26,
        "like_count": 0,
        "author": "@redthunder6183"
    },
    {
        "text": "Gonna buy it soon...",
        "id": 34,
        "like_count": 0,
        "author": "@gtbaba123"
    },
    {
        "text": "Prefiero una v2 y comprar el touch el sensor de filamento y el doble z.\nTengo una asi, y nunca falla. Salvo el bt touch que es un desastre.",
        "id": 111,
        "like_count": 0,
        "author": "@mauroariel84"
    },
    {
        "text": "Jukka Seppänen is from Finland!",
        "id": 141,
        "like_count": 0,
        "author": "@jamiainen"
    },
    {
        "text": "Still running my Anycubic Kossel Pulley and Longer LK1 lol",
        "id": 231,
        "like_count": 0,
        "author": "@unclegamer3092"
    },
    {
        "text": "It’s taco TUESDAY!!!",
        "id": 278,
        "like_count": 0,
        "author": "@MrCoscarelli"
    },
    {
        "text": "I would like a S1 versus prusa!",
        "id": 309,
        "like_count": 3,
        "author": "@TheKdcool"
    },
    {
        "text": "Really happy with my S1 ❤ prints like a champ and easy to get around!",
        "id": 1,
        "like_count": 0,
        "author": "@CedricVanOstaeyen"
    },
    {
        "text": "So this thing is on sale for Cyber Monday for $179. One year later and with other options out there now is that a good deal or \"meh\"?",
        "id": 3,
        "like_count": 1,
        "author": "@Vohaul214"
    },
    {
        "text": "Super helpful 😊",
        "id": 4,
        "like_count": 0,
        "author": "@jenniferwitt5389"
    },
    {
        "text": "260 USD black Friday special in south africa, waiting for delivery.",
        "id": 5,
        "like_count": 0,
        "author": "@coffee_gaming"
    },
    {
        "text": "I've been looking into this because it has auto-bed leveling! great review!",
        "id": 7,
        "like_count": 0,
        "author": "@milespettingill"
    },
    {
        "text": "Great review. Subscribed.",
        "id": 8,
        "like_count": 0,
        "author": "@Jerryk7"
    },
    {
        "text": "why is there 2 Ender 3 S1 on amazon? on says released 2021 and the other says 2018",
        "id": 9,
        "like_count": 0,
        "author": "@diamondly6250"
    },
    {
        "text": "Ive been printing with the ender 3 s1 since January. I've modded the heck out of it with sonic pad, gantry light, dual part fans, linear rails, better PEI build plates, upgraded springs, upgraded hot end, I love this machine and dont really get all of the ender haters",
        "id": 10,
        "like_count": 0,
        "author": "@user-jp2nv5qt2y"
    },
    {
        "text": "Have you had a chance to try the Ender 3 VV3 SE? I am curious the differences and what your opinion is.",
        "id": 11,
        "like_count": 0,
        "author": "@bentilman9103"
    },
    {
        "text": "Would cleaning between prints the printing bed with rubbing alcohol help with the sticking issues ?",
        "id": 12,
        "like_count": 0,
        "author": "@rompstar"
    },
    {
        "text": "Got one from micro center for just $200 and verry happy, thinking of swapping the fan with a 5015 centripital fan and getting a pei bed, but other than that its pretty good",
        "id": 14,
        "like_count": 0,
        "author": "@user-sn5yv9ke8f"
    },
    {
        "text": "I just picked this one up for 150 at micro center lol",
        "id": 15,
        "like_count": 0,
        "author": "@jordanabcd5549"
    },
    {
        "text": "with my ender 3 max neo, anycubic neo, and ender 3 s1.... the S1 has given me zero issues other than a nozzle change... anycubic has been a headache and ender 3 max has hiccups but i toss that to lots of large prints constantly running ... I still consider myself a noob and have to say hands down my S1 has been the MOST enjoyable to use",
        "id": 18,
        "like_count": 0,
        "author": "@mepps7706"
    },
    {
        "text": "I’m looking into printers for Christmas, never had a 3D printer before but seems like a cool hobby. There’s a few ideas I have already like printing some Replica guns from the game series Destiny and put them on display cuz theres a few I would like to physically display cuz they look so cool. Maybe make some side money too by selling prints lol.",
        "id": 19,
        "like_count": 0,
        "author": "@brennancurrier806"
    },
    {
        "text": "Can you recommend which 3d printer should I get between the ender 3 S1 or the elegoo Neptune 3 pro ?",
        "id": 20,
        "like_count": 1,
        "author": "@devarora4969"
    },
    {
        "text": "Managed to get one of these for $200, and at that price point this thing is an absolute steal.  My Prusa Mini is still a much better printer overall in spite of its smaller build volume (it prints better parts and is hours faster on jobs) , but right out of the box this eliminates 90% of the problems I had with my first Ender 3 (mostly bed leveling and underextrusion) and is actually very usable.",
        "id": 21,
        "like_count": 1,
        "author": "@thesledgehammerblog"
    },
    {
        "text": "Thanks for the review. Just ordered an S1 some days ago and can't wait to start working with it. Is there a recommendation you have on a replacement build plate?",
        "id": 23,
        "like_count": 0,
        "author": "@ReinerKnudsen"
    },
    {
        "text": "perfect thankssss",
        "id": 24,
        "like_count": 0,
        "author": "@behzadabf"
    },
    {
        "text": "You forgot one option I just bought mine and am here to assure myself I made a good decision 😂",
        "id": 25,
        "like_count": 0,
        "author": "@user-dj7gr6lj5h"
    },
    {
        "text": "I picked one up as my first real 3D printer. Thank you for the review!",
        "id": 28,
        "like_count": 0,
        "author": "@k2concepts"
    },
    {
        "text": "Are you planning on reviewing the S1 Pro? It would be really helpful!",
        "id": 29,
        "like_count": 0,
        "author": "@wayverleesoulsong"
    },
    {
        "text": "Just ordered this printer and would like to buy some extra nozzles. Are the thread standard for all the printers or each manufacturer could have different specifications?",
        "id": 31,
        "like_count": 0,
        "author": "@argentosebastian"
    },
    {
        "text": "Hi!\nThank you for the information; I am thinking about getting one, I have never used a 3D printer before, and I have a few things I would like to know if I can use my own 3D files with this printer.\nThank you.",
        "id": 32,
        "like_count": 0,
        "author": "@pabloaguayza7726"
    },
    {
        "text": "Yo Joel are you ever going to do a review on the sprite extruder upgrade for the standard Ender 3\n\nI bought the upgrade kit and it had been really great",
        "id": 35,
        "like_count": 0,
        "author": "@mattmakesmachines"
    },
    {
        "text": "I was looking at this printed and also the Ender-3 V2 Neo 3D Printer. It looks like for $50 this is better. If I get one would you recommend the S1 or for the  extra money  S1 Pro 3D Printer? This will my first 3d printer and I want one that i don't have to upgrade out of the box.",
        "id": 36,
        "like_count": 0,
        "author": "@logo8009"
    },
    {
        "text": "Hi I have an ender 3 s1 and I connected a fan to it and it gave off a burnt smell and now the fan doesn't work I tried to change the fan I tried the motherboard in the extruder and it still doesn't work I would be happy if you could tell me if you know what the problem could be",
        "id": 37,
        "like_count": 0,
        "author": "@chananel9756"
    },
    {
        "text": "Is this better to be outside (with a roof of course) instead of inside a room (does it make a room too hot?)",
        "id": 38,
        "like_count": 0,
        "author": "@Cons2911"
    },
    {
        "text": "Torn between getting this S1 or a 5 Pro.  You say it's the best printer you *ever* reviewed, but could not find an Ender 5 pro review from you.  You probably have used one, even if not reviewed it, so you'd you still claim it's the best?  Thanks!",
        "id": 39,
        "like_count": 0,
        "author": "@MiguelAfonso"
    },
    {
        "text": "thanks for doing a straight review. a lot of other \"reviews\" involve a lot of narcacistic show off of some childish sort or another. You're just like \"here's the product, here's my experience with the product, here's my opinion of the product\"",
        "id": 40,
        "like_count": 0,
        "author": "@technodruid"
    },
    {
        "text": "I love me Ender 3 s1 I bought it on sale at microcenter in the NYC area  for 279.00 dollars. in December 22.",
        "id": 41,
        "like_count": 0,
        "author": "@thomaspc2"
    },
    {
        "text": "My printer, starts off every single print with a little mat of what seems to be supports. I don’t know how to fix it and with every single print that I do add another 30 minutes to do the bottom part. it looks just like that little outline that it’s supposed to have, but it just feels it in and goes up five or so layers. I need a little bit of help on it.",
        "id": 42,
        "like_count": 0,
        "author": "@a-ray1166"
    },
    {
        "text": "Would you recommend getting the sprite upgrade kit for an Ender 3 pro?",
        "id": 44,
        "like_count": 0,
        "author": "@TGG141"
    },
    {
        "text": "I just got mine and assembled it . looks like it was the right choice. I was just wondering if they could not print the manual any smaller🤣",
        "id": 45,
        "like_count": 0,
        "author": "@francoisdreyer9495"
    },
    {
        "text": "Red nose guy looks toooo excited about printer (like he is drunk or paid) 🤣🤣",
        "id": 46,
        "like_count": 0,
        "author": "@daitedve8581"
    },
    {
        "text": "im gong to get one soon, i just need to find a ggod 3d modleing softwhare",
        "id": 47,
        "like_count": 0,
        "author": "@Stratecs"
    },
    {
        "text": "I just got this and it’s my first 3d printer, I can not get it to work no matter what I do, the nozzle keeps dragging and moving the filament around, I’ve tried increasing nozzle and bed temp, slowing down the print speed, and this is all just for a calibration dice, please help.",
        "id": 48,
        "like_count": 0,
        "author": "@goofthunder3763"
    },
    {
        "text": "nearing the end when he began to compliment the ender i was waiting for a \"But...\" I am genuinely surprised!\n\nEdit: \nAlso I'm looking to buy this machine by black Friday or Cyber Monday (Very likely sooner lol) I'm excited and scared! never used so mush $ on something idk how to use 100% yet",
        "id": 52,
        "like_count": 0,
        "author": "@Foxuniverso"
    },
    {
        "text": "Looking to purchase my first 3D printer, and I know absolutely nothing about them... however, the multiple videos I've seen, it looks like this might just be the best beginner printer for me. Thank you for sharing your knowledge on the subject.",
        "id": 55,
        "like_count": 0,
        "author": "@Dalton5042"
    },
    {
        "text": "Try this new 3d printer from Elegoo \"Neptune 3 Pro\" first and then tell me if creality Ender 3 S1 is still your favorite 3d printer. 😉",
        "id": 56,
        "like_count": 0,
        "author": "@-Jantje"
    },
    {
        "text": "I have a skr mini E3 V3.0 and a Creality Sprite extruder pro. will you please do a video no the setup and instal of this extruder on the skr min E3 V3.0",
        "id": 57,
        "like_count": 0,
        "author": "@Dwatson83"
    },
    {
        "text": "Ended up here looking for S1 Pro review but S1 review was great enough. Certainly getting my first 3D printer. Gonna be an exciting journey. GG Content.",
        "id": 59,
        "like_count": 0,
        "author": "@drukcg"
    },
    {
        "text": "Thank you Joel!\nThese low-cost printers are certainly getting dialed in…..but I ordered another Prusa kit❤…..which never need any necessary tweaking from print No1😎",
        "id": 60,
        "like_count": 0,
        "author": "@ruftime"
    },
    {
        "text": "Please help me with my ender 3 s1 I'm having a nightmare of a time leveling my print bed. I followed every tutorial on YouTube and I still can't get my bed level! I can get it level enough to do small prints but the moment I need to print print something that takes up more then 1/3 of the print bed its just terrible. To low in some spots to high in others. I've tried the audio bed leveling but that just seems to make it worse. I even went out and bought a glass print bed in hope to maybe even out any warpage in my bed. Nope still a problem. Any advice you could give would be a great help Please 🙏. this is my first 3d printer and I desperately need help because I'm on the verge of just selling this thing in hopes of getting some of my money back.",
        "id": 63,
        "like_count": 0,
        "author": "@cliffadams84"
    },
    {
        "text": "do you really think its better than Prusa  ?",
        "id": 64,
        "like_count": 0,
        "author": "@eliavra6911"
    },
    {
        "text": "Should I get this one or the pro version ???? I see them both on Amazon $100 difference, thank you for your help",
        "id": 65,
        "like_count": 0,
        "author": "@JerseyStyle7"
    },
    {
        "text": "He's talking like there's a Chinese guy at the other side pointing a gun at him so he speaks wonders about the printer LOL",
        "id": 66,
        "like_count": 0,
        "author": "@alejandroperez5368"
    },
    {
        "text": "I like the machine, I have 5 of them. However, after 4 months of intensive use they started having problems,  but the hardest part  is to figure what is happening. Accessing extruders, nozzle, and so on is hard, takes time and replace the whole kit as a quick alternative will cost you at least $100. If I compare this machine and an original CR10 for intensive budget printing, I'd choose 100 times the original CR10. I have 2,  after more than 5 years I just replaced the extruder kit and updated the bed. I know, the CR10 is ugly, bulky, and looks cheap but it's just reliable, with great quality and it's easy to fix. Once you level this thing you won't need to do it again. The S1 is a great design probably the best, in my opinion for light use but if you need printing large quantities, long term, this isn't the machine. If you still want to it because, I'll recommend paying for the insurance so you can replace it. I've replaced two of them already after 4 months of work and probably I'll need to replace another two this week. I have other machines industry grade, more expensive ($.1.2K) and the one that has given me the less problems is that cheap CR10 🤔.",
        "id": 67,
        "like_count": 3,
        "author": "@nesscamelo"
    },
    {
        "text": "I’m looking for a 3D printer, to learn to use with my Son. Where’s the best place for printing resources like 3D designs? What’s the best software to create your own designs? What’s everyone’s favourite website for learning tip, tricks and hacks when 3D printing?",
        "id": 68,
        "like_count": 0,
        "author": "@diverandy77"
    },
    {
        "text": "I litteraly just bought this so now im sitting here watching videos like this to provide myself with the greatest possible buyers remorse.",
        "id": 69,
        "like_count": 0,
        "author": "@kvernesdotten"
    },
    {
        "text": "I want to get a Spirit Pro with waterblock and put it into my Ender-3 V2, and integrate it into my Workstation/server/Co2 Laser Glycol Chilled loop... How plug and play is it to put Spirit Pro onto Ender-3 v2 and also a bl touch????",
        "id": 72,
        "like_count": 0,
        "author": "@bitrage."
    },
    {
        "text": "Thanks for this review. I  currently own a Ender 5, which is a great machine by all means. But it is also really bulky.\nI'm looking to change to a more compact machine with similar volume and so far my eye has been on the Ender 3 V2, the Ender 3 S1 and for a bit the CR6 SE but the reviews on that one has been spotty so far",
        "id": 74,
        "like_count": 0,
        "author": "@darkfoxa"
    },
    {
        "text": "Lol the neptune 3 would absolutley mop the flor with this în a comparison",
        "id": 75,
        "like_count": 0,
        "author": "@mihai-alexandrupopa7670"
    },
    {
        "text": "Question, I have the chance to buy a CR10s Pro V2 for $400 or a Kobra max for $400. Which would you choose?",
        "id": 76,
        "like_count": 0,
        "author": "@ninjazxd"
    },
    {
        "text": "as someone who is looking to get into the printing hobby what would people reccomend as a good starting printer, mainly to do smaller stuff ( hoping to do masks in the future) my budget is around 200! thanks",
        "id": 77,
        "like_count": 0,
        "author": "@caybasey2911"
    },
    {
        "text": "I loved the review. Thanks for the video. 🥰You are so cute! 😘",
        "id": 78,
        "like_count": 0,
        "author": "@GypsyRoseDukes"
    },
    {
        "text": "3 months in - how is it going with this printer? - is the Sprite DD unit still running well?",
        "id": 79,
        "like_count": 0,
        "author": "@txwombat7826"
    },
    {
        "text": "With the build plate issue you mentioned round 4:20 ish, would hairspray on the flex plate work? Honestly I have not used a flex plate at all, I have an Aluminum plate on a old MK1 Purusa i3. Looking at the Ender 3 S1 as my replacement... High time.",
        "id": 82,
        "like_count": 0,
        "author": "@stefankruger1057"
    },
    {
        "text": "It is not silent at all... get ringing in my ears. Other than this, it's super stable, great printer",
        "id": 85,
        "like_count": 0,
        "author": "@omot2491"
    },
    {
        "text": "I am probably getting one in a year or 2",
        "id": 86,
        "like_count": 0,
        "author": "@dea-animator1906"
    },
    {
        "text": "I think it is about time i upgrade from my old CR10S v1 that I have had for nearly 4 years now and this looks perfect... smaller build plate... sure but I don't really use it all anyway so I think I will be fine.",
        "id": 88,
        "like_count": 0,
        "author": "@Class43Goat"
    },
    {
        "text": "Would have been helpful 3 days ago before I ordered the ender 3 pro. But im sure the pro is a good machine aswell. Any tips for initial setup of the Pro would be immensely helpful. (Im talking to you 3d printing nerd community).",
        "id": 89,
        "like_count": 0,
        "author": "@demolition3612"
    },
    {
        "text": "Had my 3 S1 for a month or so. Is there a way to show on the display, layer numbers? great videos. regards",
        "id": 90,
        "like_count": 0,
        "author": "@davidtaylor6870"
    },
    {
        "text": "I am looking at this but wondering of the S1 pro is worth the extra $100",
        "id": 91,
        "like_count": 0,
        "author": "@TwoMuchDew"
    },
    {
        "text": "So here the most difficult question: ender 3 s1 (pro) or Prusa mk3s+? Please I need to know if charge of300€ for the Prusa against ender 3 s1 are worth",
        "id": 93,
        "like_count": 0,
        "author": "@walterincardona4187"
    },
    {
        "text": "I just got the Ender 3 S1 Pro, and it's amazing. I've never owned or even used a 3D printer before, so it's taking a lot of learning to get to where I feel like I know what I'm doing, but the prints are great. The machine just works.",
        "id": 94,
        "like_count": 0,
        "author": "@GeneralNickles"
    },
    {
        "text": "Great Reviews! I am starting the quest for my first 3D printer, I am a HAM radio operator with some tech experience. What be a good recommendation in regards to printer and software? Also have kids that would love to print their game characters. Is there a repository of 3d models that you can download and print? This are basic questions I am sure everyone here knows, but new to me. Regards !!! Keep up the great videos.",
        "id": 96,
        "like_count": 0,
        "author": "@marcoscancel7693"
    },
    {
        "text": "I still love my Ender 3 Pro v1- unsure if I should keep upgrading it or get this new S1 - or just get the new S1 without getting rid of the Ender Pro V1",
        "id": 98,
        "like_count": 0,
        "author": "@joshuajaynes88"
    },
    {
        "text": "Thank you so much I’m new to 3-D printing and I will be buying this printer",
        "id": 101,
        "like_count": 0,
        "author": "@Presious91"
    },
    {
        "text": "Very subtle \"It works, untill it do not!\". I did actually lol.",
        "id": 102,
        "like_count": 0,
        "author": "@nubletten"
    },
    {
        "text": "not buying from creality.  my cause is NOT to buy from CCP controlled companies' products.  CCP is sucking the sweet juice out of capital western countries people like YOU.",
        "id": 104,
        "like_count": 1,
        "author": "@krnxemb"
    },
    {
        "text": "I really liked this review, could you compare it to the Anycubic Vyper in the future because it is one other 3d printer I am considering.",
        "id": 105,
        "like_count": 0,
        "author": "@chris_tteg"
    },
    {
        "text": "Even my ender 3 from 2018 worked really well and was quiet. I can only imagine how good this version is.",
        "id": 108,
        "like_count": 1,
        "author": "@narwhalking2788"
    },
    {
        "text": "And I still could not be bothered with upgrading my ender 3 pro because it still performs like a champ ( and because I don’t print that often anymore )",
        "id": 109,
        "like_count": 0,
        "author": "@theshadowman1398"
    },
    {
        "text": "Does the Jyers Custom Firmware actually already exist for the\nEnder 3 S1 ❓ \nAnd if so where 👀 ❓\n I would be very grateful for a tip... 🙂👋🏼",
        "id": 110,
        "like_count": 0,
        "author": "@Knuddel00"
    },
    {
        "text": "Nice revue! What abuot the new S1 pro, will you make a revue of that also? ( I hope so!) 😉",
        "id": 112,
        "like_count": 0,
        "author": "@SuperBossen"
    },
    {
        "text": "I bought this printer as a spare to my aging Prusa Mk2.  It works great, but my one little nit pick complaint is the cable.  The cable sticks out so far to the side of the printer, that I feel like it wastes desk space.  Any ideas on how to tidy that up?  I've been trying to come up with something for several days.",
        "id": 114,
        "like_count": 0,
        "author": "@DrRowanze"
    },
    {
        "text": "Better than ender 6 ?? I don't know witch one to buy",
        "id": 115,
        "like_count": 0,
        "author": "@recovered_file"
    },
    {
        "text": "i just purchased my first printer, an ender 3( didnt realize it was the OG) and it prints OKAY...but i keep having issues like it will skip a support and then drag plastic all over the place and build what looks like coral all over my prints...im about to purchased the creality auto BL and then update the firmware...maybe that will help?",
        "id": 116,
        "like_count": 0,
        "author": "@davidshreve3558"
    },
    {
        "text": "I've got a 5 year old Cr-10S that I love. I will keep it until it no longer works, but I do want a second, updated machine. I'd prefer to go no smaller than 300x300... I'll still keep this in mind though!",
        "id": 117,
        "like_count": 0,
        "author": "@fatboy1271"
    },
    {
        "text": "Hey brother I need help. \nI have an ender 3 pro with a glass bed and it used to work amazing until one day my PLA prints would always get separation in them and just fall apart, but it prints TPU fine. Idk what to do I have tried new filament, making sure the bed is level, I even did a direct drive and all metal hot end upgrade thinking that would definitely fix it. But still the same thing , it's really driving me nuts.",
        "id": 118,
        "like_count": 0,
        "author": "@FrizFPV"
    },
    {
        "text": "Fantastic printer  - beats the heck out of my old Ender 3 pro.  It really makes 3D printing practical.  Super quiet, great UI, awesome bed adhesion, outstanding cable management, excellent print quality and very easy setup.  I was printing in less than :20 minutes. Best investment I made in 3D Printing.  Thumbs up!",
        "id": 120,
        "like_count": 9,
        "author": "@flyboyn854d4"
    },
    {
        "text": "I was considering this one today, but this sold me.\n\nThanks, I’ll be buying the S1 and laser too… I’m excited to try some basic laser engraving and see if I might invest in a Glowforge or something in the future.",
        "id": 122,
        "like_count": 0,
        "author": "@DanteYewToob"
    },
    {
        "text": "Thanks was literally trying to decide if I should get the S1",
        "id": 124,
        "like_count": 0,
        "author": "@danielhall2189"
    },
    {
        "text": "Thanks. But what about two things respecting its maintainability and upgradeability: 1) what heatbreak it uses (PTFE passthrough or fullmetal, and what type - some standadrd or something new)? 2) What about stepper drivers and MCU - is all of them 2208 and what abou LA support? Does MCU have enough flash space to enable LA (256 or 512 kb)?",
        "id": 126,
        "like_count": 0,
        "author": "@Kekht"
    },
    {
        "text": "As a newbie 3D printee, I took the plunge and bought an Ender 3 S1 3 weeks ago as my first foray into the world of 3D printing. For the first 2 weeks I found it to be really great. However....a week ago I started to get problems with the spung steel build plate - it stopped adhering after about 15 prints!! I've also had a massive problem with my Sprite extruder.... it had a massive issue with pooling and filament extruding all around the nozzle and hotend and clogging up EVERYTHING!!!!... I've had to take everything apart and clean it! (Not good on a printer less than a month old!) Hopefully this is a one off. (Of course this may be down to me.....which I'm starting to suspect it may be lol). Have decided to upgrade to All metal Sprite hotend as per S1 Pro so hopefully this will solve a lot if my issues.",
        "id": 127,
        "like_count": 0,
        "author": "@gaz740"
    },
    {
        "text": "got one as my first printer, have put about 4kgs through it now and still love how it performs.  ordered the pro hotend from creality as an upgrade.  the only issue i have had is the bed not being relatively flat.  on small prints it wasnt a problem, i could usually move the location of the print around to find good adhesion.  but on bigger prints even with the auto leveling i would have some localized hills where the nozzle would make ghost lines and other areas where the filament would just pop right off.  i have had to use a lot of rafts.  the other issue is the little spatula that comes with it, mine was stamped metal and no burs were removed.  i didnt inspect the tool and on first use trying to separate a part from the bed gouged a line into it.  i havent used it since and havent even needed something similar because everything releases well with the spring steel.  why even include it if the cheapness makes it a danger to the very product it is supposed to be used on.\n\nany suggestions for a bed upgrade?  i love the ease of the spring steel type but if it means having a much flatter surface i might try glass.",
        "id": 131,
        "like_count": 8,
        "author": "@mustardtiger9265"
    },
    {
        "text": "A while back you review the CR-X  3D Printer did you ever review the CR-X Pro . Did they listen to your advice?  They added the BL touch like you wanted did they fixed anything else?  Have you reviewed other dual extruder printers?",
        "id": 132,
        "like_count": 0,
        "author": "@rrrubiera"
    },
    {
        "text": "I was like did we just become best friends? Once I heard him say unicorn farts and rainbows lol. I say that a lot",
        "id": 135,
        "like_count": 0,
        "author": "@shakam.5658"
    },
    {
        "text": "Hey! :) You should make a video talking about the new CR-10 Smart Pro which is one of the newest Creality releases ;) Great video btw.",
        "id": 136,
        "like_count": 0,
        "author": "@danielamorteguihenao4208"
    },
    {
        "text": "I still use the original ender 3, its been modded and I love it",
        "id": 138,
        "like_count": 0,
        "author": "@justpoppinthings"
    },
    {
        "text": "Really good review!",
        "id": 140,
        "like_count": 0,
        "author": "@olafb.2929"
    },
    {
        "text": "How does this machine compare to the Magician X? It seems to me that the levelling process is much easier on that printer.",
        "id": 142,
        "like_count": 0,
        "author": "@JottyHB"
    },
    {
        "text": "Did you clean the surface with isopropyl alcohol after you started seeing some adhesion issues?",
        "id": 143,
        "like_count": 0,
        "author": "@volksbugly"
    },
    {
        "text": "I just ordered the Ender 3 S1 Pro Version here in Germany. Can´t wait",
        "id": 144,
        "like_count": 0,
        "author": "@WurstWilli1988"
    },
    {
        "text": "I’m looking to move in from my Tevo Tornado and it feels like I no longer understand the printer space. Where can we get an honest and experienced perspective of what printers are out there for 2022?",
        "id": 145,
        "like_count": 0,
        "author": "@bigred8982"
    },
    {
        "text": "I've had my Ender 3 S1 for about 3 weeks now and absolutely love it. Had to manually level the bed once because one corner was much lower than the others, but since then the auto level has been a dream. Considering that I spent the first 3 months with my original Ender 3 printing mods and ordering better parts, only spending an hour calibrating is well worth the price. Found a fantastic guide for setting up the slicer too and since then my prints have come out incredible. All in all, I absolutely love the Ender 3 S1!",
        "id": 146,
        "like_count": 4,
        "author": "@3rdchannelmike"
    },
    {
        "text": "Would you say that Anycubic Mega X still is worth it? Or should I go with something newer? It's on sale here in Sweden for just 280 USD.",
        "id": 148,
        "like_count": 0,
        "author": "@ChrisKadaver"
    },
    {
        "text": "What about the Ender 3 S1 Pro? Seems like an easy gateway into higher temp printing.",
        "id": 150,
        "like_count": 0,
        "author": "@cynic5581"
    },
    {
        "text": "Might be a good companion to my Ender 3. Always wanted two printers because Im impatient lol.",
        "id": 151,
        "like_count": 0,
        "author": "@PantsuMann"
    },
    {
        "text": "I’ve had my 3S1 for about 2 months now and am SOOO happy I lucked into this as my very first experience with 3D printing.",
        "id": 153,
        "like_count": 1,
        "author": "@chriscrawford1958"
    },
    {
        "text": "At around $400 will love to see how it compares to a prusa mini as they are pretty close on price. Sure, it is not as large, but it has an all metal hotend as well as the PEI bed and the amazing support from Prusa. I wonder how it will stack up.",
        "id": 154,
        "like_count": 2,
        "author": "@3DMusketeers"
    },
    {
        "text": "So I have a BIQU B1 printer and it has a very similar setup except all metal hotend a touch screen a better build plate and cost less. Other than that the same",
        "id": 159,
        "like_count": 0,
        "author": "@tekolicious8310"
    },
    {
        "text": "👍 just for Jingle All The Way insert.",
        "id": 161,
        "like_count": 0,
        "author": "@zarlus8"
    },
    {
        "text": "The ‘Best-Ender-3-ever-reviewed’, now you need to review the Ender-2-Pro!",
        "id": 163,
        "like_count": 0,
        "author": "@theapplguy"
    },
    {
        "text": "Indeed I think it's a great printer, well thought about it by Creality, I think that the S1 Pro is even better/more improved. I do look forward to get my hands on this printer. Great video Joel",
        "id": 164,
        "like_count": 1,
        "author": "@Zachary3DPrints"
    },
    {
        "text": "I had so many people telling me to buy a Ender 3 when I was looking for a second printer next to my Tevo Tornado.\n\n“Yeah you can upgrade it and tinker with it.....”\n\nFFS I just want to print.. why should the printing hobby be about tinkering and making the printer better? I just want to print my designs and yeah that means i have to fix things now and then and tinker with temps/layer heights but that’s it.\n\nSo this looks like a much better option for me. But I think there are better and cheaper options to compete with this.",
        "id": 165,
        "like_count": 0,
        "author": "@Bambeakz"
    },
    {
        "text": "Just waiting to see someone review and use the s1 pro.",
        "id": 166,
        "like_count": 0,
        "author": "@joshclermont1466"
    },
    {
        "text": "I can confirm that the Slice Engineering Copperhead g2 bimetallic heatbreak is compatible with this printer.  They go for about $35 on Amazon and I would highly recommend it as a first upgrade. \n\nI would also recommend against buying a clone as the machining required to make a bimetal heatbreak work properly is super precise.",
        "id": 167,
        "like_count": 1,
        "author": "@ianhunt9520"
    },
    {
        "text": "I have an Ender 3 V2, and an S1, and the S1 though more expensive gets a lot more work from me now than the V2. For me, it's just a lot more polished and requires a lot let maintenance.",
        "id": 168,
        "like_count": 1,
        "author": "@MarkBlackman"
    },
    {
        "text": "There is a Pro version already! I am waiting, Nerd!",
        "id": 171,
        "like_count": 0,
        "author": "@Serbo-Greek"
    },
    {
        "text": "whats a good print bed replacement?",
        "id": 174,
        "like_count": 0,
        "author": "@claypool0"
    },
    {
        "text": "great review! 👏\n..if it only had full metal hotend at this price.. but I guess would be harder for them to market the S1 Pro then 👀",
        "id": 176,
        "like_count": 19,
        "author": "@marsgizmo"
    },
    {
        "text": "Having one (my first 3D printer) I would say that NOT having a touch screen is great! The knob is fast, precise and - best of all - tactile! E.g. When adjusting z-offset I don't have to look at the screen. One minor gripe though; when moving between icons with the knob, I would have liked the the icon selection order to be go going round like an O; the 'Z' jump movement always surprises me. But. eh, whatever. I also like the SD-Card. Good thing they didn't do a micro!",
        "id": 177,
        "like_count": 3,
        "author": "@paimless"
    },
    {
        "text": "Damn I might buy this if I manage to escape my country. But I've been debating getting a dual extruder so I can print fancy cool stuff :3\n\nA tiny bit too small for an only printer imo tho :9\n\nTho clearance Is what matters to mr",
        "id": 178,
        "like_count": 0,
        "author": "@ameliabuns4058"
    },
    {
        "text": "What about ABS, how do it handel ABS? :)",
        "id": 179,
        "like_count": 0,
        "author": "@ZaxMan3D"
    },
    {
        "text": "Short and sweet, thank you!",
        "id": 180,
        "like_count": 0,
        "author": "@noelquiles3202"
    },
    {
        "text": "theres one bad thing about this printer the fact that you cant get a metal hot end for it unless you buy crealities.. also another bad thing the filament sensor the wheels inside crush the filament you have a hard time pulling the filament thgough where a wheeled swtich would be better..   the fact they dont offer a pei magnetic sheet erks me that sheet they give you just try to print on it your print will stick so hard its melted in you need the pei sheet they sell to get good prints also the connector that at the hot end for electrical when it homes it crushes the cable bending it to the right they need to move the home button closer to avoid that i see wear on that cable and they dont offer the cable its a special dip cable like used back in the 80s  also when you do a bed level it turns off all the heaters.. the point is when you bed level its suppose to be at temp since everything expands...\n\nthe good about this printer it prints really good outta the box set up is fast... they do make a laser module for this but you have to figure out they did and they dont tell you how to use it or tell you how to use a program to make it work it seems like the only thing this is good for is easy out of the box printing and it does print nice no fiddling with it etc the good about it too is super quiet 32 bit board with those quiet stepper motors.. i would of liked to see the board take off the shelf stepper motors its all intergrated and maybe let us have full acess to the firmware so we can tweak it... so its got its bad points and good also the wheels on it are rubber they need to be steel you can buy steel ones and replace them so every once in a while you need to move the wheels to stop flat spots from forming and mine came all loose so youll have to check tightness of the print head theres a wrench for it etc id really like if they included a metal hot end with it that be nice",
        "id": 181,
        "like_count": 0,
        "author": "@jerrypatterson55"
    },
    {
        "text": "I am completely new to 3D printing and that flexible bed made me feel like I was Insane and couldn't get the bed level. Finally realized it was the flexible bed and slapped the glass it came with on there and it's been perfect ever since. Love this thing",
        "id": 182,
        "like_count": 2,
        "author": "@dfytie1"
    },
    {
        "text": "Prefer a larger build plate",
        "id": 183,
        "like_count": 0,
        "author": "@josephblogs352"
    },
    {
        "text": "I just got mine on 15th, and gotta say it's amazing!",
        "id": 184,
        "like_count": 0,
        "author": "@PaulyEditz"
    },
    {
        "text": "Yes, the sprite direct drive extruder and the dual z is a step in the right direction. However, you would think by now creality could have gone with touch screen for that price range, rather than fiddling with a stupid little knob. \n\nBut I would hesitate to that you don't need to be tech savvy as much as with other enders.. Let's face it, yeah, 3d printers have come a long way, but they are still in their infancy and certainly not maintenance free like 2d printers - users still have to be technical minded or at least ready for the learning curve .\n\nAlso, I personally feel the more upgrades done to a 3d printer (direct drive being a big example) the more tuned your settings have to be. Not a great playground for someone new..\n\nI have 2x ender 3 Pro's that can be found under $100, leaving you with $350 for upgrading once you have started getting used to 3d printers. Most of these upgrades can be bought for this over time and at a slightly shallower learning curve..\n\nFinal analysis: if I was to recommend to someone new, I would recommend the 3 Pro or v2 if they have extra cash.\n\nNice try to creality and well done, but it's not perfect yet..",
        "id": 185,
        "like_count": 0,
        "author": "@paulradford4100"
    },
    {
        "text": "Good review. Are you going to review the 3 S1 Pro?",
        "id": 186,
        "like_count": 0,
        "author": "@tonykyle2655"
    },
    {
        "text": "Its nicer with the Pro firmware!",
        "id": 187,
        "like_count": 0,
        "author": "@marccretten"
    },
    {
        "text": "Appreciate the Ghostbusters Proton pack spin up sound.",
        "id": 188,
        "like_count": 1,
        "author": "@shabmaster7128"
    },
    {
        "text": "I have got mine and had nothing but issues with prints , can’t seem to get my bed level and currently waiting for a replacement hot end as mine was having issues holding temp steady at 220. If you join the Facebook and redit groups 50% of people seem to have the same wonderful experience you mentioned , but then the other 50% have issues like me. Wonder if it’s inconsistent build quality.",
        "id": 189,
        "like_count": 0,
        "author": "@darksheepvids"
    },
    {
        "text": "I have an S1 it's my first 3d printer and it fulfilled the reason I wanted it over the cheaper Enders at Microcenter, the easy set up. HOWEVER, I have had bed adhesion and tolerance issues. Also I accidentally set my first print too close and some of that first layer is still stuck in the texture of the build surface. Edit: Upon rewatching I remembered that the fan is also a concern of mine, I wish it cooled from multiple sides.",
        "id": 190,
        "like_count": 3,
        "author": "@rockdem0n"
    },
    {
        "text": "And yet you haven't reviewed the S1 Pro yet? I'm waiting for my S1 Pro to arrive <:",
        "id": 191,
        "like_count": 0,
        "author": "@EpicAwesomeWin87"
    },
    {
        "text": "I own 3 Elegoo machines because of Uncle Jessy and am pretty new to the 3d world but have always been an artist.  I have enjoyed my trails but man have I made so many costly mistakes.  I am guessing you guys both have made mistake videos but I think you guys both should get peoples intakes on top of your own \"OOOPS\".  I have plenty to offer of what not to do.   ANd what to do do after you do a not to do!  Oh and I am in Tacoma, would it be cool to visit some day?",
        "id": 195,
        "like_count": 0,
        "author": "@jasontauscher3132"
    },
    {
        "text": "For the price of this printer there's way better options.",
        "id": 196,
        "like_count": 0,
        "author": "@justincasiere9598"
    },
    {
        "text": "I have one and yes I did replace the bedsheet.  So far I have a problem where the back right of the bed is lifted so far that when I changed the nozzle to the ruby and had to reset the bed I noticed it.  The fan has sucked up some stuff but it's okay.  I wish that the fan duct was a full circle setup or even offer different setups.  I would love to see this on the Ender 5 Plus or even the Cr 10, or even have this as a DIY upgrade system for other printers.",
        "id": 197,
        "like_count": 0,
        "author": "@krimsondeath22"
    },
    {
        "text": "I have a Ender 6 SE over a year now. And it has been awesome.",
        "id": 198,
        "like_count": 0,
        "author": "@TheDronzDr"
    },
    {
        "text": "Great review and I totally agree!  I love hitting print and it just prints, no worries.  I am about to put a pei sheet on it myself because I'm not a huge fan of buildtak surfaces, as they do crap out after a bit.  Keep up the great work!",
        "id": 199,
        "like_count": 0,
        "author": "@MrNickpeck36"
    },
    {
        "text": "peronsally im waiting to get the S1 Pro",
        "id": 200,
        "like_count": 0,
        "author": "@xXJarvarXx"
    },
    {
        "text": "The \"best\" Ender 3 is the one you can get for the least amount of money. Spending 430$ on that machine is just wasting ~250$ that could be spent on mods.",
        "id": 201,
        "like_count": 0,
        "author": "@jan_franzke"
    },
    {
        "text": "I love the video, I think you have decided me, I will buy the pro version.",
        "id": 202,
        "like_count": 0,
        "author": "@TheAdambright"
    },
    {
        "text": "Can you do a video on how to set this up in Prusa Slicer. Mostly talking about the G code for the start and end. No help from Ender support on this one",
        "id": 203,
        "like_count": 0,
        "author": "@nmfireman"
    },
    {
        "text": "I'm using the original spring steel sheet, but not the original surface. I ripped the coating off and replaced it with a PEI sticker. It's amazing. Took way too damn long though.\nMine never got to the point of bad adhesion, the cat test print stuck so well that it took part of the surface off with it.",
        "id": 204,
        "like_count": 0,
        "author": "@terrydaniels9573"
    },
    {
        "text": "The s1 is my first 3d printer and It has made amazing prints for me right out of the box. I have printed the boaty and many other calibration type things and all of them came out pretty much perfect with stock settings and the pla filaments I bought to start with (overture brand). I printed a few articulated toys and they worked perfect first run. So far its way less of a pain than I was expecting it to be, very happy with it.",
        "id": 206,
        "like_count": 49,
        "author": "@massv2910"
    },
    {
        "text": "I got my S1 a month ago, for a bargain at £299.99 which was a saving of £110. I am having a bit of trouble now with bed adhesion, what build plate would you recommend as an upgrade i like the spring steel one that come with it but as you say it seems to wear out over time, or a good spray on adhesive i could try to get a bit more use out of the one i have. Great show👏👍😎🇬🇧",
        "id": 207,
        "like_count": 1,
        "author": "@l.l.coolray"
    },
    {
        "text": "The Fan sucking up filament is a concern, however, the 'heat' being pushed through is not. ( I personally don't think) The reason why is, your printing at 200ish.  Your bed at 100ish isn't going to have 100ish air above it  (thermal capacities, dissipation, etc) and once you begin to circulate air, your mixing the 'hot' with 'cool'  - the biggest thing is - the 'hot' air from the bed, is still COLD air compared to the printing temp, by about 100C if not more.    It's like if your room heater kicks on pumping out 27C heat to keep the room warm, this is COLD compared to the print temps and bed temps, so if you have ABS going - your probably going to warp thanks to that draft - even though, it's 27C \"Heat\"      What happens on the S1 is similar, your pumping out 100C \"heat\" being pumped into the fan to \"cool\" the 200C printing parts, which, doesn't matter, it's still colder than the print temp, so it is 'cold'.   Even 'hot air' inside a PC helps keep other parts of the PC 'cool' by keeping the air flowing, it's when the air stagnates and can't move fast enough, and only heats up, that things 'overheat' in a PC.\n\nAll that being said, I don't like the 'intake' being on the print side where wisps can be sucked into the fan, even if it doesn't hurt the print, eventually it's gonna clog that fan up.\n\nAlso the price.  the S1 is just.. not a friendly price range.  It's a new concept of an old design, but still lacks some features that would be considered standard at that price range.  The 500 to 600 dollar range should be basically the most reliable work horses ever, and the bed and a few other kinks are keeping the S1 from being that work horse.  It's like a Prusa price, but without the Prusa reliability- which honestly is the only reason Prusa can be argued to be worth the price range (as the print quality is not drastically better than a stock ender 3 from 2019, but the reliability is years ahead of the ender 3)\n\nIf it were $100 cheaper, I'd say go for it, it's not a \"workhorse' but your definately getting what your paying for (and you'll probably spend a little on , better beds, etc)   \n\nI just can't see the value in a PTFE lined Direct Drive system being more expensive than a non-PTFE lined (all metal) system being cheaper, no matter the gimmicky add ons.  (almost all of which are basic improvements considered by the community, like dual Z)\n\nAlso 2208's are nice and all, but most are suggesting 2209's in 2022, so they are using a still 'older' driver set and not quite pumping out what most \"new\" printers are pushing. (like Vorons, Ratrigs, SkTank, etc.)  even though most are also moving to 'coreXY design\" as the next ting, a good set of 2209's can go a long way.  IF the price included 2209's I could say it was close to price range, the biggest issue then only being the PTFE lined hotend -  which 100% should be all metal, and the minor problem of the fan angle.\n\nIt's nice to see Creality listening to community, making changes, and trying to do better - but they seem to be skipping some of the biggest things desired (all metal hot end) in order for more profits in the long run. I would have rather liked to see this version of the Ender3 delayed 6 months or even a year, make all metal hotends stock, and change that bed out for the price they are asking, the 'fan position' would be a tiny TINY concern then, as the 'value for what I paid\" would be tremendous. (assuming they didn't bump up the price)  they are working on an all metal hotend anyway for the S1 - to be sold seperately, and I feel this will be like the glass bed the Ender 3 had, where \"some\" will come with it, and some won't depending on how old of a model you purchased.",
        "id": 208,
        "like_count": 0,
        "author": "@xXKisskerXx"
    },
    {
        "text": "Interested to know your thought on the cr10 smart pro Vs the Ender 3 s1 pro",
        "id": 209,
        "like_count": 0,
        "author": "@richardmatthews7275"
    },
    {
        "text": "I used to have one keyword USED to have on. It was a great machine but unfortunately it stopped heating both the nozzle and bed but everything you said about the s1 is all true it is a truly great machine but it is sad that it broke",
        "id": 211,
        "like_count": 0,
        "author": "@bareedoboy6977"
    },
    {
        "text": "Totally agree with the bed surface comment. I have upgraded our S1's with the double sided PEI...they work \"preety freaking\"  fantastic, currently putting the Build Plate from Wham Bam through its paces.\nYour fan comment is right on the money.... call me OCD but we clean our fan every 100 hours or so since our machines are running pretty much 24/7. Now if they only had Silicon Socks in stock for the South Pacific that would be nice. \nWe did change a few settings for our PETG and carbon filament requirements, other than that we have only come across one issue...two of our machines bed plates will not heat up to the edges arrrrgh!!!!!!! that seems to be fairly common talking with others across the globe with the early releases; but realistically those sized and shaped prints are few and far between for us. \n\nKeep up the great work Joel, Sean and David.",
        "id": 212,
        "like_count": 0,
        "author": "@studiolucephotography8484"
    },
    {
        "text": "Excellent video Joel. Would you recommend the S1 Pro over the Prusa ?",
        "id": 214,
        "like_count": 0,
        "author": "@ken-xm8gh"
    },
    {
        "text": "I have a quite modified Ender 3 Pro and I'm quite happy with it. I'm looking forward for the S1 Pro that can print hotter and includes a PEI metal flex plate. The mods in mine makes it able to print nylon, but the S1 Pro seems like it would be more straightforward",
        "id": 215,
        "like_count": 6,
        "author": "@smokeduv"
    },
    {
        "text": "I have been a very happy user of the Ender 3 V2 and I'm stoked to hopefully get an S1 sometime in the near future.",
        "id": 216,
        "like_count": 2,
        "author": "@aaronsteers"
    },
    {
        "text": "A printer where I don't spend my time printing upgrades for itself? What a strange concept. \n\nIt really looks nice though, I could see myself getting one if one of my printers wouldn't work anymore.",
        "id": 217,
        "like_count": 0,
        "author": "@MrKretzsches"
    },
    {
        "text": "With that price tag, I'll point anyone at a Prusa Mini, if they want hassle free printing...",
        "id": 218,
        "like_count": 0,
        "author": "@Sundheden"
    },
    {
        "text": "I have been thinking about replacing my E3 v2 feeder with a direct drive  is this Cd feeder sold seperate and if so, is would it work as well on the E3 v2 as it does on the E3 S1?",
        "id": 219,
        "like_count": 0,
        "author": "@AshCanuk"
    },
    {
        "text": "Personally I'm more interested in the new CR-10 and I'm trying to decide between that and a kit to  build the new Voron. Speed and accuracy are more important to me than being able to print exotic materials. I plan to make prototypes and to do some Lost PLA casting and that means making things multiple times  with minor variations  so 'hurry up and wait' I can  do without :-)",
        "id": 220,
        "like_count": 2,
        "author": "@wanglydiaplt"
    },
    {
        "text": "Thanks a lot Joel, your voice was heard. Now we need a Creality end printer 400x400x400",
        "id": 221,
        "like_count": 0,
        "author": "@palaskecea"
    },
    {
        "text": "The machine looks promising. I wonder how the extruder will hold up. \nThe only issue with this thing like with all the other Chinese machines is...it is from China, a place where labor slaves are used for our good´s. And a place which really wants to invade Taiwan like Russia did Ukraine.",
        "id": 222,
        "like_count": 0,
        "author": "@sierraecho884"
    },
    {
        "text": "I have had my s1 for a bit now as my first filament printer, I have had a few years with resin.\n\nThe only stuff I know about filament going into it was a handful of YouTubers.\n\nAlright out of the box the thing prints amazing. Once I switched from creality slicer to actual cura (for tree supports).\n\nI have done all kinds of stuff so far including some print in place stuff and it has been absolutely great. Only complaint I have is that it is that it is kinda hard to remove support filament from the build plate, but I'm guessing that is an inexperience issue more than a machine issue.",
        "id": 223,
        "like_count": 1,
        "author": "@barge489"
    },
    {
        "text": "Yay! Just bought the S1... aaaand now the S1 Pro is announced. Ugh!",
        "id": 224,
        "like_count": 1,
        "author": "@BradCozine"
    },
    {
        "text": "Interesting how reviewers opinions can vastly differ. TH3D think this machine is utter garbage, incomplete firmware and cheap psu with a Creality name slapped on it etc. I agree with the psu, for that price it should at least be a MeanWell.",
        "id": 227,
        "like_count": 2,
        "author": "@cobusgrobler662"
    },
    {
        "text": "for that sum of money one could well have expected to get much more for one's money. it does not even have an original Mean Well psu. standard firmware to set up so it is mega slow in trying bed. so reached by the first thing one almost has to do is update the screen and firmware on board. the price is clearly set too high in relation to what you get for your money.\n\nwould be better to use 535doller's on an SV04 IDEX 3D Printer and yes it also uses creality hardware but you then get the opportunity to print in two colors",
        "id": 228,
        "like_count": 0,
        "author": "@WMH-3D-Printshop"
    },
    {
        "text": "i got my ender 3 in august as my first printer and it worked great right out of the box",
        "id": 229,
        "like_count": 0,
        "author": "@chrismorton8412"
    },
    {
        "text": "It looks like a big step forward for Creality, but there's always some bizarre design decisions they just have to throw in to keep things interesting. That part cooling fan! Why? As CHEP points out the PTFE-lined hotend is another. How many families will try to print higher-temp materials and gas themselves on burning PTFE fumes?\nI guess the question for people is whether to buy this one, or wait 3 months until Creality brings out their next Ender 3 variant? 😂",
        "id": 230,
        "like_count": 0,
        "author": "@JonS"
    },
    {
        "text": "it's overpriced junk. Wisps are going to get EATEN by that fan. By a standard 3 and upgrade it. You'll spend less  money on a better printer.",
        "id": 232,
        "like_count": 0,
        "author": "@melcrose"
    },
    {
        "text": "Please please please please, STOP saying: „Zee or Zet“. It‘s fricking annoying.",
        "id": 234,
        "like_count": 0,
        "author": "@hemi-pilot"
    },
    {
        "text": "What are reasons to get this over say like an Anycubic vyper (which I own)?",
        "id": 235,
        "like_count": 0,
        "author": "@raynlaze1339"
    },
    {
        "text": "From 4:17 on, exactly why I'm not going for Creality anymore. I did learn a TON from the previous models, as they indeed needed not only mods.... but MODS! :) There's always something I have to throw in the bin (in this case the sheet and maybe a redesign of the fan) and I just don't like that. With the experience I'm just saving up for something better.",
        "id": 237,
        "like_count": 2,
        "author": "@VincentGroenewold"
    },
    {
        "text": "You didn't have trouble with the dual rods? I had to add a timing belt to the top of my CR10S Pro to make it behave.",
        "id": 238,
        "like_count": 0,
        "author": "@ImaginationToForm"
    },
    {
        "text": "i might be biased, but i will say i feel like the ender 2 pro is a strong competitor for overall best Ender printer :P",
        "id": 240,
        "like_count": 0,
        "author": "@Deathbyfartz"
    },
    {
        "text": "But are the supports on the TPU ball getting off?\nI think TPU supports are hard to handle, because they like to fuse more than other filament sorts.",
        "id": 241,
        "like_count": 0,
        "author": "@FireN2k9"
    },
    {
        "text": "Waiting for the Ender 3 S1 Pro.. Going to bypass this one..",
        "id": 242,
        "like_count": 0,
        "author": "@HDTube101"
    },
    {
        "text": "I have one.  I can honestly say that I love printing on the S1.  It's my first printer and I did a lot of research on Youtube before deciding on buying.  The second runner up was the FLSun speed racer. I wanted a delta printer, so after I attained perfection with the S1, I bought the FLSun.  I could not be happier with these two printers. The FLSun is a fast, accurate, and amazing printer to watch.  The S1 is just about as good as it gets.  I do have to say, that the FLSun SR is especially nice because of the fixed bed. There is no need to level the bed, and one auto bed leveling operation is all you need to do.  But getting back to the main topic of the S1.  The S1 is worth the money and it's a beautiful piece of technology.  I love direct drive extrusion too.",
        "id": 243,
        "like_count": 11,
        "author": "@emilcost8613"
    },
    {
        "text": "When is your next Fan Mail Friday?",
        "id": 244,
        "like_count": 0,
        "author": "@Arcadenut1"
    },
    {
        "text": "Looks great but as I have an MK3S I think I'm good on \"small\" build plate printers...\n\nI am however wanting something that has a larger build plate. My experience with an Anycubic Chiron has been less than stellar.  Recommendations?",
        "id": 245,
        "like_count": 0,
        "author": "@chrisnenzel582"
    },
    {
        "text": "Creality probably asked where was the review for the S1 they sent you, since the S1 Pro is already out!",
        "id": 246,
        "like_count": 0,
        "author": "@marijuanas"
    },
    {
        "text": "Great video! My dremel 3d20 is finally starting to die, now it’s time to decide on whether to get the ender or the Neptune. Thanks for the info .",
        "id": 247,
        "like_count": 0,
        "author": "@armandoa2484"
    },
    {
        "text": "Please where’s the artillery sidewinder x2 review. Ive been waiting for the review since the livestream",
        "id": 248,
        "like_count": 0,
        "author": "@Joeyfordayz2301"
    },
    {
        "text": "I wonder if turning the fan upside down would help? But then the air would be going over the extruder motor, that often gets pretty toasty too... but it still might help!",
        "id": 250,
        "like_count": 2,
        "author": "@vit.budina"
    },
    {
        "text": "Got mine a couple of days ok. Incredible upgrade on my E3V2. Like he said - build plate isn’t great and will get a pei plate sound. Well worth the £319 I paid.",
        "id": 251,
        "like_count": 0,
        "author": "@markm49"
    },
    {
        "text": "FINISHED! there is a line I have NOT heard in a printer review in a while....",
        "id": 252,
        "like_count": 1,
        "author": "@fooman2108"
    },
    {
        "text": "I said this a couple times but now I think I'm sure, this will be my next printer. I've had all the ender 3's, except this one, and right now I have the ender 2 Pro and CR6SE, which is almost the same, but I think I want direct drive for TPU.",
        "id": 254,
        "like_count": 0,
        "author": "@georgerobert86"
    },
    {
        "text": "any chance of reviewing the ender 3 S1 Pro?",
        "id": 255,
        "like_count": 0,
        "author": "@michaelp12578"
    },
    {
        "text": "Cool video! I'd love to know if you have any fine-tuned settings that are a must?\nI really like my Ender 3 S1 so far; picked it up maybe a month and a half ago from Micro Center for $399. I haven't done any sort of major prints on it just yet, just a few figurines here and there but that's kind of what I want to do with it anyway. I figured I'd probably be spending the same amount of money getting an Ender 3 Pro and some upgrades opposed to the S1, but given my limited experience I've found the S1 to be great as I go through my first roll of Inland PLA+.",
        "id": 257,
        "like_count": 0,
        "author": "@GTechOfficial"
    },
    {
        "text": "I gave up trying to avoid glue stick.  It's far cheaper then replacing the bed and clean up in the kitchen sink only takes a few seconds.",
        "id": 258,
        "like_count": 0,
        "author": "@KeithZim"
    },
    {
        "text": "Great review Joel. I hope that Creality extend the upgrades from the 3 S1 to the other bigger models.",
        "id": 259,
        "like_count": 0,
        "author": "@georgiegeorge7442"
    },
    {
        "text": "Have had the S1 for almost 2 months now and for the most part it does well.  I did have an issue with the z offset that resulted in the stock bed taking some damage while trying to tune for petg.  I've since replaced it with a rough and smooth pei flex sheet and both of those are working well.  Note: features like pressure advance were disabled in the firmware and to avoid the constant back and forth of updating firmware, I switched it over to Klipper.  Since the S1 is so new there were few resources to help with this, but it was worth the effort.  It did highlight one issue, and this just might be my S1, but the USB-C connection drops sometimes.   I've tried different raspberry pi's and different cables and the only time i have an issue with any of them is on the S1.  I've never lost a print because of this, but sometimes it can take a few minutes to get it up and running.   My plan is to replace the controller board with a BTT Pico if it gets any worse.  Also, for taller prints, the nozzle would start hitting the previous layers.  I ended up loosening up the vertical supports, clamping them in place with a couple squares, re-tightening things, and that appears to have taken care of it.",
        "id": 260,
        "like_count": 3,
        "author": "@nunyabizness6734"
    },
    {
        "text": "I was waiting for your review now i got a new ender thanks to you happy printing:)",
        "id": 261,
        "like_count": 0,
        "author": "@srijantanwar3245"
    },
    {
        "text": "I have the cr6se is it more fun than that",
        "id": 262,
        "like_count": 0,
        "author": "@doomxpwave"
    },
    {
        "text": "I love the build area on my Sidewinder X1 and i'm thinking about getting a new printer to add to my print farm.  (I have  a M2P and a Saturn resin printer also)   Thing is I really don't want to go down in bed size.  I saw one somewhere (from Creality) that had a larger bed (500x500x? would be awesome)  but I really want NO BODEN tube, and I saw interchangeable heads so that you could put on a laser engraver, yes please.  Is there one you can review?  I've heard a lot of bad talk about Ender 5's.  What's your take...",
        "id": 263,
        "like_count": 0,
        "author": "@snowwolvesproductions"
    },
    {
        "text": "got mine about a month and a half back.  huge improvement over the ender 3 pro.",
        "id": 265,
        "like_count": 0,
        "author": "@technodrone313"
    },
    {
        "text": "I think the S1 Pro has the better deal. with 2 z lead, all metal hotend and a PEI sheet.",
        "id": 266,
        "like_count": 0,
        "author": "@jovanienazaire1362"
    },
    {
        "text": "I used to have an Anet a8, the mainboard fried and it was 50$ to replace it, so I decided to save up a little and purchase a new printer. I bought a nice Ender 3 V2 and man, the difference is hell from earth. I feel like I've gone from playing in the hardest difficulty, to playing in the easy mode. 10/10 would experience again!",
        "id": 267,
        "like_count": 0,
        "author": "@JoaoGabriel-se9rk"
    },
    {
        "text": "LOVE mine. Absolutely love it. $hits all over my Hemera on my cr10 pro with bltouch. All I am waiting for is the high temp heatbrake I ordered from creality so I can get back to printing my high temp filaments.",
        "id": 268,
        "like_count": 0,
        "author": "@prostreetcamaro"
    },
    {
        "text": "I have a ender 3 and a s1  $400 well spent.",
        "id": 269,
        "like_count": 0,
        "author": "@jobe41"
    },
    {
        "text": "Considering the price I am not a massive fan and definitely would not buy one.  There have been people having issues with the extruder the cr touch and bed adhesion. How many are having problems I don’t know.\nYou could get 2 Ender 3pros for about the same or buy one Ender 3 pro and mod it with a better all metal hotend and a new board and a better bed for the same price.\nI do agree that not everyone wants to mod things but considering the big price jump I would be buying a different make.\nSee there is going to be a pro version of this with a all metal hotend at a ridiculous price. \nYou can only review the printer you get I appreciate and I would not buy this at this price if it was a hundred bucks cheaper maybe. \nI have 2 Ender 3s a standard and a pro and to be honest they both print beautifully so at this price it does not interest me.\nInteresting to see all the different reviews though I have seen two others so far and do notice that each one does find the price to be too high.",
        "id": 270,
        "like_count": 4,
        "author": "@paulmilne3038"
    },
    {
        "text": "There's an S1 Pro that I hope do a review of that too.",
        "id": 271,
        "like_count": 0,
        "author": "@surft"
    },
    {
        "text": "Great review. I think an interesting idea for video would be retrofitting a Sprite extruder to a Ender 3/Pro. How about it @3D Printing Nerd? @CHEP ?",
        "id": 272,
        "like_count": 0,
        "author": "@boriskrivitsky3142"
    },
    {
        "text": "Beginners ask me all the time if they should buy an Ender 3. My answer is always yes if it's all you can afford, but if you can throw more money, buy a Prusa MK3S+ (kit). Its well worth the extra money in my opinion, and the instructions for putting one together are terrific, and I feel assembly helps people better understand how things work.",
        "id": 274,
        "like_count": 1,
        "author": "@grantdeisig1360"
    },
    {
        "text": "This is probably good to recommend to my less technical friends and family.",
        "id": 275,
        "like_count": 0,
        "author": "@orange-micro-fiber9740"
    },
    {
        "text": "I have a pro and loved it after I upgraded it to the s1 stuff before it came out…",
        "id": 279,
        "like_count": 0,
        "author": "@ChunkiieCustomz"
    },
    {
        "text": "Hey Joel! That's an incomplete review. No words about the shipped slicer software... Not how the hotend actually handles or not ABS (it's PTFE-lined, isn't it?) In any case, thanks for the review!",
        "id": 280,
        "like_count": 0,
        "author": "@ucirello"
    },
    {
        "text": "how does the Ender 3 v2 compared to the Ender 3 s1 so could it be up dated or would it be to much money great video good job",
        "id": 281,
        "like_count": 0,
        "author": "@prestongriffin416"
    },
    {
        "text": "How easy is the first layer calibration?",
        "id": 282,
        "like_count": 0,
        "author": "@marcpouliot1"
    },
    {
        "text": "Hi!  I have the ender 3 s1 and I bought it for exactly the reasons you state, I don’t want to tinker with the mechanics I just want to print.  After three months now, I agree that the build plate is getting replaced (any recommendations?) and I’ll probably be modifying the fans like how Nathan builds Robots showed in his video.",
        "id": 283,
        "like_count": 2,
        "author": "@keithkolmos5933"
    },
    {
        "text": "Great review Joel. I just wrapped up shooting my review last night and it’s hilariously similar in thoughts. Haha. Only difference is mine got a bit damaged in shipping. But that’s irrelevant to the actual machine. This is a solid “benchmark” in this price range.",
        "id": 284,
        "like_count": 1,
        "author": "@3DPrintSOS"
    },
    {
        "text": "Here is a good comparison of the difference between the Ender 3 S 1 and the Pro. No question that the pro is clearly worth the extra $70 ! \n\nhttps://youtu.be/x7nIJoKfc78",
        "id": 285,
        "like_count": 0,
        "author": "@EdGodoyPlana"
    },
    {
        "text": "This review is very helpful👍👍",
        "id": 287,
        "like_count": 7,
        "author": "@3DELWORLD"
    },
    {
        "text": "There new one is ender 3 s1 pro",
        "id": 289,
        "like_count": 0,
        "author": "@3d2dcrafts2"
    },
    {
        "text": "Question comes to mind, which I haven't seen answered yet anywhere and I know more ppl want to know: does the sprite extruder basic or all metal one, fit on an Ender 3 or V2????",
        "id": 291,
        "like_count": 0,
        "author": "@edwinvanderhulst7703"
    },
    {
        "text": "dying laughing over here... \"It's like a BL Touch, but the BL has been replaced with a CR\" hahaha",
        "id": 292,
        "like_count": 124,
        "author": "@UncleJessy"
    },
    {
        "text": "Great summary as always. But like I stated in my review, for that price it should have an all metal heat-break not PTFE  to the nozzle. You realistically only get 235°C max long term as PTFE will degrade. For all metal you have to spend $70 more for the S1 Pro.",
        "id": 293,
        "like_count": 186,
        "author": "@FilamentFriday"
    },
    {
        "text": "Looks like a great machine but the price of the enders is getting pretty inflated. The biggest reason the ender is so popular is because it is cheap and reliable. \n\nThat said, it is really great to see the ender getting a lot of the upgrades so we don't have to do them ourselves.",
        "id": 296,
        "like_count": 5,
        "author": "@jessebryantraylee"
    },
    {
        "text": "But but, if I don’t do all the upgrades myself I’ll never leeeeaaarrn. 🤣 Jk,so glad to see machines that freakin work beautifully out of the box.",
        "id": 297,
        "like_count": 0,
        "author": "@stldenise"
    },
    {
        "text": "Can I print a turboman using it!?!?! Sinbad can't stop me right?",
        "id": 298,
        "like_count": 1,
        "author": "@TheSlowpC"
    },
    {
        "text": "Thanks for your thoughts on the S1.  I’d love to see you do a video on making the S1  work with octoprint with all the stuff like filament loss working.",
        "id": 299,
        "like_count": 2,
        "author": "@davidlondon3111"
    },
    {
        "text": "It’s already outdated. Just 100$ more gets you the S1 pro which fixes the few flaws it has left.",
        "id": 300,
        "like_count": 0,
        "author": "@crowguy506"
    },
    {
        "text": "Was the original Ender 3 pure luck? Follow other people’s designs, source cheap parts, and sell cheap printer that works ok for the price. I like my MP Cadet because of the shielding keeping small hands out of the hot print end. Makes it easy for me to put the printer next to my 2D printer.",
        "id": 301,
        "like_count": 0,
        "author": "@mobilechaosyt"
    },
    {
        "text": "Have you tried cleaning the print plate with 90% or higher concentration IPA?  That works really well to rejuvenate my textured print surface although it's not that printer.  I suspect it is cleaning out clogged pores.  I print PLA only so I don't know how it might work with other materials.",
        "id": 302,
        "like_count": 0,
        "author": "@winstonsmith478"
    },
    {
        "text": "This is the prusa killer. Why pay $700 dollars? This machine is amazing and it should have been like this from the beginning.",
        "id": 303,
        "like_count": 0,
        "author": "@emanuelcalderon"
    },
    {
        "text": "It could very well be the best Ender ever. At over twice the cost of the original Ender 3, I would hope so. :)",
        "id": 304,
        "like_count": 7,
        "author": "@MrLrwatson"
    },
    {
        "text": "I love my S1 so much. I've had it operating almost 24/7 for the past month. I exclusively use mine for tabletop gaming scenery pieces so I have only been using PLA at 200/60 with 5%-50% infill depending on what I'm doing. I've been using pretty much the cheapest 10kg at $13/kg PLA+ available through it and haven't had a single issue with it that took longer than 15 minutes to resolve.",
        "id": 305,
        "like_count": 37,
        "author": "@shepahotep"
    },
    {
        "text": "I have an 3 ender 5s and got my ender 3 s1 about a month ago .. it has been printing 24/7 for parts manufacturing and I have not had 1 problem yet .. only the bed .. the bed is too good . I have to run a blade under the purge line to get it off it sticks like i said tooo good",
        "id": 306,
        "like_count": 2,
        "author": "@julianvega2785"
    },
    {
        "text": "you gotta review the S1 PRO!",
        "id": 307,
        "like_count": 3,
        "author": "@jamiainen"
    },
    {
        "text": "I can't wait for the Prusa XL video!! I've got one pre-ordered myself! 👍😁",
        "id": 310,
        "like_count": 1,
        "author": "@digitaldevil2493"
    },
    {
        "text": "Is the CR10 Smart Pro as good?",
        "id": 311,
        "like_count": 1,
        "author": "@TheKdcool"
    },
    {
        "text": "how best is best? we know ender products are cheesy and ask lotnof investment",
        "id": 312,
        "like_count": 0,
        "author": "@ygalion"
    },
    {
        "text": "I'm still pluggin away with my OG 3, adding upgrades when i want/need. Its great to see that creality has added some of the most popular as stock equipment here. That being said if this was out when i got mine, i wouldnt have been able to afford it since im eternally broke xD.",
        "id": 314,
        "like_count": 6,
        "author": "@Javierm0n0"
    },
    {
        "text": "Awesome. Don't forget about the pro version, it has improved hotend for high temperatures",
        "id": 315,
        "like_count": 0,
        "author": "@octopusNavi"
    },
    {
        "text": "I have the original Ender 3 and have printed hundreds of things on it - this version looks so clean and awesome from the start. Thanks for the video!",
        "id": 317,
        "like_count": 57,
        "author": "@CASSDesigns"
    },
    {
        "text": "A friend of mine picked up the s1 and loves it. I have an ender 5 already or I'd be looking at getting one too.",
        "id": 319,
        "like_count": 0,
        "author": "@technoe02"
    },
    {
        "text": "So I'm going to be Ok as a beginner with the S1 ?",
        "id": 320,
        "like_count": 1,
        "author": "@pablorages1241"
    },
    {
        "text": "Cool",
        "id": 321,
        "like_count": 0,
        "author": "@bradygreensides6495"
    },
    {
        "text": "absulately love you joe keep doing what you do",
        "id": 322,
        "like_count": 1,
        "author": "@sameerUNO10100"
    }
]