[
    {
        "text": "Free Palestine 🇵🇸",
        "id": 1,
        "like_count": 614,
        "author": "@SchoolofScent"
    },
    {
        "text": "Bruh Eros smells like cleaning spray and it smells nothing like vanilla",
        "id": 5,
        "like_count": 0,
        "author": "@RedDeadWrangler"
    },
    {
        "text": "Jesus loves you ❤",
        "id": 11,
        "like_count": 0,
        "author": "@Adaeam123"
    },
    {
        "text": "Free Palestine ❤",
        "id": 13,
        "like_count": 0,
        "author": "@anooshomid4889"
    },
    {
        "text": "i tried light blue and it smelled like sweat on my skin 😔💔",
        "id": 18,
        "like_count": 1,
        "author": "@sbudaaaaa"
    },
    {
        "text": "Le Parfum is better Ultra Male",
        "id": 42,
        "like_count": 0,
        "author": "@johnjenkins777"
    },
    {
        "text": "Enjoying your videos !",
        "id": 45,
        "like_count": 0,
        "author": "@illu6624"
    },
    {
        "text": "Excellent. God bless.",
        "id": 47,
        "like_count": 1,
        "author": "@juliochingaling5824"
    },
    {
        "text": "Maison alhambra persues please",
        "id": 52,
        "like_count": 0,
        "author": "@7kn1ght36"
    },
    {
        "text": "Free Palestine 🇵🇸",
        "id": 54,
        "like_count": 1,
        "author": "@hafizi9111"
    },
    {
        "text": "FREE PALESTINE",
        "id": 67,
        "like_count": 2,
        "author": "@triplea18"
    },
    {
        "text": "Make jaguar series video pls",
        "id": 69,
        "like_count": 0,
        "author": "@muhammadsyihab2636"
    },
    {
        "text": "Free Palestine✌🤝♥",
        "id": 72,
        "like_count": 2,
        "author": "@marckupelian7851"
    },
    {
        "text": "Jaïpur EDP is great!",
        "id": 73,
        "like_count": 0,
        "author": "@TheSharkPCF"
    },
    {
        "text": "Free palestine 🇵🇸 🕊",
        "id": 74,
        "like_count": 2,
        "author": "@user-xr8ff4jk9m"
    },
    {
        "text": "Love your channel",
        "id": 76,
        "like_count": 1,
        "author": "@mr_dervaa8301"
    },
    {
        "text": "I love the fragrance community on TikTok. Everyone is asking about different colognes and others respond. Everybody helps eachother. I love It!",
        "id": 3,
        "like_count": 4,
        "author": "@Sturmgeschutz_III_Ausf.G"
    },
    {
        "text": "oud touch is my daily bc its my only fragrance",
        "id": 4,
        "like_count": 0,
        "author": "@arnas_saul5849"
    },
    {
        "text": "I appreciate this type of content.. please do continue to produce.. bless..",
        "id": 6,
        "like_count": 0,
        "author": "@ebj9510"
    },
    {
        "text": "In Australia, montblanc explorer is more than triple Nautica 😓",
        "id": 8,
        "like_count": 1,
        "author": "@hammerr9487"
    },
    {
        "text": "Imo swy absolutely is a mix of Jazz club and eros.",
        "id": 10,
        "like_count": 0,
        "author": "@putin221"
    },
    {
        "text": "gimme that jeremy fragnance",
        "id": 12,
        "like_count": 0,
        "author": "@TradingSlave"
    },
    {
        "text": "I have try oud touch,and it's really great..long lasting and head Turing..compliment getter too..also lattafa ameer al oudah..it's great aswell...",
        "id": 16,
        "like_count": 1,
        "author": "@sadaingabbidon2779"
    },
    {
        "text": "Not sure who that dude is with the 80s perm and stash but I honestly can’t take him seriously.",
        "id": 17,
        "like_count": 0,
        "author": "@01bigtrev"
    },
    {
        "text": "People are going to be rather surprised if they get the Jaipur. It smells like somewhat 'old school' shaving cream.",
        "id": 19,
        "like_count": 0,
        "author": "@bjornegan6421"
    },
    {
        "text": "imo d&g light blue eau intense is super overrated, and the original pour homme is a much nicer scent.",
        "id": 20,
        "like_count": 0,
        "author": "@cookiez3813"
    },
    {
        "text": "In London prada luna Rosa and Dior Sauvage edt/ edp are very similar in price give or take £5",
        "id": 22,
        "like_count": 0,
        "author": "@Ghostpill1711"
    },
    {
        "text": "Mercedes Club Black Ain't discontinued",
        "id": 23,
        "like_count": 0,
        "author": "@KingSlayer420"
    },
    {
        "text": "Surprise, surprise, Omar support Hamas , do not subscribe to this channel",
        "id": 24,
        "like_count": 1,
        "author": "@davidusher7433"
    },
    {
        "text": "Hey bro, been watching for a couple months and just subbed, got any fragrance recommendations for a young man(15 years old)",
        "id": 25,
        "like_count": 1,
        "author": "@user-kl9zw9uf4r"
    },
    {
        "text": "I just bought stronger with you absolute can anyone please give me some fragrances that have a similar feel",
        "id": 26,
        "like_count": 1,
        "author": "@shshbsbd"
    },
    {
        "text": "is jpg le male le parfum good for teenagers as a winter signature?",
        "id": 27,
        "like_count": 0,
        "author": "@gy4nk125"
    },
    {
        "text": "I do own both swy absolutely and azzaro tmw and I adore both of them.",
        "id": 28,
        "like_count": 0,
        "author": "@az7x87"
    },
    {
        "text": "I’m looking for a smoother more natural smelling Oud touch. The opening of the cheap ouds are like a chemical explosion to me.  I want to keep it close to $100, And be in the style of Oud Satin Mood. Any suggestions anyone?",
        "id": 30,
        "like_count": 0,
        "author": "@plaubelmakina8916"
    },
    {
        "text": "Soooo AoT ended... what were your thoughts of the grande finale?\n\n\n\nAlso nice video, but i dont get why Eros is so loved, i dont think its special.... Eros flame is nice tho",
        "id": 32,
        "like_count": 0,
        "author": "@xwhiteoutx6513"
    },
    {
        "text": "I am on a 1 month break from fragrance, and this is day 14 of no fragrance at all. Man i miss them! I am doing this to clear nose blindness. Normally i only do a one week break but it doesn't take long before the nose blind issues kick back in.\n\nSo, as a treat to myself,  I ordered Mr Majestic as a self gift for my birthday coming up as i love plum! It is my favourite note, so if it comes before my break ends, i will make it my first fragrance to wear after a month! Can't wait 🤩",
        "id": 33,
        "like_count": 2,
        "author": "@Mitchcraft."
    },
    {
        "text": "The guy saying nobody has a bad thing to say about Light Blue Eau Intense clearly has not done much research, there are a lot of people who hate this fragrance. I did at first but wore it a few times and got past it and now love it on its own, and it is great for layering with many fragrances.",
        "id": 35,
        "like_count": 0,
        "author": "@Mitchcraft."
    },
    {
        "text": "Again you got it wrong with Ultra Male. In my skin it smells like a cold Yakult (the probiotic) and in the deep dry down it smells a little balsamic and woody with that Iso E Super.",
        "id": 38,
        "like_count": 0,
        "author": "@engell3707"
    },
    {
        "text": "Dior homme sport is really well done",
        "id": 39,
        "like_count": 0,
        "author": "@DRJoinRumbleStayFree"
    },
    {
        "text": "Eros is a modern classic, let’s be real. It holds the same place in younger guy’s hearts as ADG or Le Male did back in the day.",
        "id": 43,
        "like_count": 9,
        "author": "@Dimasterim"
    },
    {
        "text": "This is why your channel is at the top. When most reviewers are talking about “ fall and winter fragrances “ that make you smell like a walking doughnut it’s nice to see this kind of video.",
        "id": 48,
        "like_count": 17,
        "author": "@pstan314"
    },
    {
        "text": "No lie I’m fan of Eros fan. I don’t wear it for occasions. It’s become my running errands fragrance since it’s become very popular.",
        "id": 55,
        "like_count": 1,
        "author": "@Leonard_Washington76"
    },
    {
        "text": "I got club black 3 months ago, and it was a March 2023 batch. Not discontinued.",
        "id": 56,
        "like_count": 3,
        "author": "@smackd1870"
    },
    {
        "text": "Mercedes Benz Club Black got so much demand, it just sold out not long after releasing new batch \ni am lucky to snatch one up end of last month as notino fr restock and few days later out of stock 😲",
        "id": 57,
        "like_count": 2,
        "author": "@thegreatneess"
    },
    {
        "text": "Agree on Legend spirit. I agree Nautica is not great to me.  I too get that rotten egg smell on many aquatic and blue scents. Sucks cause i like them. I prefer Ocean out of all the Luna Rossas and i don't get the rotten egg smell.",
        "id": 58,
        "like_count": 0,
        "author": "@derred723"
    },
    {
        "text": "I have to admit, the word \"ridiculous\" in the title had me looking forward to some clever takedowns, but the most we got was \"yeah, I can see their point.\" You were much less forgiving when you talked about viewer collections, and we're the people who support you. You should be roasting the videos that leave it at \"this is a good fragrance, and this is a good fragrance, and this one, too\" -- all while failing to tell us WHY. (Except to say because it was their first fragrance, or because it's cheap.) They should all be telling us why one fragrance is better than the other, whether for the office, gym, clubbing, etc. Any random Tiktokker can make a loop that lists their favorites. I would recommend that you not give positive exposure to such content-free media.",
        "id": 60,
        "like_count": 1,
        "author": "@blueapples"
    },
    {
        "text": "I prefer eros flame myself 🔥, so many good recommendations ill be saving this video for later.",
        "id": 62,
        "like_count": 1,
        "author": "@henry3k90"
    },
    {
        "text": "12:38 I agree. I bought a 50ml bottle for 20€. It's hard to not like that one.",
        "id": 63,
        "like_count": 0,
        "author": "@lgeiger"
    },
    {
        "text": "Love these",
        "id": 64,
        "like_count": 1,
        "author": "@repbrooklyn"
    },
    {
        "text": "You gotta try Boucheron's Jaïpur Homme EDP. It's a really interesting oriental fragrance. When i first got it, i always thought it's perfect for the fall/winter. The more i wore it, i found it more suitable for the transitional phase from winter into spring, right around March to May is the best time for me to wear it. It has enough freshness and airyness and a slight floral touch for the warmer weather but still that oriental spicyness.",
        "id": 65,
        "like_count": 3,
        "author": "@TheMadKollektah"
    },
    {
        "text": "Omar coming in to absolutely make our day with another reaction video. Absolutely love your content and have learned so much from your reviews and buying guides.",
        "id": 68,
        "like_count": 32,
        "author": "@nicholassteiner8340"
    },
    {
        "text": "Jeremy is a clown that has to stage a video with a woman giving him a compliment.",
        "id": 75,
        "like_count": 1,
        "author": "@jdmb03"
    },
    {
        "text": "Can you do another selfie suggestion type of video with your followers, would love to be part of it.😅",
        "id": 77,
        "like_count": 2,
        "author": "@justinkhirtmenancio2005"
    },
    {
        "text": "We need a day in the life Omar! Both of your personal life and atrium fragrance day in the life",
        "id": 78,
        "like_count": 5,
        "author": "@shabsmalik694"
    }
]