[
    {
        "text": "Great video Paul…",
        "id": 12,
        "like_count": 0,
        "author": "@jonathanspeltri"
    },
    {
        "text": "Great video mate!",
        "id": 14,
        "like_count": 1,
        "author": "@Alex.Hubball"
    },
    {
        "text": "Muy sensible e inteligente descripción.",
        "id": 43,
        "like_count": 1,
        "author": "@antoniosaizg.619"
    },
    {
        "text": "Good video....",
        "id": 50,
        "like_count": 1,
        "author": "@tennysonclothing5795"
    },
    {
        "text": "Appreciate the video Paul, I'm glad that you're back to producing them. You already were one of my favourite fragrance YouTubers before your break but since your comeback you've had a certain attitude about you that makes me like you even better. Sticking it to the snobs, trolls and BS Fragrantica reviewers who, judging by the contents of their reviews clearly don't even own the fragrance! And now you're also bringing a more proletarian approach to fragrance collecting (which is very timely) but with the same standards and production quality, going back to the roots/basics of what this hobby is all about: smelling good! Somewhere down the road, this community went from a bunch of guys and galls sharing their passion for juice that smells good and helping each other navigate the ocean of fragrances to find what they like without having to buy all of them to people flexing about how much they've spent and cringe worthy external validation seeking compliment hunters. This change happened around 2016 I'd say, right when a certain other content creator you mentioned in this video blew up and made the Fragcom more mainstream. Oh well, the juice is still what it's all about for me so I don't give a hoot anyway 🤣",
        "id": 1,
        "like_count": 9,
        "author": "@Top_Lad"
    },
    {
        "text": "Please can we get more of these budget fragrances. I actually enjoy them. Especially with the current cost of living crisis",
        "id": 2,
        "like_count": 0,
        "author": "@dinartesoares13"
    },
    {
        "text": "Hi\nNice frangipanes are these for ladies? Or men do u get these on the middle  isle  of lidl? Not seen perfume on the normal shelfs.\n I bort 1 in Aldi cost 599p but i got   reducef at £4.19p its  a copy pour femme. Smells ok. 😊  thanks\n 👋  bye",
        "id": 3,
        "like_count": 0,
        "author": "@ksmith1770"
    },
    {
        "text": "I got a few of these yesterday after trying the tester of Acqua fresh in the shop. It's a 1:1 of Adg before recent reformulations. It reminds me of what Adg smelled like in around 2002",
        "id": 4,
        "like_count": 0,
        "author": "@wangouthangout"
    },
    {
        "text": "I wasn't impressed by theBoss Bottled (so called Grey Hugo Boss) in the shop by fiance got it anyway and I fell in love ...again ;) with the scent I mean",
        "id": 5,
        "like_count": 0,
        "author": "@edithobrien7118"
    },
    {
        "text": "to me DEEP BLUE smells like the classic D&G Homme (clear bottle blue top)",
        "id": 6,
        "like_count": 0,
        "author": "@edithobrien7118"
    },
    {
        "text": "I tried few of these and have to say for that price they smell better than expected, really close to expensive fragrances and last for days (and not smelling like a piss/ old fragrance later), even when you wash your clothes, you can still feel the smell and you don't have to pour half bottle on you, just 2-3 sprays last for whole day.",
        "id": 7,
        "like_count": 0,
        "author": "@rawux1228"
    },
    {
        "text": "Acqua Fresh great performance for that price.",
        "id": 8,
        "like_count": 1,
        "author": "@ivanzdravkovic5940"
    },
    {
        "text": "I came here after buying the One today and thinking to go back and buy a few more, I am so happy with it and it has lasted over 3hrs for me, I have been told that it is a dupe of 1million which I really dislike, smells better in my opinion and watching your video helped, going back to buy 2 more frangrances - these are perfect for my gym sessions which last over 2hrs",
        "id": 9,
        "like_count": 0,
        "author": "@bkings688"
    },
    {
        "text": "i really love the bellini homme. after taking a shower in the morning it really gives you the right motivation to start the day. it is amazing. never compared it to dior sauvage though",
        "id": 10,
        "like_count": 0,
        "author": "@stefanweilhartner4415"
    },
    {
        "text": "Great video. Would you say the homme sauvage edp clone will be as accurate (just better dilution) than the edt you reviewed and thought was pretty good here?",
        "id": 11,
        "like_count": 0,
        "author": "@TMQ1981"
    },
    {
        "text": "One Fragrance is now Eau de parfum and smells amazing. I mixed it with Homme and had women dropping at my feet 😂",
        "id": 13,
        "like_count": 1,
        "author": "@GamerUK"
    },
    {
        "text": "That's a great video and really nice approach! Late to the party but I was impressed",
        "id": 15,
        "like_count": 1,
        "author": "@ivansotirov2457"
    },
    {
        "text": "I'm really impressed by the Essence Dark Blue.",
        "id": 16,
        "like_count": 2,
        "author": "@apostolosk446"
    },
    {
        "text": "Dark Blue is better than new reformulation of Dolce Gabban pour homme! Best buy ever, very close to original from 1995",
        "id": 17,
        "like_count": 1,
        "author": "@davormargetic1881"
    },
    {
        "text": "I tested a few the other night and when I got home elegance what's by far the best smelling. I'm so glad you figured out what it's a dupe of. I'm going to buy a bottle next time I'm there because I think it smells awesome.",
        "id": 19,
        "like_count": 0,
        "author": "@russellbonell"
    },
    {
        "text": "Thank you on awesome analysis. My choice for the best is Dark blue, it is almost identical to D&G pour homme and One disappointed me the most.",
        "id": 20,
        "like_count": 0,
        "author": "@markh5748"
    },
    {
        "text": "Great review. I saw all these but had no idea what some of them were dupes of",
        "id": 21,
        "like_count": 1,
        "author": "@Foolio2008"
    },
    {
        "text": "Reminds me how I feel about acqua essenciale Blu. $30. I like it better then Y EDP and many other much more expensive \"blue\" type scents.",
        "id": 22,
        "like_count": 0,
        "author": "@davidgeorge975"
    },
    {
        "text": "Lidl One Fragrance is one of the most beautiful scents that I have ever smelt.",
        "id": 23,
        "like_count": 3,
        "author": "@daveboy1247"
    },
    {
        "text": "Omg Paul mate X-Bolt is absolutely spot on for Boss Bottled No1 can tell the difference I love em so much my Mum is buyin Deep Tomo I can't Bloody Wait Niceeeee 1 Lidl",
        "id": 24,
        "like_count": 1,
        "author": "@RattyGreen"
    },
    {
        "text": "Brilliant stuff! Thank you!",
        "id": 25,
        "like_count": 0,
        "author": "@jimsimm7144"
    },
    {
        "text": "That snap at Jeremy's fragrances : brilliant :-)      But on topic : X-Bolt is brilliant - Boss Bottled is still one of my all-time favourites and X-Bolt smells indeed \"better\" (even though it's 99% similar) and is also longer lasting.",
        "id": 26,
        "like_count": 0,
        "author": "@echdareez"
    },
    {
        "text": "Great review, very well presented 👍\nThx from Munich... 😉",
        "id": 27,
        "like_count": 0,
        "author": "@MindBlower18"
    },
    {
        "text": "So the name of the fragrance I have is \"one fragrance\", not \"the one\" but mine is pretty good. Vanilla scent. Comfortable, not synthetic, holds and projects well. For me it's the best sweet perfume. Even prefer it over Versace's dreamer.",
        "id": 28,
        "like_count": 1,
        "author": "@lennykump8396"
    },
    {
        "text": "I always assumed Essence Acqua Fresh was a copy of Issay Miyaki. Smells very reminiscent to me :)",
        "id": 29,
        "like_count": 2,
        "author": "@RedMachineKieran"
    },
    {
        "text": "Essence Victory is my every day fragrance, absolutely love it and is such a long lasting smell for the price :)",
        "id": 30,
        "like_count": 2,
        "author": "@RedMachineKieran"
    },
    {
        "text": "x bolt is really like boss bottled",
        "id": 31,
        "like_count": 0,
        "author": "@canterburied"
    },
    {
        "text": "To me, victory also smells very similar to Armani stronger with you!!",
        "id": 32,
        "like_count": 2,
        "author": "@tonygagg9837"
    },
    {
        "text": "Honeslty Homme  is fantastic and great value. Sauvage is like £94, so this is about 17x cheaper. For me this is a very, very, very good copy. So much so I think if you chucked this in a sauvage bottle no one would know anynthe wiser. The problem is people in their head will see the price and immediately just see it as inferior! It isn't! This is fantastic!!!",
        "id": 33,
        "like_count": 9,
        "author": "@lukenukem2441"
    },
    {
        "text": "thanks for the video.",
        "id": 34,
        "like_count": 1,
        "author": "@eleonoras8132"
    },
    {
        "text": "Are these still going ? Love Aqua Di Gio, so might give this a try.",
        "id": 35,
        "like_count": 0,
        "author": "@graemef7172"
    },
    {
        "text": "Hi, is there any chance of a review of cheap fragrances from La Rive?",
        "id": 37,
        "like_count": 1,
        "author": "@Marlena_Q"
    },
    {
        "text": "Regards from Romania, I also bought four perfumes from our local lidl, namely from the petrol victory and dark blue range, I also took x-bolt and from the fragrances range I took Wood which is also my favorite being a copy of terre d 'hermes, I can say that they are all good perfumes for a lower budget and with a persistence of less than two or three hours",
        "id": 38,
        "like_count": 2,
        "author": "@fortzosu09"
    },
    {
        "text": "The Lidl Homme is really great.. \nI did not like the One Million\nX-bolt is also great..",
        "id": 39,
        "like_count": 0,
        "author": "@TheRealJohnHooper"
    },
    {
        "text": "X_bolt from lidl is lovely, the women don't believe me when I tell them it is from there",
        "id": 40,
        "like_count": 0,
        "author": "@nonrevnosnibormetalbeerrev6251"
    },
    {
        "text": "Great job. I love X bolt and the Essence line from Lidl",
        "id": 41,
        "like_count": 1,
        "author": "@oanaroman3523"
    },
    {
        "text": "Justr bought Elegance. For me it's 1000% a Creed Aventus clone. I've never smelled \"the scent\" but it's just identical to Creed Aventus Thoughts?",
        "id": 42,
        "like_count": 0,
        "author": "@YeCannyDaeThat"
    },
    {
        "text": "And i LOVE the homme (sauvage ripoff)",
        "id": 45,
        "like_count": 0,
        "author": "@DAN.eight6"
    },
    {
        "text": "I smelled the essence fragrances today, the one i liked smelled the most feminine out of the range.. thought i picked up the right one but got dark blue and upon spraying at home it is not the one i thought. Which would you say smells the most feminine?",
        "id": 46,
        "like_count": 1,
        "author": "@DAN.eight6"
    },
    {
        "text": "What essence perfume last longer? I want to buy 1 or 2, except ellengance this one isnt ar my lidl, and this are good perfumes for parents to buy for they kids, my mom send me to school, when i was younger, with axe and kappa perfumes and they didnt smells good at all 😭",
        "id": 47,
        "like_count": 1,
        "author": "@yzxz9012"
    },
    {
        "text": "Thank you very much for this Paul…..I’ve always wondered about these scents. You’re really hitting the bulls eye in terms of an original approach.",
        "id": 48,
        "like_count": 4,
        "author": "@lordcharfield4529"
    },
    {
        "text": "Subscribed xx",
        "id": 51,
        "like_count": 0,
        "author": "@darrenwalshe8513"
    },
    {
        "text": "Elegance smells a bit like ysl homme and terre d’ Hermes. It was driving me mad too.",
        "id": 52,
        "like_count": 0,
        "author": "@katyg3873"
    },
    {
        "text": "The essence aqua is an issey miiyake clone and smells EXACTLY the same as the original.",
        "id": 53,
        "like_count": 9,
        "author": "@katyg3873"
    },
    {
        "text": "Love the videos, any chance you can review some of the inspired by fragrances that come from \"The Essence Vault\" as I have a few of theirs and I'd like to know what you think",
        "id": 54,
        "like_count": 0,
        "author": "@dsluggy"
    },
    {
        "text": "Looool so true I don't think niche is worth the money for the most part and I own a fair few niche scents.In addition to over 70 designers i have concluded that I want 14 more as they are scent profiles I dont have.Beyond that I have no need or desire for more,I'm very much satisfied I have both quality and quantity.\n\nBrands to avoid are Creed,Roja Dove Clive Christian amongst a few others yes they have some quality scents but performance is frankly shocking.Instead I'd say look into designers and if on a budget Car Brands Bentley Ferrari older brands like Azzaro,Ted Lapidus and brands like Bogart offer great scents for less.",
        "id": 55,
        "like_count": 2,
        "author": "@mrdeillusionize5151"
    },
    {
        "text": "Paul, nailed it once again mate! You know where I’m off tomorrow!! This is more of what is needed. Unfortunately like you say we can’t all afford £100’s and sometimes we just need something to throw on for work or even just after a shower. Love, love, love this Paul! Thank you 😊",
        "id": 57,
        "like_count": 14,
        "author": "@djrobcross"
    },
    {
        "text": "Another great video 🤙🏼🤙🏼",
        "id": 58,
        "like_count": 0,
        "author": "@CBoyce-dr4jy"
    },
    {
        "text": "Another great video og really interesting content.",
        "id": 59,
        "like_count": 0,
        "author": "@jesperhansen4751"
    },
    {
        "text": "'The One' might be an attempt at 'The One' by D&G? A bit obvious I guess, but who knows. Will try a couple in my local Lidly anyway.",
        "id": 60,
        "like_count": 0,
        "author": "@m.s.g1890"
    },
    {
        "text": "Haven't seen the Essence line yet. The others cost 3,99€ here in Greece and are pretty decent.",
        "id": 62,
        "like_count": 3,
        "author": "@apostolosk446"
    },
    {
        "text": "Thank you for making this video I also bought all four of the essence bottles and I was also confused woth the elegance one . Loved all of the fragrances and loved ur vdo too.\nKeep it up man",
        "id": 63,
        "like_count": 1,
        "author": "@As-jr2lz"
    },
    {
        "text": "Every time I watch your videos, I can't get over how awesome your shelving and lighting is.  All of those colored bottles just look amazing!",
        "id": 65,
        "like_count": 6,
        "author": "@cubs531"
    },
    {
        "text": "At that same price, I could easily recommend Cuba Gold, Royal and Prestige too.  Three clones that I actually slightly prefer to the originals.  And of course, Perfume Parlour is always an option.  A unique vid!",
        "id": 66,
        "like_count": 3,
        "author": "@justaddlight"
    },
    {
        "text": "Big fan of this video concept, good job!\nI remember seeing Poundland selling a couple of fragrances haha.",
        "id": 67,
        "like_count": 1,
        "author": "@alanwong3144"
    }
]