[
    {
        "author": "Ute's International Lounge",
        "published_at": "2023-10-23T12:18:02Z",
        "updated_at": "2023-10-23T12:18:02Z",
        "like_count": 0,
        "text": "What we observe is that we insert consonants of vowels to make the pronunciation easier, depending on what other languages we have. These are called epenthetic sounds by the way."
    },
    {
        "author": "JustLutra",
        "published_at": "2023-10-22T20:22:25Z",
        "updated_at": "2023-10-23T06:10:28Z",
        "like_count": 0,
        "text": "\"em ba ppeh\" is just the right way to pronounce it.. \n+ French language doesn't have stress"
    },
    {
        "author": "Paula Swaim",
        "published_at": "2023-10-22T07:30:54Z",
        "updated_at": "2023-10-22T07:30:54Z",
        "like_count": 0,
        "text": "Once I heard Mandarin news on a TV in another room. It was far away and I couldn't hear clearly. The rhythm was just like English and that's what I thought I was hearing."
    },
    {
        "author": "Virginia Sanchís",
        "published_at": "2023-10-21T16:14:24Z",
        "updated_at": "2023-10-21T16:14:24Z",
        "like_count": 0,
        "text": "EXCELLENT!"
    },
    {
        "author": "TheJewishAtheist",
        "published_at": "2023-10-21T04:29:05Z",
        "updated_at": "2023-10-21T04:29:05Z",
        "like_count": 0,
        "text": "Well, you have an accent for awhile, while you're getting used to the sound. But if you listen well (or if you have music training), you can lose that accent. By the time I was 26 or so, I had already fooled people into thinking I was a native speaker of my 2nd, 3rd and 4th languages."
    },
    {
        "author": "Doomdestine",
        "published_at": "2023-10-15T07:22:30Z",
        "updated_at": "2023-10-15T07:23:16Z",
        "like_count": 0,
        "text": "I am a native filipino-kapampangan borned with parents who were not inspired and motivated by europe. Due to my name as it affects me, I am visibly interested, and Inspired by the germans along with the russians. I possess the russian accent and it appears that I am unable to change my accent in english. Allow me to clarify, I am borned with germanic and russian inspiration in asia, thus allowing me to obtain interest in foreign culture, most likely in the germans and russians. The accent I posses appears to be a little broad, however it still possesses some of the british pronunciations most likely on the a's, and not the er's (water = woter). The name I possess hat a germanic first name, a british middle name. The middle name I obtained may also affect on my interest, I did gain interest on the british. I adore this!"
    },
    {
        "author": "Nora Cubberly",
        "published_at": "2023-10-13T11:22:32Z",
        "updated_at": "2023-10-13T11:22:32Z",
        "like_count": 0,
        "text": "Who is the expert talking in this? I'd like to learn more from him."
    },
    {
        "author": "Bê Mis",
        "published_at": "2023-10-12T20:43:16Z",
        "updated_at": "2023-10-12T20:43:16Z",
        "like_count": 0,
        "text": "This video is incredible"
    },
    {
        "author": "Pedro",
        "published_at": "2023-10-12T02:43:38Z",
        "updated_at": "2023-10-12T02:43:38Z",
        "like_count": 0,
        "text": "If you remove just the puff of air it doesnt sound like Paris in the French pronunciation"
    },
    {
        "author": "Renata Simoni",
        "published_at": "2023-10-11T16:55:28Z",
        "updated_at": "2023-10-11T16:55:28Z",
        "like_count": 0,
        "text": "Really amazing. ❤tks a bunch"
    },
    {
        "author": "Maurice Tituer",
        "published_at": "2023-10-09T15:55:59Z",
        "updated_at": "2023-10-09T15:55:59Z",
        "like_count": 0,
        "text": "The stress syllable in French is only for the last word of a sentence."
    },
    {
        "author": "an kh",
        "published_at": "2023-10-09T06:07:53Z",
        "updated_at": "2023-10-09T06:07:53Z",
        "like_count": 0,
        "text": "An amazing video! Thank you so much. The humour is excellent"
    },
    {
        "author": "Lana Mack",
        "published_at": "2023-10-09T01:25:39Z",
        "updated_at": "2023-10-09T01:25:39Z",
        "like_count": 0,
        "text": "Trying to learn how to pronounce letters in a language not native to you is totally inefficient. Rather think of it as learning how to write sounds; this way you learn that the (English \"sh\") sound can be written sh, sch, š, ш, ch, and much more."
    },
    {
        "author": "JesusGonzalez",
        "published_at": "2023-10-07T22:00:33Z",
        "updated_at": "2023-10-07T22:00:33Z",
        "like_count": 0,
        "text": "As a person who speaks thirteen languages I'll always admire those who speak a second, third or more languages as a native 🙌🏻👏🏻👌🏻❤"
    },
    {
        "author": "lXl",
        "published_at": "2023-10-07T18:11:39Z",
        "updated_at": "2023-10-07T18:11:39Z",
        "like_count": 0,
        "text": "this reporter did exactly what i knew he would-didn't answer the question. he just stated what happens. what i hoped for was a biological medical sonic explanation as to how our vocal cords form in a way that we can speak other languages easily eg german, japanese but not others like mandarin or even the Australian accent. where in the spectrum where vibration occurs like music that determines what comes easily and what doesn't-like the R sound"
    },
    {
        "author": "Darenius",
        "published_at": "2023-10-07T04:23:32Z",
        "updated_at": "2023-10-07T04:23:32Z",
        "like_count": 0,
        "text": "too basic"
    },
    {
        "author": "Verity Truth",
        "published_at": "2023-10-06T14:28:32Z",
        "updated_at": "2023-10-06T14:28:32Z",
        "like_count": 0,
        "text": "That was a bit disappointing. I was hoping to learn something about what happens in the brain when we try to speak other languages and why accents are contagious, rather than be informed that languages have different sounds. That's not exactly new information."
    },
    {
        "author": "koromoto okendo",
        "published_at": "2023-10-05T20:07:04Z",
        "updated_at": "2023-10-05T20:07:04Z",
        "like_count": 2,
        "text": "Ì think that having a foreign accent doesn't matter. What's importante is that people understand you and you understand people. I like accents."
    },
    {
        "author": "TDuong Dang",
        "published_at": "2023-10-05T02:01:57Z",
        "updated_at": "2023-10-05T02:01:57Z",
        "like_count": 5,
        "text": "Reasons listed:\n1) Individual sounds differ between languages\n2) Several sounds are not possible in some languages -> people insert/adjust the sound to fit the the rules of their own \n3) Differences in stress patterns\n4) Differences in intonation/language rythym"
    },
    {
        "author": "Saji S Nair Nair",
        "published_at": "2023-10-04T16:08:04Z",
        "updated_at": "2023-10-04T16:08:04Z",
        "like_count": 0,
        "text": "Forgret unknown"
    },
    {
        "author": "Jose Maria Vildoza",
        "published_at": "2023-10-03T14:01:50Z",
        "updated_at": "2023-10-03T14:01:50Z",
        "like_count": 0,
        "text": "I know, I get it but what about accents in the same language? For example, John could be an australian living in the US, everyone will think he's got an accent for sure but he's still a native english speaker. The same won't apply to Nikolay or Andrei from Russia, or Pedro from Mexico!"
    },
    {
        "author": "JudgeHill83",
        "published_at": "2023-10-02T12:06:20Z",
        "updated_at": "2023-10-02T12:06:20Z",
        "like_count": 0,
        "text": "I was under the impression that in French there is actually no overt stress, that's why \"Houston:\" sounds odd to us - it's not that they are stressing the second syllable, it's that they're not stressing"
    },
    {
        "author": "Elena Salguero",
        "published_at": "2023-09-30T09:42:25Z",
        "updated_at": "2023-09-30T09:42:25Z",
        "like_count": 0,
        "text": "Brilliant!"
    },
    {
        "author": "Son of a Beach",
        "published_at": "2023-09-30T02:04:09Z",
        "updated_at": "2023-09-30T02:04:09Z",
        "like_count": 0,
        "text": "What's the @ of this hottie?"
    },
    {
        "author": "Bianca Vivas",
        "published_at": "2023-09-29T02:43:56Z",
        "updated_at": "2023-09-29T02:43:56Z",
        "like_count": 0,
        "text": "guys, you don't have to lose your accent to be a proficient speaker in any given language. Our accent is about our culture and identity, embrace this, especially with English. Please, stop seeking for ways to speak like natives, whatever this mean"
    },
    {
        "author": "Smartysatyam 777",
        "published_at": "2023-09-26T05:45:47Z",
        "updated_at": "2023-09-26T05:45:47Z",
        "like_count": 0,
        "text": "India 🇮🇳"
    },
    {
        "author": "A.T. Gouda",
        "published_at": "2023-09-24T22:10:49Z",
        "updated_at": "2023-09-24T22:10:49Z",
        "like_count": 0,
        "text": "Very well explained 🙌👍 merci"
    },
    {
        "author": "Clayton Oliveira",
        "published_at": "2023-09-23T05:08:26Z",
        "updated_at": "2023-09-23T05:08:26Z",
        "like_count": 0,
        "text": "This video is brilliant"
    },
    {
        "author": "Shivam kaushik",
        "published_at": "2023-09-20T09:14:03Z",
        "updated_at": "2023-09-20T09:14:03Z",
        "like_count": 0,
        "text": "Vit Vellore"
    },
    {
        "author": "r.b.",
        "published_at": "2023-09-20T01:27:55Z",
        "updated_at": "2023-09-20T01:27:55Z",
        "like_count": 0,
        "text": "Why do native English speakers almost  never can speak a foreign language fluently? Why don't you study first. \n\nThose always have the tendency to criticize the people who are smart and educated enough to be able to master different  languages."
    },
    {
        "author": "Elizabeth Wall",
        "published_at": "2023-09-18T21:38:28Z",
        "updated_at": "2023-09-18T21:38:28Z",
        "like_count": 1,
        "text": "I learned many years ago in a college linguistics class that people’s tongues actually develop a certain shape based on the accent they grew up with, and that’s why we have a particular accent that is hard to change. I’m not sure if that’s still a prevailing theory though. I feel like there has to be more to it than just paying attention to stress and intonation, because there are plenty of people who try very hard to lose their native accents and just can’t do it."
    },
    {
        "author": "Assoluta",
        "published_at": "2023-09-18T02:51:02Z",
        "updated_at": "2023-09-18T02:51:02Z",
        "like_count": 1,
        "text": "Not always the case though, some people are far better at imitating accents than others. My husband and I generally have little accent in our non native languages, and it puzzles me why people have such strong accents in foreign languages when it’s clearly obviously not correct."
    },
    {
        "author": "1984-XIX c.",
        "published_at": "2023-09-17T18:16:22Z",
        "updated_at": "2023-09-17T18:16:22Z",
        "like_count": 0,
        "text": "2:22 sounds more like an Indian."
    },
    {
        "author": "Vania Medeiros Horstman",
        "published_at": "2023-09-17T11:36:02Z",
        "updated_at": "2023-09-17T11:36:02Z",
        "like_count": 2,
        "text": "I speak 3 languages, and I don't care about my foreign accent. It's a charming ❤ I prefer don't judge just because, it's cute listening the foreign accents foreign people speaking my native language.\nI'm a interpreter, and communication is more important than accent. I'm leaving in US, and I'm brazilian. I never gonna be american and any point to try to looks like one 😂😂😂😂😂"
    },
    {
        "author": "Toaster",
        "published_at": "2023-09-17T09:17:42Z",
        "updated_at": "2023-09-17T09:17:42Z",
        "like_count": 1,
        "text": "But I learned all the sounds of English and I still have an accent. I also learned the stress and everything else."
    },
    {
        "author": "CHBE",
        "published_at": "2023-09-16T23:09:24Z",
        "updated_at": "2023-09-16T23:09:24Z",
        "like_count": 0,
        "text": "My native language is (Swiss) German, but i can speak british English, american english, canadian english, english with an (Swiss) German accent, with an french accent or an italian accent. So when i am in London i could speek italian english, and some peuple would think, i am italian.😂"
    },
    {
        "author": "jesshakkinen",
        "published_at": "2023-09-16T11:21:56Z",
        "updated_at": "2023-09-16T11:24:22Z",
        "like_count": 0,
        "text": "Partly makes sense, of course. However, this view of discrete languages is backward. Please get acquainted with modern studies in the area of language(s)."
    },
    {
        "author": "JiTiAr35",
        "published_at": "2023-09-15T15:30:07Z",
        "updated_at": "2023-09-15T15:30:07Z",
        "like_count": 2,
        "text": "dude, even you have an accent in a local language.\nask UK people if you don't believe.\naccent so different, they sometimes can't understand each other 😁"
    },
    {
        "author": "KoreanBilly",
        "published_at": "2023-09-14T03:01:03Z",
        "updated_at": "2023-09-14T03:01:03Z",
        "like_count": 0,
        "text": "I love it"
    },
    {
        "author": "Mouhib Ben nasser",
        "published_at": "2023-09-12T23:42:34Z",
        "updated_at": "2023-09-12T23:42:34Z",
        "like_count": 0,
        "text": "As an arab speaker (Tunisian) I find myself speaking languages with their normal accent and people find it awesome. I can also mimic different accents. Is there a reason why?"
    },
    {
        "author": "Hugo Bourgon",
        "published_at": "2023-09-12T03:58:12Z",
        "updated_at": "2023-09-12T03:58:12Z",
        "like_count": 0,
        "text": "Not all French words are stressed on the final syllable and most language have a secondary and tertiary stress."
    },
    {
        "author": "brandedrebel",
        "published_at": "2023-09-11T08:11:58Z",
        "updated_at": "2023-09-11T08:11:58Z",
        "like_count": 0,
        "text": "I loved how he chose artificial  Russian accent to prove his points"
    },
    {
        "author": "Layla Albassam",
        "published_at": "2023-09-10T16:43:51Z",
        "updated_at": "2023-09-10T16:43:51Z",
        "like_count": 0,
        "text": "I find it surprising. We Arabic native speakers can easily shift to English and adapt the accent specially the American. However, for an American to speak the Arabic is more of an impossible."
    },
    {
        "author": "GUIDANZAS",
        "published_at": "2023-09-10T12:05:57Z",
        "updated_at": "2023-09-10T12:05:57Z",
        "like_count": 0,
        "text": "Very well done..very detailed video. \nAlso the articulators are positioned in different way and the force employed is different. \nVery beautifully put together…❤l wonder how many people worked on it? \nHow much time"
    },
    {
        "author": "AnA",
        "published_at": "2023-09-10T10:03:40Z",
        "updated_at": "2023-09-10T10:03:40Z",
        "like_count": 0,
        "text": "I did not expect it to be so easy! Thank you."
    },
    {
        "author": "ferretyluv",
        "published_at": "2023-09-09T20:52:03Z",
        "updated_at": "2023-09-09T20:52:03Z",
        "like_count": 0,
        "text": "Because you’re speaking a foreign language."
    },
    {
        "author": "zaboutata",
        "published_at": "2023-09-09T20:19:09Z",
        "updated_at": "2023-09-09T20:19:09Z",
        "like_count": 0,
        "text": "I speak Spanish (mother tongue), English and French but I've been living in France for the past 9 years. \nI learned English before learning French but now I have a French accent when I speak English, it's so weird, haha, people must think I do it on purpose or something but it just comes out like that naturally. \nMy theory is because the foreign language I speak the most is French, so my brain goes on French mode more easily. I'm also learning Italian and instead of going to the Spanish intonation which is more similar to Italian I go with the French one. I gues it has become such a big part of my life that it's taking over, I kind of like and hate it at the same time."
    },
    {
        "author": "Vaiva Paula",
        "published_at": "2023-09-09T07:51:55Z",
        "updated_at": "2023-09-09T07:51:55Z",
        "like_count": 0,
        "text": "I'm a Lithuanian native, when I speak English people always say that I either sound Australian or Irish xD"
    },
    {
        "author": "shrimpdance",
        "published_at": "2023-09-09T04:18:49Z",
        "updated_at": "2023-09-09T04:18:49Z",
        "like_count": 0,
        "text": "Trevor Noah said that accents arethe result of people speaking your language with the rules of theirs. Looks like he was right. He also pointed out that people shouldn't be mocked for that."
    },
    {
        "author": "Joao Miguel",
        "published_at": "2023-09-08T12:32:00Z",
        "updated_at": "2023-09-08T12:32:00Z",
        "like_count": 0,
        "text": "There are two more reasons:\n1. The brain tends to find a similar recorded sound for any new sound instead of recording a new one. i.e. your brain tells you Spanish R is the same sound as the English one while they should be recorded as distinct letters.\n2. Your voice tone may not fit in another language: \nTry to imitate a native speaker voice and you will sound more native."
    },
    {
        "author": "Khalid AlAli",
        "published_at": "2023-09-08T11:30:37Z",
        "updated_at": "2023-09-08T11:30:37Z",
        "like_count": 0,
        "text": "I don’t. I’ve gotten away with being an American tourist in Europe, in various countries, and that includes talking to Americans and Canadians. I’ve also gotten away with posing as a Spanish tourist in South America, given my thick Castilian accent. Ironically, I’m from Arabia, Arabic is my first language, Persian is my second mother tongue, on account of my mom being Iranian, and English is my third. Whilst, Spanish is my fifth, after French that is. 😅😂\n\nI’d totally make it, being a spy somewhere lol 😂"
    },
    {
        "author": "Horacio Kanashiro",
        "published_at": "2023-09-08T02:57:09Z",
        "updated_at": "2023-09-08T02:57:09Z",
        "like_count": 0,
        "text": "I don't know you guys but watching  The Addams Family I never could guess Uncle It accent."
    },
    {
        "author": "Mr. W",
        "published_at": "2023-09-08T00:22:15Z",
        "updated_at": "2023-09-08T00:24:00Z",
        "like_count": 0,
        "text": "1:43 No, they don’t. French words have *equal* stress. Any stress you hear, which may come on either first or last syllable, is done so by the speaker for emphasis. But in theory, there is no stress. In learning the language, French learners (or children learning vocabulary) are never taught to pronounce certain syllables more. By contrast in English, we are taught that “bicycle” is “BI- sick- ull” and never “bi - SICK -ull”.\n\nAmericans hear French words  as stressed on the final syllable because they are not used to equal stress. \n\nThink of the word “going”.\n\nIn English, we say *go* - ing, not go - *ing* .\n\nHowever the French would say them both with equal stress. Try it. Go - ing. You’ll have to raise the stress of “ing” to match the first or lower the stress of the first compared to how you usually say it. It sounds more like “go-eeng”.\n\nDo you hear it? No matter how much you try to equally stress them, it will nonetheless sound like the last syllable is stressed even though you know it’s not. That’s a trick our minds play on us because we are not used to hearing it."
    },
    {
        "author": "kerosene74",
        "published_at": "2023-09-07T20:25:09Z",
        "updated_at": "2023-09-07T20:25:09Z",
        "like_count": 0,
        "text": "I thought this was common sense"
    },
    {
        "author": "Tchaivořák faurésohnsieg",
        "published_at": "2023-09-07T14:02:11Z",
        "updated_at": "2023-09-07T14:02:11Z",
        "like_count": 0,
        "text": "Who's this guy??"
    },
    {
        "author": "Vishva Kumara",
        "published_at": "2023-09-07T05:55:03Z",
        "updated_at": "2023-09-07T05:55:03Z",
        "like_count": 0,
        "text": "And it stays for a couple of days (after returning home) is the funny part"
    },
    {
        "author": "Titcha",
        "published_at": "2023-09-06T23:28:58Z",
        "updated_at": "2023-09-06T23:28:58Z",
        "like_count": 0,
        "text": "Very interesting! I hadn't think about accents in this way before... but the video fails to comment another important point: the accent also brings a speaker identity. Homogeneity does not exist in language!"
    },
    {
        "author": "Jjhonsib",
        "published_at": "2023-09-06T21:49:54Z",
        "updated_at": "2023-09-06T21:49:54Z",
        "like_count": 1,
        "text": "I’m sure I sound very American speaking German."
    },
    {
        "author": "Muhammed",
        "published_at": "2023-09-06T17:13:46Z",
        "updated_at": "2023-09-06T17:13:46Z",
        "like_count": 0,
        "text": "Well made!"
    },
    {
        "author": "Ivan Reis",
        "published_at": "2023-09-06T15:18:15Z",
        "updated_at": "2023-09-06T15:18:15Z",
        "like_count": 0,
        "text": "Superb!"
    },
    {
        "author": "Grace Awdry",
        "published_at": "2023-09-06T11:04:27Z",
        "updated_at": "2023-09-06T11:04:27Z",
        "like_count": 0,
        "text": "Fascinating, especially about knowing the difference between Italian and English even through a wall."
    },
    {
        "author": "amir mirou",
        "published_at": "2023-09-06T03:29:47Z",
        "updated_at": "2023-09-06T03:29:47Z",
        "like_count": 0,
        "text": "Basic information"
    },
    {
        "author": "тоска",
        "published_at": "2023-09-05T22:45:53Z",
        "updated_at": "2023-09-05T22:45:53Z",
        "like_count": 0,
        "text": "The language is a mean of communication. So having accent is fine as long as you're comprehensive. If your accent affects your pronunciation too much to the point of sounding inarticulate, then yes, you must work on it."
    },
    {
        "author": "B English",
        "published_at": "2023-09-05T20:02:42Z",
        "updated_at": "2023-09-05T20:02:42Z",
        "like_count": 0,
        "text": "I love this video"
    },
    {
        "author": "Daniel Wijaya",
        "published_at": "2023-09-05T09:24:08Z",
        "updated_at": "2023-09-05T09:24:08Z",
        "like_count": 0,
        "text": "This is fun, thanks"
    },
    {
        "author": "Leonel Jaramillo",
        "published_at": "2023-09-05T01:12:40Z",
        "updated_at": "2023-09-05T01:12:40Z",
        "like_count": 0,
        "text": "Shakira, our international polyglot super star, she speaks better English than most Americans, honestly."
    },
    {
        "author": "Reason",
        "published_at": "2023-09-04T21:54:08Z",
        "updated_at": "2023-09-04T21:54:08Z",
        "like_count": 0,
        "text": "If you learn a language before puberty, you won't get an accent.  It's not the teacher to blame."
    },
    {
        "author": "Rita Amor",
        "published_at": "2023-09-04T18:20:29Z",
        "updated_at": "2023-09-04T18:20:29Z",
        "like_count": 1,
        "text": "This was a great video!"
    },
    {
        "author": "橙子动漫",
        "published_at": "2023-09-04T07:52:44Z",
        "updated_at": "2023-09-04T07:52:44Z",
        "like_count": 0,
        "text": "the two essential reasons how to learn a foreign language, you need a language environment and you have the motion to learn"
    },
    {
        "author": "Mikun Kabuto",
        "published_at": "2023-09-04T06:49:03Z",
        "updated_at": "2023-09-04T06:49:03Z",
        "like_count": 0,
        "text": "Yeah but why?"
    },
    {
        "author": "Eugene Arrindell",
        "published_at": "2023-09-04T02:32:53Z",
        "updated_at": "2023-09-04T02:32:53Z",
        "like_count": 0,
        "text": "Tru!"
    },
    {
        "author": "Vinh Prag",
        "published_at": "2023-09-04T01:37:07Z",
        "updated_at": "2023-09-04T01:37:07Z",
        "like_count": 0,
        "text": "This is like a video version of an 1843 article, barely scratching, nay touching, the surface of the subject matter. Economist, let Vox explain stuff, just stick to serious stuff."
    },
    {
        "author": "kzm",
        "published_at": "2023-09-03T17:39:01Z",
        "updated_at": "2023-09-03T17:39:01Z",
        "like_count": 9,
        "text": "Stress is an underrated part of language learning. In my native language, even though not tonal, a wrong stress could change the meaning of the word. Same goes with cadence, one could easily tell if the person is not a native speaker."
    },
    {
        "author": "TXT",
        "published_at": "2023-09-03T13:41:40Z",
        "updated_at": "2023-09-03T13:41:40Z",
        "like_count": 0,
        "text": "I had a normal english accent but I started learning korean and the accents mixed and now my accent is very weard"
    },
    {
        "author": "OVYED Deno",
        "published_at": "2023-09-03T12:44:09Z",
        "updated_at": "2023-09-03T12:44:09Z",
        "like_count": 2,
        "text": "This just reminded me of Peter speaking Italian 😂"
    },
    {
        "author": "EmTeeKay",
        "published_at": "2023-09-03T12:43:43Z",
        "updated_at": "2023-09-03T12:43:43Z",
        "like_count": 2,
        "text": "Am just disappointed that this video was extremely short...it was soooo engaging that I never wanted it to end❤"
    },
    {
        "author": "Queen of the North",
        "published_at": "2023-09-03T01:04:52Z",
        "updated_at": "2023-09-03T01:04:52Z",
        "like_count": 3,
        "text": "i learned a lot of languages and enjoyed doing so. i always made it a point to try to imitate the sounds and pronunciations as closely to the original as possible. people tell me i speak excellent italian and a lot of english speakers believe i am native or have been living in an english speaking country for a long time 😊\nthe best thing was to read texts out loud, listen carefully and try to nail the intonation 🎉"
    },
    {
        "author": "Ed Ryba",
        "published_at": "2023-09-03T00:16:41Z",
        "updated_at": "2023-09-03T00:16:41Z",
        "like_count": 0,
        "text": "Is this how George of the Jungle came to live in Mbwebwe Province?"
    },
    {
        "author": "MBAC",
        "published_at": "2023-09-02T21:39:16Z",
        "updated_at": "2023-09-02T21:39:16Z",
        "like_count": 0,
        "text": "Best English accent?"
    },
    {
        "author": "Alain Sarries",
        "published_at": "2023-09-02T20:48:26Z",
        "updated_at": "2023-09-02T20:48:26Z",
        "like_count": 0,
        "text": "Although very short, this video pointed a few things I was unware of,  brilliant!  \nI am French originally and lived in France till I was 24  then I  spent the next 40 years or so  in England .  My accent is unmistakingly not English and  i could not do an English accent to save my life .   Interestingly though, I moved to Toronto, Canada , 7 years ago and  I have been asked a number of times \" are you from the UK? \""
    },
    {
        "author": "Luz Sena",
        "published_at": "2023-09-02T20:29:27Z",
        "updated_at": "2023-09-02T20:29:27Z",
        "like_count": 0,
        "text": "I was born in Brazil and moved to Germany as a kid, so my German has a Portuguese accent but my Portuguese has a German accent, too.  I can't win."
    },
    {
        "author": "lou prochazka",
        "published_at": "2023-09-02T19:33:39Z",
        "updated_at": "2023-09-02T19:33:39Z",
        "like_count": 0,
        "text": "After 55 years in the US my Czech accent does not want to leave me, but my Chicago-born wife is still with me. I'm very much sure the accent is here to stay.....and hopefully so is she."
    },
    {
        "author": "Rosalind Pattyn",
        "published_at": "2023-09-02T16:40:55Z",
        "updated_at": "2023-09-02T16:40:55Z",
        "like_count": 1,
        "text": "That is why I like learning languages from native speakers of the language.  My husband from US (I am originally from England) has more trouble with languages than I do because he doesn't hear those different accent points and the short vs long vowels are difficult for people from USA to say."
    },
    {
        "author": "Eswar Avinash J",
        "published_at": "2023-09-02T12:37:18Z",
        "updated_at": "2023-09-02T12:37:18Z",
        "like_count": 0,
        "text": "Well made video"
    },
    {
        "author": "tj",
        "published_at": "2023-09-02T12:31:00Z",
        "updated_at": "2023-09-02T12:31:00Z",
        "like_count": 53,
        "text": "I think there is something that should also be included in this article: you are trained to listen to the sounds of your mother tongue, so when you listen to a foreign language your brain is processing it like it would your mother tongue, i.e. you don't listen for example German like a German would, you listen to German like you were listening to your mother tongue and so you will try to speak the words you listen but they are not the exact sounds a German would hear. With exposure your brain can train itself to listen to the proper sound emphasis of the foreign language and that will enhance your accent but some people never have enough exposure. I think often the listening training is ignored when teaching languages and that is a shame."
    },
    {
        "author": "Joshua Contreras",
        "published_at": "2023-09-02T03:06:14Z",
        "updated_at": "2023-09-02T03:06:14Z",
        "like_count": 0,
        "text": "that was fun 😊"
    },
    {
        "author": "Alaswany Alaswany",
        "published_at": "2023-09-02T01:07:15Z",
        "updated_at": "2023-09-02T01:07:15Z",
        "like_count": 0,
        "text": "It's not hard"
    },
    {
        "author": "Hugo Blanchard",
        "published_at": "2023-09-01T22:09:10Z",
        "updated_at": "2023-09-01T22:09:10Z",
        "like_count": 0,
        "text": "Bro what did the french do to you "
    },
    {
        "author": "Kongen Gorm",
        "published_at": "2023-09-01T20:47:55Z",
        "updated_at": "2023-09-01T20:47:55Z",
        "like_count": 0,
        "text": "I do the mimicry with english speakers. I talk to south africans, they think i am south african. I talk to scottish people, they think i am scottish."
    },
    {
        "author": "Tofer",
        "published_at": "2023-09-01T19:46:13Z",
        "updated_at": "2023-09-01T19:46:13Z",
        "like_count": 16,
        "text": "This is pretty funny because I have just started learning Spanish to connect with my family from Peru and I don't want to butcher their language so I say a couple sentences in English like my dad would with his Peruvian-accent before speaking a sentence in Spanish. It really helped! But then my family in Peru mistaken me for being fluent because my accent is polished, haha. And now I understand it's due to the stress my dad put on words. How neat!"
    },
    {
        "author": "Angelica Padilla",
        "published_at": "2023-09-01T19:38:57Z",
        "updated_at": "2023-09-01T19:38:57Z",
        "like_count": 0,
        "text": "this should be a series"
    },
    {
        "author": "Ttr Ttr",
        "published_at": "2023-09-01T15:58:39Z",
        "updated_at": "2023-09-01T15:58:39Z",
        "like_count": 0,
        "text": "世界中の言語とは。 神イエス様語なのです。 これは、常識です。"
    },
    {
        "author": "J",
        "published_at": "2023-09-01T13:57:46Z",
        "updated_at": "2023-09-01T13:57:46Z",
        "like_count": 1,
        "text": "The short answer? Because you're not pronouncing words properly.\n\nAn 'accent' is simply a particular way words are pronounced. When someone normally speaks another language and is learning a completely different one... They'll have an accent, but only if they don't learn how letters and words are pronounced in the language.\n\nA basic example is someone that speaks English, trying to talk in Spanish.\n\nIf someone that speaks English was ignorant to Spanish pronunciation, they'd say 'hola' as the letter o (as pronounced in English, not Spanish), then -la. More like 'oh-luh'. This is an accent, whether American, British, Australian, Canadian or Kiwi. It's still an accent and in short, is the butchering of a language.\n\nWhen one learns a language and bothers to learn actual pronunciation, they should ultimately sound exactly like a native speaker, no one would know. \n\nIn this case, it would be achieved simply by pronouncing 'hola' the way it would be in Spanish. A Spanish 'o' sound (silent h as they're not pronounced in Spanish), then -luh.\n\nThere. No more 'accent' other than a Spanish speaking one.\n\nWhen learning other languages, we have the benefit of getting to choose the accent we want in that language, because we weren't raised into one. This is why training an accent in another language is MUCH easier than training another one within a language."
    },
    {
        "author": "Justin",
        "published_at": "2023-09-01T13:08:42Z",
        "updated_at": "2023-09-01T13:08:42Z",
        "like_count": 0,
        "text": "Brilliant"
    },
    {
        "author": "Micky Rively",
        "published_at": "2023-09-01T13:00:21Z",
        "updated_at": "2023-09-01T13:00:21Z",
        "like_count": 0,
        "text": "I am french and it is funny and right to hear how you describe the word Paris ❤❤"
    },
    {
        "author": "Gary Morrison",
        "published_at": "2023-09-01T12:06:48Z",
        "updated_at": "2023-09-01T12:12:51Z",
        "like_count": 0,
        "text": "I sometimes sound vaguely “Britishy” when I’m tired or mumbling, even at home in the USA.  No idea why…"
    },
    {
        "author": "TonyTheYouTuba",
        "published_at": "2023-09-01T09:03:55Z",
        "updated_at": "2023-09-01T09:03:55Z",
        "like_count": 0,
        "text": "This was a great video, thank you."
    },
    {
        "author": "Ryan Yuk",
        "published_at": "2023-09-01T05:21:14Z",
        "updated_at": "2023-09-01T05:21:14Z",
        "like_count": 0,
        "text": "You can always tell American English speakers speaking foreign languages or even artificial language bc it’s hard to get rid of the cadence and stress 😊"
    },
    {
        "author": "Mmaantj",
        "published_at": "2023-08-31T23:50:26Z",
        "updated_at": "2023-08-31T23:50:26Z",
        "like_count": 0,
        "text": "people have said my accent disappears when i sing (english/korean, native language is dutch) but not when i speak so im wondering why is that???"
    },
    {
        "author": "Madison Mbaye",
        "published_at": "2023-08-31T21:51:37Z",
        "updated_at": "2023-08-31T21:51:37Z",
        "like_count": 0,
        "text": "So interesting! 🤓"
    },
    {
        "author": "Rafael Freitas",
        "published_at": "2023-08-31T21:42:03Z",
        "updated_at": "2023-08-31T21:42:03Z",
        "like_count": 0,
        "text": "That sounds cool! (Typing with accent :))"
    },
    {
        "author": "Diyabadoune",
        "published_at": "2023-08-31T19:34:21Z",
        "updated_at": "2023-08-31T19:34:21Z",
        "like_count": 3,
        "text": "Well for your information, we, french, also pronounce MBAPPE as EMBAPE because the letter M in the french alphabet is pronounced EMM"
    },
    {
        "author": "Jung-woo Sohn",
        "published_at": "2023-08-31T12:40:38Z",
        "updated_at": "2023-08-31T12:40:38Z",
        "like_count": 0,
        "text": "I am a Korean and I still have vague ideas about what stress is. There is no such thing like stress in Korean and distinguishing words using different stress is still a huge stress to me. lol."
    },
    {
        "author": "Glatze Metzger",
        "published_at": "2023-08-31T12:23:04Z",
        "updated_at": "2023-08-31T12:23:04Z",
        "like_count": 0,
        "text": "1:02 ???"
    },
    {
        "author": "Nuno C",
        "published_at": "2023-08-31T00:19:32Z",
        "updated_at": "2023-08-31T00:19:32Z",
        "like_count": 0,
        "text": "Another question why some people (myself included) are able to pronounce most languages without an accent? I think it's cause I'm fluent in English and Portuguese. BUT not sure..."
    },
    {
        "author": "Terry Chiffre",
        "published_at": "2023-08-30T18:32:46Z",
        "updated_at": "2023-08-30T18:32:46Z",
        "like_count": 1,
        "text": "The Economist Has Returned."
    },
    {
        "author": "Jazz-Time",
        "published_at": "2023-08-30T16:06:10Z",
        "updated_at": "2023-08-30T16:06:10Z",
        "like_count": 0,
        "text": "You forgot to mention the physical problems of a new language. Have you ever experienced a professional basketball player who wanted to change to professional baseball? The mechanics are so different that he can hardly expect to play at the very same professional level in the new sport. The same with changing languages. The mouth is the most developed muscle of the body, capable of biting into steel. By the time a person reaches adult age,  the muscles of the mouth are so thoroughly developed by the mother tongue or tongues that changing gears becomes an immense adjustment, requiring great efforts, if possible at all to overcome. That is why beginning as early in life as possible to learn foreign languages helps developing a new 'tongue' in that the muscles of the mouth at a young age are flexible and able to adapt. I challenge anyone to try and learn a new language at 30 years of age without an accent 😊"
    },
    {
        "author": "Angeł",
        "published_at": "2023-08-30T15:36:02Z",
        "updated_at": "2023-08-30T15:36:02Z",
        "like_count": 0,
        "text": "Accent is the ultimate barrier to become fluent in a foreign language, and for me a source of frustration and embarrassment when speaking english"
    },
    {
        "author": "Alteo147",
        "published_at": "2023-08-30T12:58:24Z",
        "updated_at": "2023-08-30T12:58:24Z",
        "like_count": 2,
        "text": "Your choice of using Kylian Mbappé as an example is very interesting, especially for the French I am.\nActually, you are right, his name is pronounced \"mbappé\"... but many French people do not pronounce it correctly and say.... \"embappé\", like the English speaker. :)\nThis comes from the fact that the Mbappé name comes from Cameroon, and like many other african names, it uses a combination of consonants at the beginning that the French language does not have. So we don't always know whether the 'M' from \"Mbappé\" is an independant consonant that we should spell (as if it was \"M-Bappé\") or if it is a combination with the following 'p' that has to be pronounced together (which, thus, is the correct way).\nSo, sometimes we say \"Embappé\" whereas we are totally able to say \"Mbappé\". :)"
    },
    {
        "author": "CounterProductive",
        "published_at": "2023-08-29T20:10:36Z",
        "updated_at": "2023-08-29T20:10:36Z",
        "like_count": 0,
        "text": "this can be learned. Most ppl just don't bother and I hate them for it.\nI'm german. I don't speak with a german accent. Its cringe."
    },
    {
        "author": "AZZ",
        "published_at": "2023-08-29T18:47:49Z",
        "updated_at": "2023-08-29T18:47:49Z",
        "like_count": 0,
        "text": "I'm a native (Tunisian)Arabic speaker and i learnt French and thus the Latin alphabet in primary school before English, so i have a very weird and destinct Arab French accent mix, people have hard time guessing wich region i'm from, i would sound like a frenchman from the letter prononsiation but also Arab from how i speak sentences/paragraphs.\r\nAnd to add to that, due to learning from the internet and also school my english is also mixed between Texan American, Australian and Canadian from the Internet and the classical/upper class British English that i learned from school.\r\nIt's a weird hybrid of different accents and it leaves people puzzled, lol ."
    },
    {
        "author": "Giulia Pantusa",
        "published_at": "2023-08-29T07:36:09Z",
        "updated_at": "2023-08-29T07:36:09Z",
        "like_count": 0,
        "text": "Does anyone know the name of the person speaking? Thanks!"
    },
    {
        "author": "GEO-MAR",
        "published_at": "2023-08-29T06:51:20Z",
        "updated_at": "2023-08-29T06:51:20Z",
        "like_count": 0,
        "text": "Thank you for your information. 💛"
    },
    {
        "author": "Plerp Plerp",
        "published_at": "2023-08-29T06:25:50Z",
        "updated_at": "2023-08-29T06:25:50Z",
        "like_count": 0,
        "text": "Well, this was 3 minutes of my life wasted."
    },
    {
        "author": "Valerio the wandering sprite 🧝🏻",
        "published_at": "2023-08-28T20:13:44Z",
        "updated_at": "2023-08-28T20:16:36Z",
        "like_count": 2,
        "text": "Here's a polyglot. Usually, people don't immediately guess that I'm Italian until I say my name or birthplace. At least in English, my accent is neutral enough to confuse most foreigners (I've been called German, Irish, Scandinavian or even Russian). In German, I still retain my Romance pitch, but I'm usually mistaken for a Romanian or a Frenchman. In Russian, people tend to say I sound like a Western European, but that's it (if it has any meaning in the first place). In Serbo-Croatian, my newest foreign language, my accent was at first blatantly Russian, but it slowly became more and more Italian over time.\n\nAt any rate, my accent has never caused problems so far, to the point that I can converse with native speakers for hours."
    },
    {
        "author": "ali ziyech",
        "published_at": "2023-08-28T17:43:23Z",
        "updated_at": "2023-08-28T17:49:57Z",
        "like_count": 0,
        "text": "To be completely honest, if you're a non-native English speaker no one can realize that you have accent( that you're not a native English speaker) because there are many English accents in the world so if you're a British and you talk to someone from America or Australia or Canada and you think to yourself \" he's not a British\" well the other person might say this man isn't a native English speaker just like you thought. So we shouldn't add English to the languages you talking about.\nBut many of other languages aren't like English for example if you learn mandarin or Japanese, Somali, Korean as a second language native people of those countries will perceive that you're a foreigner."
    },
    {
        "author": "Sam",
        "published_at": "2023-08-28T14:57:46Z",
        "updated_at": "2023-08-28T14:57:46Z",
        "like_count": 0,
        "text": "Who’s the man starring in this video? I want his name. His imitation of the different accents is amazing!"
    },
    {
        "author": "Phuongloan Han",
        "published_at": "2023-08-28T10:29:03Z",
        "updated_at": "2023-08-28T10:29:03Z",
        "like_count": 0,
        "text": "fair enough"
    },
    {
        "author": "Nathan Ngumi",
        "published_at": "2023-08-28T05:39:47Z",
        "updated_at": "2023-08-28T05:39:47Z",
        "like_count": 0,
        "text": "Very educative, thanks!"
    },
    {
        "author": "ZALES",
        "published_at": "2023-08-28T00:38:59Z",
        "updated_at": "2023-08-28T00:38:59Z",
        "like_count": 0,
        "text": "Even in French nobody says « Mbappé » it’s « aiM-bappé »"
    },
    {
        "author": "Gaella Elwell",
        "published_at": "2023-08-27T21:40:09Z",
        "updated_at": "2023-08-27T21:40:09Z",
        "like_count": 0,
        "text": "More please!"
    },
    {
        "author": "Edgar Tretorn",
        "published_at": "2023-08-27T20:29:58Z",
        "updated_at": "2023-08-27T20:29:58Z",
        "like_count": 0,
        "text": "Don't  sweat it, Mbapé is pronounced the same way by French speakers. Only Cameroonian ppl do it the right way."
    },
    {
        "author": "Kobi Allen",
        "published_at": "2023-08-27T14:53:51Z",
        "updated_at": "2023-08-27T14:53:51Z",
        "like_count": 2,
        "text": "When I was studying in Austria, it was so interesting to hear the other students speaking German with French and Italian accents. I’m sure we all had foreign accents speaking German, but theirs were the most pronounced."
    },
    {
        "author": "JEP",
        "published_at": "2023-08-27T14:06:20Z",
        "updated_at": "2023-08-27T14:06:20Z",
        "like_count": 2,
        "text": "Brilliant explanation. It's interesting, how these things are becoming quite obvious once you know about them. I haven't given this much thought before. Thank you for teaching me something new within such a short time. Three minutes well spent ❤"
    },
    {
        "author": "NitroXM",
        "published_at": "2023-08-27T13:16:24Z",
        "updated_at": "2023-08-27T13:16:24Z",
        "like_count": 1,
        "text": "Every 60 seconds in Africa, a minute passes"
    },
    {
        "author": "Susan Taylor",
        "published_at": "2023-08-27T12:11:41Z",
        "updated_at": "2023-08-27T12:11:41Z",
        "like_count": 0,
        "text": "Great fun 😊"
    },
    {
        "author": "Mr. Quercus Mischievous Wizard-Knight",
        "published_at": "2023-08-27T12:09:04Z",
        "updated_at": "2023-08-27T12:09:04Z",
        "like_count": 0,
        "text": "Yeah! I always try too hard to aim to hard for Amsterdams when I speak Dutch!"
    },
    {
        "author": "Климентій Мисливий",
        "published_at": "2023-08-27T10:08:39Z",
        "updated_at": "2023-08-27T10:08:39Z",
        "like_count": 0,
        "text": "The video explains some differences between languages but does it really explain the reasons why one can observe a foreign accent, i.e. why certain patterns of a nonnative language are hard/impossible to acquire?"
    },
    {
        "author": "Roy Fulton",
        "published_at": "2023-08-27T09:56:51Z",
        "updated_at": "2023-08-27T09:56:51Z",
        "like_count": 0,
        "text": "Excellent video. Thank you!"
    },
    {
        "author": "catsapp video",
        "published_at": "2023-08-27T08:00:41Z",
        "updated_at": "2023-08-27T08:00:41Z",
        "like_count": 0,
        "text": "I am russian"
    },
    {
        "author": "Uma",
        "published_at": "2023-08-27T06:12:39Z",
        "updated_at": "2023-08-27T06:12:39Z",
        "like_count": 0,
        "text": "Great great great explanation. Thanks!"
    },
    {
        "author": "Maria Elena Vasquez Garcia",
        "published_at": "2023-08-26T21:44:35Z",
        "updated_at": "2023-08-26T21:44:35Z",
        "like_count": 0,
        "text": "What an excellent video, so informative, perfectly summarized and entertaining execution, thank you!"
    },
    {
        "author": "181cameron",
        "published_at": "2023-08-26T20:43:11Z",
        "updated_at": "2023-08-26T20:43:11Z",
        "like_count": 0,
        "text": "Canadian of Indian descent here... And have had the opportunity to live and work in a few countries. I'm by no means a polyglot, but I've been told that i speak with a native accent wherever I've lived. Best part, i don't always get the words right .... So i have the structure and vocab wrong, but i sound like im from there. \n\nBasically, I'm the village idiot from outside the village 😂"
    },
    {
        "author": "Vladimir Adoshev",
        "published_at": "2023-08-26T20:31:27Z",
        "updated_at": "2023-08-26T20:31:27Z",
        "like_count": 2,
        "text": "A part of the problem also is that we dwell on the written form too much in the foreign language. This is because we learn the written language and not how it sounds first unlike the natives."
    },
    {
        "author": "王ノ山・クロプセ",
        "published_at": "2023-08-26T18:16:52Z",
        "updated_at": "2023-08-26T18:16:52Z",
        "like_count": 5,
        "text": "Another aspect is tone. If your native language has tones (Cantonese, Mandarin, Thai, Vietnamese to name a few), you're more than likely to subconsciously add in the tones to any non-tonal language you're trying to speak\n\nAlso, native English speakers will naturally reduce many vowels to the \"schwa\"-sound (/ə/ - \"er\"), which their non-native counterparts often fail to do. Check out Tom Scott's video about it."
    },
    {
        "author": "Lucas Bitencourt",
        "published_at": "2023-08-26T16:59:29Z",
        "updated_at": "2023-08-26T16:59:29Z",
        "like_count": 0,
        "text": "Some off us Brazeelyans speakee likee dees mostly because we dontchy hevy words ending een dose consonants or de \"th\" end \"æ\" sounds"
    },
    {
        "author": "ANDROLOMA",
        "published_at": "2023-08-26T13:00:14Z",
        "updated_at": "2023-08-26T13:00:14Z",
        "like_count": 1,
        "text": "Everyone in the world has a weird accent except me, and they should try to adapt to my neutral tone."
    },
    {
        "author": "Wonder Woman",
        "published_at": "2023-08-26T11:09:39Z",
        "updated_at": "2023-08-26T11:09:39Z",
        "like_count": 0,
        "text": "Interesting"
    },
    {
        "author": "Dani Danichu",
        "published_at": "2023-08-26T09:21:20Z",
        "updated_at": "2023-08-26T09:22:12Z",
        "like_count": 0,
        "text": "something i always wonder: Spanish (specifically European Spanish) uses very prominently the sound 'th' (as in \"think\") but every single foreigner just uses 's' instead (more common in southern Spain and Latin America)... but the 'th' sound foes exist in other languages!!!! how's it that most native speakers just neglect that one sound altogether???"
    },
    {
        "author": "Tsiyu",
        "published_at": "2023-08-26T06:00:35Z",
        "updated_at": "2023-08-26T06:00:35Z",
        "like_count": 0,
        "text": "thank you now i know how to speak like an itanlian"
    },
    {
        "author": "Drahcir Nevarc",
        "published_at": "2023-08-26T05:58:04Z",
        "updated_at": "2023-08-26T05:58:04Z",
        "like_count": 2,
        "text": "I'm a native English speaker. My English accent is basically Southern posh with probably a hint of Canadian left over from my early childhood. I speak French with the accent of a Parisian fonctionnaire. However, my spoken French actually isn't quite fluent. I can participate perfectly well in conversation, but make lots of mistakes and often find that I lack vocabulary, which is the source of a great deal of mystification. I also speak appallingly bad German with, apparently, a Prussian accent, which I think must be the result of the war films we used to watch on Sunday afternoons at boarding school 50 years ago."
    },
    {
        "author": "Greek's Cool",
        "published_at": "2023-08-26T04:16:16Z",
        "updated_at": "2023-08-26T04:16:16Z",
        "like_count": 3,
        "text": "Getting the stress right in Greek is one of the most difficult things about learning the language."
    },
    {
        "author": "Georgia Moore",
        "published_at": "2023-08-26T02:31:29Z",
        "updated_at": "2023-08-26T02:31:29Z",
        "like_count": 4,
        "text": "At the very least, I now grasp the concept of leverage.\nCreating <wealth and financial freedom isn't as tough as many people believe. Building wealth and remaining financially stable indefinitely is a lot easier with the appropriate information.\nParticipating in financial programs and products is the only true approach to make a high income and remain affluent indefinitely."
    },
    {
        "author": "Paolo Bertolotti",
        "published_at": "2023-08-26T01:05:22Z",
        "updated_at": "2023-08-26T01:07:14Z",
        "like_count": 8,
        "text": "I'm Italian and I used to live in Manchester, UK. I'm not very fluent in English and my grammar isn't so accurate, but I actually can speak. Well, for some reason British people often mismatched my accent calling me a Swedish or Dutch. Very funny! My theory: Italians are usually depicted as tanned guys with black mustaches and dark eyes... but I'm pale and I've got blond hair and blue eyes. I think the sight took over the listening."
    },
    {
        "author": "Marco Prolo",
        "published_at": "2023-08-25T23:55:01Z",
        "updated_at": "2023-08-25T23:55:01Z",
        "like_count": 0,
        "text": "I could take the English posh accent easily any time but the pedantic tone is a no-no for me. Talking as who I really am is keeping the perverts at bay by itself. Maybe if I transition one day I'll speak like a pedantic Brit."
    },
    {
        "author": "Jared P",
        "published_at": "2023-08-25T23:33:35Z",
        "updated_at": "2023-08-25T23:33:35Z",
        "like_count": 1,
        "text": "I have this problem, I speak near perfect Spanish but I have a thick American accent despite speaking it at home with my mother who is a native speaker. When I try to talk to people they speak back to me in English and its so frustrating..."
    },
    {
        "author": "jony prepper israel",
        "published_at": "2023-08-25T23:26:44Z",
        "updated_at": "2023-08-25T23:26:44Z",
        "like_count": 0,
        "text": "when I talk hebrew I sounds Israeli as ussual.\nwhen I speak English in person I sound a mix of Israeli and a bit american\nwhen I speak English online I sound French"
    },
    {
        "author": "Alberto Esper",
        "published_at": "2023-08-25T20:23:10Z",
        "updated_at": "2023-08-25T20:23:10Z",
        "like_count": 0,
        "text": "Excellent explanation!👏👏👏"
    },
    {
        "author": "AryanChaudhary😎",
        "published_at": "2023-08-25T15:38:43Z",
        "updated_at": "2023-08-25T15:38:43Z",
        "like_count": 0,
        "text": "Who's from India 🇮🇳"
    },
    {
        "author": "Ilia Brus",
        "published_at": "2023-08-25T11:20:00Z",
        "updated_at": "2023-08-25T11:20:00Z",
        "like_count": 0,
        "text": "Brilliant"
    },
    {
        "author": "Klipsen Dk",
        "published_at": "2023-08-25T08:36:54Z",
        "updated_at": "2023-08-25T08:36:54Z",
        "like_count": 0,
        "text": "You have to \"be an actor\" to speak like a native. With practice, it becomes more natural."
    },
    {
        "author": "mhm2908",
        "published_at": "2023-08-25T07:59:21Z",
        "updated_at": "2023-08-25T07:59:21Z",
        "like_count": 1,
        "text": "Actually it is not correct to say the French words are accented on the last syllable.  French words usually have an equal stress on all syllables, but for an English native speaker this sounds like the last syllable is stressed - because it is relatively more stressed than in English.  This is a common mistake of English people trying to speak French"
    },
    {
        "author": "Bob",
        "published_at": "2023-08-25T06:08:38Z",
        "updated_at": "2023-08-25T06:08:38Z",
        "like_count": 0,
        "text": "What I want to know is why someone whose accent is barely decipherable in English becomes crystal clear when singing?"
    },
    {
        "author": "hotspur666",
        "published_at": "2023-08-25T02:33:48Z",
        "updated_at": "2023-08-25T02:33:48Z",
        "like_count": 0,
        "text": "C'est les petits français qui parlent ''DRÔLE''...Les Parisiens, eux, tous efféminés...et précieux et ridicules!  ''Les Précieuses ridicules est une comédie en un acte et en prose de Molière, représentée pour la première fois le 18 novembre 1659 ''"
    },
    {
        "author": "Mal-2 KSC",
        "published_at": "2023-08-25T02:11:20Z",
        "updated_at": "2023-08-25T02:11:20Z",
        "like_count": 416,
        "text": "A buddy of mine told me a story of when he went to Germany, touring with his band. He spoke fluent Polish, but was biracial (Polish and Japanese). He kept getting stares when he spoke German and someone finally told him \"It's the first time we've seen a Japanese guy speak German with a Polish accent.\""
    },
    {
        "author": "The Eternal",
        "published_at": "2023-08-25T01:48:33Z",
        "updated_at": "2023-08-25T01:48:33Z",
        "like_count": 4,
        "text": "*That's why I love Sanskrit. U can't have much difference in accents when speaking sanskrit accurately.*"
    },
    {
        "author": "SirRiffsAlot",
        "published_at": "2023-08-25T01:33:04Z",
        "updated_at": "2023-08-25T01:33:04Z",
        "like_count": 0,
        "text": "Learn one or two full comedy routines by heart from a comedian you admire. Once you got that nailed you should have made miles of progress.\nThis is of course the final touches of speaking a language without the accent. Not for beginners, lol."
    },
    {
        "author": "gamma",
        "published_at": "2023-08-24T23:30:38Z",
        "updated_at": "2023-08-24T23:30:38Z",
        "like_count": 0,
        "text": "swag berlusconi"
    },
    {
        "author": "Doca",
        "published_at": "2023-08-24T22:58:35Z",
        "updated_at": "2023-08-24T22:58:35Z",
        "like_count": 3,
        "text": "How P is different in those two examples (English/French)? I'm a native (Brazilian) Portuguese speaker and fluent in English and, to me, they sound the same. My method for trying them was typing them on Google Translator, selecting the language and clicking on Play 😀 Sorry if that's not OK...\n\nAnd one curious thing we are taught when learning Portuguese: there is only one stress syllable on every word and there are diacritics to boot. I never ever thought that in English there could be a primary stress and a secondary stress.\n\nReally interesting short video."
    },
    {
        "author": "IyedTheBoss",
        "published_at": "2023-08-24T22:56:11Z",
        "updated_at": "2023-08-24T22:56:11Z",
        "like_count": 1,
        "text": "Some of these examples are questionnable. The spain example firstly: they say espain because their country in spanish is spelt Espana. In French, we also add the EM in front of MBAPPE. MB is not a possible combination in french either, its a foreigh name so this example doesnt make sense."
    },
    {
        "author": "L Ro",
        "published_at": "2023-08-24T22:52:59Z",
        "updated_at": "2023-08-24T22:52:59Z",
        "like_count": 0,
        "text": "I  love advise from English speakers who are likely unilingual on how not to have an accent...lol!"
    },
    {
        "author": "Garden Joy",
        "published_at": "2023-08-24T22:41:56Z",
        "updated_at": "2023-08-24T22:41:56Z",
        "like_count": 1,
        "text": "Very nice short video! I learned several things in under three minutes."
    },
    {
        "author": "nohphd",
        "published_at": "2023-08-24T22:28:32Z",
        "updated_at": "2023-08-24T22:28:32Z",
        "like_count": 0,
        "text": "The Russians did, however,  manage to tie the lunar low altitude record…"
    },
    {
        "author": "Rety ",
        "published_at": "2023-08-24T21:37:49Z",
        "updated_at": "2023-08-24T21:37:49Z",
        "like_count": 4,
        "text": "When one learns a language under age of 20 the probability to have an accent in that language is very slim. The younger one is learning a new language the better one is not to have an accent. That is because the vocal cords are fully developed by age of 20. I have been told by British ppl that all of us Canadians, Australians, Americans…have an accent 😅So there!"
    },
    {
        "author": "james c Pintner",
        "published_at": "2023-08-24T20:44:55Z",
        "updated_at": "2023-08-24T20:44:55Z",
        "like_count": 0,
        "text": "I used to work with a few Germans, whose accents in English were noticeably more American than British."
    },
    {
        "author": "Timothy Seabrook",
        "published_at": "2023-08-24T19:44:15Z",
        "updated_at": "2023-08-24T19:44:15Z",
        "like_count": 0,
        "text": "in 1983 I had a germsn girfriend with a sttong yotkdhire accrnt. she had fone sn Rnhlish drgree sandehich  vourse  at koln (cologne) univerdity with the Ssndehich part at  Sheffield  Univerdity. my mother came ffom yotkdhire do I had no ttouble  with  her yotkdhire accentted  Enhlidh :- she  was the Gitl who got away!"
    },
    {
        "author": "InTeCredo",
        "published_at": "2023-08-24T19:34:29Z",
        "updated_at": "2023-08-24T19:34:29Z",
        "like_count": 1,
        "text": "Being born deaf, I don' have any memories of hearing or speaking. When I grew up in Germany, I was taught how to speak in German. When my family moved to the US, the speech therapist couldn't wring the heavy German accent out of my speech so it sort of stuck when I speak English. The hearing people couldn't believe that a deaf person could actually speak English with strong German accent."
    },
    {
        "author": "Hiroko Morioka",
        "published_at": "2023-08-24T19:22:49Z",
        "updated_at": "2023-08-24T19:22:49Z",
        "like_count": 2,
        "text": "Native English speakers have funny regional accents. In fact, speakers of any language have the own accents. Fancy."
    },
    {
        "author": "Turn Left",
        "published_at": "2023-08-24T19:21:03Z",
        "updated_at": "2023-08-24T19:21:03Z",
        "like_count": 1,
        "text": "this was kind of funny because it was so true xD"
    },
    {
        "author": "PracticeMindfulness",
        "published_at": "2023-08-24T17:40:05Z",
        "updated_at": "2023-08-24T17:40:05Z",
        "like_count": 0,
        "text": "I thought i was channeling 😅 i used to hear a french accent but now its Japanese but with the Japanese words just fly out but I have no idea what I'm saying but it just sounds cute.\nAny explanation would be appreciated 👍"
    },
    {
        "author": "Power Of AI & Motivation",
        "published_at": "2023-08-24T17:32:49Z",
        "updated_at": "2023-08-24T17:32:49Z",
        "like_count": 0,
        "text": "Wow, seriously schools are very outdated all over the world and need revolution and improvements asap on so many levels and topics, they also need to add teaching basic manners and emotional intelligence and how to deal with emotions properly."
    },
    {
        "author": "Theodore Sternberg",
        "published_at": "2023-08-24T17:22:46Z",
        "updated_at": "2023-08-24T17:23:09Z",
        "like_count": 0,
        "text": "There's an analogy here to drawing.  You draw badly because you draw your mental model/caricature of things, rather than drawing what you actually see.  Likewise, when you speak another language, you don't pronounce it as you hear it (from natives), you generate it from a \"toolkit\" of sounds from your native language."
    },
    {
        "author": "Helen Hucker",
        "published_at": "2023-08-24T16:07:25Z",
        "updated_at": "2023-08-24T16:07:25Z",
        "like_count": 0,
        "text": "Thank you for a very interesting video. My one year old grandson is just learning to speak and as he lives in Edinburgh I expect him to develop a Scottish accent as he grows up. My daughter grew up in London and Cambridgeshire so she has an English accent whilst her husband comes from Northern Ireland. It will therefore become a home  English speakers but with three distinct accents!"
    },
    {
        "author": "Kosher Without Borders",
        "published_at": "2023-08-24T16:02:15Z",
        "updated_at": "2023-08-24T16:02:15Z",
        "like_count": 0,
        "text": "Can this power be learned?"
    },
    {
        "author": "Carewolf",
        "published_at": "2023-08-24T15:52:52Z",
        "updated_at": "2023-08-24T15:54:13Z",
        "like_count": 0,
        "text": "you can't say initial mb in any language. There will always be a specific vowel or half-vowel sounds for these stand alone consonants, but it cant be a consonant cluster as we pronounce adjacent consontants in Germanic. Though ofcourse expecting it to be singular consonant cluster, is a germanic way of thinking in itself."
    },
    {
        "author": "Clandes Zipp",
        "published_at": "2023-08-24T15:13:45Z",
        "updated_at": "2023-08-24T15:13:45Z",
        "like_count": 0,
        "text": "This was interesting and light on tired mind."
    },
    {
        "author": "DesiDesigning",
        "published_at": "2023-08-24T14:51:24Z",
        "updated_at": "2023-08-24T14:51:24Z",
        "like_count": 0,
        "text": "Outstanding!"
    },
    {
        "author": "Kain",
        "published_at": "2023-08-24T14:25:56Z",
        "updated_at": "2023-08-24T14:25:56Z",
        "like_count": 0,
        "text": "Isn't that kinda obvious? One can rhyme that together just by reading the title, kinda pointless video"
    },
    {
        "author": "quacksort",
        "published_at": "2023-08-24T13:55:06Z",
        "updated_at": "2023-08-24T13:55:06Z",
        "like_count": 0,
        "text": "As an Italian I feel personally attacked 😂 but it's sooo true"
    },
    {
        "author": "T P",
        "published_at": "2023-08-24T13:50:12Z",
        "updated_at": "2023-08-24T13:50:12Z",
        "like_count": 0,
        "text": "I often affect a foreign accent, just to annoy people."
    },
    {
        "author": "Alpha Bravo",
        "published_at": "2023-08-24T12:50:54Z",
        "updated_at": "2023-08-24T12:50:54Z",
        "like_count": 0,
        "text": "1:24 Mnemonics you find in English, though."
    },
    {
        "author": "Alpha Bravo",
        "published_at": "2023-08-24T12:48:46Z",
        "updated_at": "2023-08-24T12:48:46Z",
        "like_count": 0,
        "text": "never considered Arnie being fluent 😂"
    },
    {
        "author": "Łukasz Domański",
        "published_at": "2023-08-24T12:21:58Z",
        "updated_at": "2023-08-24T12:21:58Z",
        "like_count": 3,
        "text": "Everyone have \"accent\", even native speaker in their native language."
    },
    {
        "author": "Louis Giokas",
        "published_at": "2023-08-24T12:18:10Z",
        "updated_at": "2023-08-24T12:18:10Z",
        "like_count": 1,
        "text": "Wow! This is news?  Doesn't everyone know this? What a waste."
    },
    {
        "author": "CODING EXPRESS",
        "published_at": "2023-08-24T09:13:51Z",
        "updated_at": "2023-08-24T09:13:51Z",
        "like_count": 0,
        "text": "Even the American English is an accent to other people, like England"
    },
    {
        "author": "ospuddy",
        "published_at": "2023-08-24T09:05:03Z",
        "updated_at": "2023-08-24T09:05:03Z",
        "like_count": 0,
        "text": "The word stressed is too confusing.  When you say stress a syllable do you mean the time, the volume, or the pitch?  Why not just use musical terminology?  Two beats on the 1st syllable and one beat on 2nd and 3rd?  Like fragola.  I know:  It's not that regimented like music, but that's a way to let folks know the fra has a long vowel, while go and la are short vowels.  Which also goes to show that Italian is not syllable timed.  Non e veeeeeero!  (stress emphasized!)"
    },
    {
        "author": "Deepak Dhankhar",
        "published_at": "2023-08-24T08:09:04Z",
        "updated_at": "2023-08-24T08:09:04Z",
        "like_count": 1,
        "text": "\"Mbappe\" to the point 👍👍"
    },
    {
        "author": "Napoli Sicila",
        "published_at": "2023-08-24T07:19:47Z",
        "updated_at": "2023-08-24T07:19:47Z",
        "like_count": 0,
        "text": "I speak a special south china dialect, and my uncle speaks anther one. He is the best one who speaks my dialect as a foreigner, and he has living with us for decades, but at some tiny place I still could recognize his accent."
    },
    {
        "author": "Augustus Asgeir",
        "published_at": "2023-08-24T07:01:41Z",
        "updated_at": "2023-08-24T07:01:41Z",
        "like_count": 2,
        "text": "I'm American but speak French, Russian, some Turkish, German ,  Norwegian, Danish, Czech and dabbled in Arabic, Greek so my accent is interesting lol"
    },
    {
        "author": "Melania Monica Craciun",
        "published_at": "2023-08-24T06:42:58Z",
        "updated_at": "2023-08-24T06:42:58Z",
        "like_count": 0,
        "text": "Because it's cute"
    },
    {
        "author": "Jandy",
        "published_at": "2023-08-24T06:24:13Z",
        "updated_at": "2023-08-24T06:24:13Z",
        "like_count": 0,
        "text": "I once heard some asian language teacher say \"To speak english properly, you have to speak english with your english mouth, not with you asian mouth.\""
    },
    {
        "author": "Leandro Tami",
        "published_at": "2023-08-24T06:05:37Z",
        "updated_at": "2023-08-24T06:05:37Z",
        "like_count": 5,
        "text": "In my case the explanation is simple: little contact in real life with native speakers AND the fact that many times I cannot hear the difference of two different sounds so I can't even try to imitate them. Also English I think makes very little sense phonetically so I basically need to hear all the words multiple times in order to understand how they should be pronounced."
    },
    {
        "author": "sher ka baccha",
        "published_at": "2023-08-24T05:26:47Z",
        "updated_at": "2023-08-24T05:26:47Z",
        "like_count": 0,
        "text": "In the past, I have encountered situations, when, speaking with non native English speakers my accent changed and the overall quality of my speech suffered. Is that normal?"
    },
    {
        "author": "Marcel Nowakowski",
        "published_at": "2023-08-24T05:26:07Z",
        "updated_at": "2023-08-24T05:26:07Z",
        "like_count": 1,
        "text": "I live in Canada, speak 5 languages, my first language was Polish.\nI speak English with a slight accent.\nNow, I also speak Polish with a slight foreign accent.\nLol..."
    },
    {
        "author": "Republic defense",
        "published_at": "2023-08-24T04:40:27Z",
        "updated_at": "2023-08-24T04:40:27Z",
        "like_count": 0,
        "text": "First"
    },
    {
        "author": "Brian Burgess",
        "published_at": "2023-08-24T04:14:36Z",
        "updated_at": "2023-08-24T04:14:36Z",
        "like_count": 0,
        "text": "How come though all English speakers sound like new England American when they're singing a song?"
    },
    {
        "author": "Maggie Mae",
        "published_at": "2023-08-24T03:34:13Z",
        "updated_at": "2023-08-24T03:34:13Z",
        "like_count": 0,
        "text": "Can you explain how the bay city rollers could sing without their thick Scottish accent but could not understand them speaking in their thick Scottish accent? Ha! I already know the answer. Wasn’t them singing"
    },
    {
        "author": "Lemuel Buitre",
        "published_at": "2023-08-24T02:48:41Z",
        "updated_at": "2023-08-24T02:48:41Z",
        "like_count": 0,
        "text": "When I am learning a new language, aside from grammar, I am trying my best to learn also the accent and the right stresses on the words."
    },
    {
        "author": "Mince Fat",
        "published_at": "2023-08-24T02:06:45Z",
        "updated_at": "2023-08-24T02:06:45Z",
        "like_count": 4,
        "text": "they REALLY gotta teach this in language classes. this stuff feels so important to me but is NEVER taught in classrooms in my experience"
    },
    {
        "author": "Christopher Trogdon",
        "published_at": "2023-08-24T01:35:21Z",
        "updated_at": "2023-08-24T01:35:21Z",
        "like_count": 0,
        "text": "You have an accent in a foreign language because even though you're speaking another language your natural accent is still in your voice."
    },
    {
        "author": "Edward Ce",
        "published_at": "2023-08-23T23:45:18Z",
        "updated_at": "2023-08-23T23:45:18Z",
        "like_count": 0,
        "text": "Use ai to detect acc"
    },
    {
        "author": "hyposlasher",
        "published_at": "2023-08-23T22:39:48Z",
        "updated_at": "2023-08-23T22:41:47Z",
        "like_count": 3,
        "text": "This is the least accurate explanation. The aim reason why you speak with an accent is because you have a set of sounds of your native language that your brain tends to use in a foreign language. That’s it"
    },
    {
        "author": "Jibon Japan ଜୀବନ ଜାପାନ",
        "published_at": "2023-08-23T22:02:02Z",
        "updated_at": "2023-08-23T22:02:02Z",
        "like_count": 0,
        "text": "I am able to “identify” many languages without actually understanding the meaning. \nLook out for patterns be it stress or common words or talking style."
    },
    {
        "author": "Someone else.",
        "published_at": "2023-08-23T21:51:54Z",
        "updated_at": "2023-08-23T21:51:54Z",
        "like_count": 0,
        "text": "Reading all the comments (bragging) about how well, people speak.....I don't have a problem. \nWhen I speak, I sound like an idiot and everyone thinks I am an idiot."
    },
    {
        "author": "Zschokks",
        "published_at": "2023-08-23T20:32:18Z",
        "updated_at": "2023-08-23T20:32:18Z",
        "like_count": 0,
        "text": "Killyan Mbappé might be French but the pronunciation of his name has nothing to do with French. As a Frenchman I have actually no idea how it is pronounced correctly in his Cameroon dialect."
    },
    {
        "author": "Kieran of Blackwood",
        "published_at": "2023-08-23T20:22:03Z",
        "updated_at": "2023-08-23T20:22:03Z",
        "like_count": 2,
        "text": "555th comment."
    },
    {
        "author": "Jude Morales",
        "published_at": "2023-08-23T18:47:58Z",
        "updated_at": "2023-08-23T18:47:58Z",
        "like_count": 0,
        "text": "I wondered. Now I know. English speaker, Spanish and Arabic second and third. My husband kept telling me that I insert letters in Arabic. Here's why.❤"
    },
    {
        "author": "Herb Sewell",
        "published_at": "2023-08-23T17:44:54Z",
        "updated_at": "2023-08-23T17:44:54Z",
        "like_count": 0,
        "text": "K, thanks, Economist, for this really hard-hitting journalism, asking the real challenging questions. \nSome other topics you can consider:\nWhy does it cost more when you put more gas in your tank than when you put less?\nWhy do you urinate more the more water you drink?\nWhy do people with failing eyesight find reading harder?"
    },
    {
        "author": "digiryde",
        "published_at": "2023-08-23T17:19:32Z",
        "updated_at": "2023-08-23T17:19:32Z",
        "like_count": 0,
        "text": "Better taught.  The root of so many issues is that fundamental concept not being present, not being allowed, or not being possible."
    },
    {
        "author": "Prince Kumar",
        "published_at": "2023-08-23T16:55:58Z",
        "updated_at": "2023-08-23T16:55:58Z",
        "like_count": 0,
        "text": "We need an universal sound elements which can be used to represent and learn the different different languages"
    },
    {
        "author": "Wakam Henoch",
        "published_at": "2023-08-23T16:13:05Z",
        "updated_at": "2023-08-23T16:13:05Z",
        "like_count": 0,
        "text": "French commentators too usually say EM. BA .PE.\nBecause the name has roots in an african language"
    },
    {
        "author": "Aleksandar GC",
        "published_at": "2023-08-23T14:46:19Z",
        "updated_at": "2023-08-23T14:46:19Z",
        "like_count": 0,
        "text": "As a native speaker of Serbian, Italian is very easy for me to learn and my accent is much similar to that of native Italian."
    },
    {
        "author": "martin kullberg",
        "published_at": "2023-08-23T13:47:43Z",
        "updated_at": "2023-08-23T13:47:43Z",
        "like_count": 0,
        "text": "I have a dutch accent like saying disolve more like dizolluf, if I'm not paying atention."
    },
    {
        "author": "WhiteTiger333",
        "published_at": "2023-08-23T13:39:57Z",
        "updated_at": "2023-08-23T13:39:57Z",
        "like_count": 2,
        "text": "Some of the European countries, where children start English very early, have, to my American ears, not so much of an accent as a precision in speech that we don't have.   It's funny that someone can be identified as a non-native speaker because they are speaking the language the way it's meant to be spoken.  😄"
    },
    {
        "author": "WhiteTiger333",
        "published_at": "2023-08-23T13:32:07Z",
        "updated_at": "2023-08-23T13:32:07Z",
        "like_count": 19,
        "text": "When I first went to India, I had a hard time understanding the way many Indians spoke English.  To me, the words just ran together with no particular emphasis.  Over time, my brain learned how to sort it out.  Once I began learning Hindi, it made sense to me why these speakers spoke English the way they did.  And it was always speakers who had learned English in school, but never traveled out of the country to be exposed to native English speakers.  The same would be true, I'm sure, for any language."
    },
    {
        "author": "Andy O.",
        "published_at": "2023-08-23T11:19:46Z",
        "updated_at": "2023-08-23T11:19:46Z",
        "like_count": 0,
        "text": "Why do you have an accent in your native language ? 🤪"
    },
    {
        "author": "Gabriel",
        "published_at": "2023-08-23T11:17:35Z",
        "updated_at": "2023-08-23T11:17:35Z",
        "like_count": 0,
        "text": "I'm learning Italian. This makes sense now when I hear Italian speakers speaking English 😮"
    },
    {
        "author": "GC ways",
        "published_at": "2023-08-23T09:28:05Z",
        "updated_at": "2023-08-23T09:28:05Z",
        "like_count": 4,
        "text": "My native language is Malayalam. It is a South-Indian language, which is usually considered as the most difficult language in India.\nThe way we speak Malayalam is extremely different from languages like English. In Malayalam, clarity and stress are given the most importance. Since birth, we are always advised to speak each and every word clearly and rigidly. Unfortunately, it is the opposite way of speaking musical and floating languages like English."
    },
    {
        "author": "ZAIRGA'S HAVEN",
        "published_at": "2023-08-23T08:24:38Z",
        "updated_at": "2023-08-23T08:24:38Z",
        "like_count": 0,
        "text": "So the pronunciation and stress matters"
    },
    {
        "author": "Dino Sauro",
        "published_at": "2023-08-23T07:43:58Z",
        "updated_at": "2023-08-23T07:43:58Z",
        "like_count": 0,
        "text": "Who cares?"
    },
    {
        "author": "burtingtune",
        "published_at": "2023-08-23T07:27:01Z",
        "updated_at": "2023-08-23T07:27:01Z",
        "like_count": 1,
        "text": "Having a foreign accent when speaking another language is a great protection from causing offence. Unless you are completely fluent, you will occasionally make mistakes that, if you were a native speaker, would cause upset. The fact that you sound like Inspector Clouseau alerts everyone to the fact that you most probably didn´t mean that their mother is a wonderful earwig and produces a laugh and not a punch on the nose."
    },
    {
        "author": "Valentin",
        "published_at": "2023-08-23T06:37:49Z",
        "updated_at": "2023-08-23T06:37:49Z",
        "like_count": 0,
        "text": "In France too we call Mbappe (e)Mbappe, cause m & b fused aren't in the language and are a little bit tricky to pronounce in \"African style\""
    },
    {
        "author": "MirkaDodo",
        "published_at": "2023-08-23T06:22:17Z",
        "updated_at": "2023-08-23T06:23:08Z",
        "like_count": 0,
        "text": "To je také cute keď nerozumiem po anglicky kvôli akcentu😂😂😂o čom sa hovorí?ani obraz, ani zvuk😂"
    },
    {
        "author": "Marcin Morun",
        "published_at": "2023-08-23T06:09:35Z",
        "updated_at": "2023-08-23T06:09:35Z",
        "like_count": 0,
        "text": "Once, my (Lebanese) math teacher tried to make me (Polish) pronounce an Arab word. Result: My throat couldn't \"do it\"."
    },
    {
        "author": "The Plasma Collider",
        "published_at": "2023-08-23T05:08:33Z",
        "updated_at": "2023-08-23T05:08:33Z",
        "like_count": 2,
        "text": "Another problem is that when you learn a foreign language, you don't know where you're making the mistakes"
    },
    {
        "author": "balan",
        "published_at": "2023-08-23T04:46:22Z",
        "updated_at": "2023-08-23T04:46:22Z",
        "like_count": 0,
        "text": "The economist is a waste"
    },
    {
        "author": "josenildo ferreira assunção",
        "published_at": "2023-08-23T01:10:14Z",
        "updated_at": "2023-08-23T01:10:14Z",
        "like_count": 1,
        "text": "Everyone has an accent, even the native speakers."
    },
    {
        "author": "Leonardo Druscovich",
        "published_at": "2023-08-23T00:17:57Z",
        "updated_at": "2023-08-23T00:17:57Z",
        "like_count": 0,
        "text": "No, I don't 🤡"
    },
    {
        "author": "Oziji",
        "published_at": "2023-08-22T22:28:46Z",
        "updated_at": "2023-08-22T22:28:46Z",
        "like_count": 0,
        "text": "I would have loved to eavesdrop on Silvio Berlusconi"
    },
    {
        "author": "Ingvar Lin",
        "published_at": "2023-08-22T20:48:54Z",
        "updated_at": "2023-08-22T20:48:54Z",
        "like_count": 0,
        "text": "When American actors try to speak Russian playing Russian, it's so awful that Russians don't understand it"
    },
    {
        "author": "Marcus Aurelius",
        "published_at": "2023-08-22T19:03:22Z",
        "updated_at": "2023-08-22T19:03:22Z",
        "like_count": 0,
        "text": "one more thing is how you express emotions while talking"
    },
    {
        "author": "123_Soleil",
        "published_at": "2023-08-22T18:52:11Z",
        "updated_at": "2023-08-22T18:52:11Z",
        "like_count": 0,
        "text": "Choukran"
    },
    {
        "author": "Tuk Tuk",
        "published_at": "2023-08-22T18:51:28Z",
        "updated_at": "2023-08-22T18:51:28Z",
        "like_count": 0,
        "text": "Im Nigerian, and I am dah Prince! ❤"
    },
    {
        "author": "troiscarottes",
        "published_at": "2023-08-22T17:49:04Z",
        "updated_at": "2023-08-22T17:49:04Z",
        "like_count": 0,
        "text": "Maybe it's better to speak lika dees if you're vacationing in Italee. 😉"
    },
    {
        "author": "Hein",
        "published_at": "2023-08-22T17:36:53Z",
        "updated_at": "2023-08-22T17:36:53Z",
        "like_count": 0,
        "text": "I just can't say the name 'Carl' without saying Carrol or Cal"
    },
    {
        "author": "temirlannu",
        "published_at": "2023-08-22T16:31:43Z",
        "updated_at": "2023-08-22T16:31:43Z",
        "like_count": 0,
        "text": "🔥that’s perfect"
    },
    {
        "author": "Varoon None",
        "published_at": "2023-08-22T13:37:43Z",
        "updated_at": "2023-08-22T13:43:33Z",
        "like_count": 10,
        "text": "I'm an Indo-Mauritian \n\nMy native language is french based Mauritian Creole. Learnt English and French as from age four and Hindi as from age six\n\nI've lived in France since age 19\n\nPeople from the Indian Ocean, Reunionese and Malagasies, immediately identify my Mauritian accent when I'm speaking French \n\nFrench people mistake my accent, when I'm speaking French, for a posh British accent\n\nWhen speaking English, my accent isn't like the French accent at all\n\nMy accent when speaking Hindi is, I guess, like any Bihari accent. I've never heard a record of it and no Indian has ever commented on it \n\nAll this is very surprising because when I speak French, I don't hear my own accent. To my own ears, I have a neutral Parisian accent\n\nI don't know if it is related with accents but despite learning French since age four and listening to native French speakers on television and in real life since then, I can't pronounce the french \"ar\" correctly\n\nI can't say \"Chartres\" and \"Montmartre\" properly because I don't naturally open my mouth enough for the \"ar\" syllable \n\nI actually dreaded the prospect of working at Chartres when I received an internship offer there 😅"
    },
    {
        "author": "Robert Sleigh",
        "published_at": "2023-08-22T12:28:33Z",
        "updated_at": "2023-08-22T12:28:33Z",
        "like_count": 0,
        "text": "Very interesting indeed! (But please, it's \"pronunciation\" and not \"pronounciation\" !)"
    },
    {
        "author": "Bob Howie",
        "published_at": "2023-08-22T09:51:36Z",
        "updated_at": "2023-08-22T09:51:36Z",
        "like_count": 0,
        "text": "Whatever your language, any other language will be influenced by your native tongue, you can't help it. Actors can sometimes manage it really well but that is because their words are scripted and can be translated phonetically so it sounds correct, it doesn't mean they could make up their own words and get it correct. I have a Scottish accent because everyone recognises it, except Americans who think everything is Irish or jibberish, but they are just ignorant. I also find being Scottish abroad, if the tongue isn't English, they will try to communicate, yet I discovered if the person is English, they won't."
    },
    {
        "author": "ROMAN Staszak",
        "published_at": "2023-08-22T09:49:16Z",
        "updated_at": "2023-08-22T09:49:16Z",
        "like_count": 0,
        "text": "Very interesting indeed 🤔🤔😀👍👋👋"
    },
    {
        "author": "colilaobalioca",
        "published_at": "2023-08-22T06:58:41Z",
        "updated_at": "2023-08-22T06:58:41Z",
        "like_count": 1,
        "text": "To me, another reason that you might sound unlikely a native English speaker is that the number of alphabets in your mother tongue is limited compared to the targeted language, English. However, I will most likely pronounce and sound like a native English speaker because my first language contains almost 45 alphabets which are further than the others. Moreover, assimilation is crucial as well when you spend time with native speakers, your accents are likely blendable with them. Needless to say, you must improve your accent every day in front of the mirror to hear yourself or record your voice to see which part needed to improve.  \n\nThere are tons of tips to improve your accent(s) to sound like a native speaker, just choose some that are suitable for yourself. Nevertheless, sounding like a native doesn't mean you are successful in English, but please take note that speaking it with your own accent sounds more meaningful and it will be better if you make it your own."
    },
    {
        "author": "AussieElf",
        "published_at": "2023-08-22T05:55:27Z",
        "updated_at": "2023-08-22T05:55:27Z",
        "like_count": 0,
        "text": "I'm a native-speaker of English (from Australia) and I'm fluent in Spanish (with a paisa accent from Colombia since that's where my husband is from). In French, apparently I sound like a \"suisse romand\" because of speaking slowly and with a more or less English intonation. I figure that's close enough!"
    },
    {
        "author": "BGTuyau",
        "published_at": "2023-08-22T01:33:51Z",
        "updated_at": "2023-08-22T01:33:51Z",
        "like_count": 27,
        "text": "Funny, smart and —as US Americans never used to say— spot on."
    },
    {
        "author": "Tara Denaway",
        "published_at": "2023-08-22T01:33:24Z",
        "updated_at": "2023-08-22T01:33:24Z",
        "like_count": 0,
        "text": "Крутое видео получилось"
    },
    {
        "author": "Martina Bautista",
        "published_at": "2023-08-21T23:33:28Z",
        "updated_at": "2023-08-21T23:33:28Z",
        "like_count": 0,
        "text": "Im from Ecuador trying to learn English and something that discourges me is that I wont be able to be understood by natives"
    },
    {
        "author": "Kinildson Géssio Persegueiro",
        "published_at": "2023-08-21T21:52:19Z",
        "updated_at": "2023-08-21T21:52:19Z",
        "like_count": 0,
        "text": "Oh ty for that.\nI'll try to adjust my somewhat weird brazillian-english accent."
    },
    {
        "author": "Manuel Capela",
        "published_at": "2023-08-21T21:46:49Z",
        "updated_at": "2023-08-21T21:46:49Z",
        "like_count": 2,
        "text": "Some accents do have a charm of their own!😊"
    },
    {
        "author": "HenryManson",
        "published_at": "2023-08-21T20:53:12Z",
        "updated_at": "2023-08-21T20:53:12Z",
        "like_count": 0,
        "text": "from my german perspective, having learned flawless english, i cant shake the accent, because the pronounciation of letters is just different & oftentimes just sooo slightly, that it would take real effort/processing brainpower to not \"mispronounce\" a sound, if that makes sense 🤣 and as Hamburger myself, other germans even know what city im from, just by talking to them 🍔\nBUT i think, as long as the message can be conveyed to someone else, it doesnt matter how \"bad\" the accent is! \n......and the whole world is butchering german in movies/series & everywhere, sooo no one is allowed to complain about accents!"
    },
    {
        "author": "SirEdwardeight",
        "published_at": "2023-08-21T20:02:10Z",
        "updated_at": "2023-08-21T20:02:51Z",
        "like_count": 0,
        "text": "When I speak what broken German I can muster, I tend to do it with an English accent. Which is peculiar since my mother language is Italian."
    },
    {
        "author": "Vishal Maraj",
        "published_at": "2023-08-21T19:40:11Z",
        "updated_at": "2023-08-21T19:40:11Z",
        "like_count": 2,
        "text": "The economist is arrogant and wrong on so many things."
    },
    {
        "author": "jean oq",
        "published_at": "2023-08-21T17:15:59Z",
        "updated_at": "2023-08-21T17:15:59Z",
        "like_count": 0,
        "text": "Very insightful but I need to say that having an accent is not a hindrance for clear and fluent communication, as the end of the video suggests."
    },
    {
        "author": "Tahoe Jones",
        "published_at": "2023-08-21T15:58:04Z",
        "updated_at": "2023-08-21T15:58:04Z",
        "like_count": 0,
        "text": "This apologist needs to watch \"My Fair Lady\".😊"
    },
    {
        "author": "Eric P",
        "published_at": "2023-08-21T13:12:26Z",
        "updated_at": "2023-08-21T13:12:26Z",
        "like_count": 0,
        "text": "Most accidents that people have in their native language tend to stay with them, even when they speak a different language."
    },
    {
        "author": "Nestor Makhno",
        "published_at": "2023-08-21T12:45:34Z",
        "updated_at": "2023-08-21T12:45:34Z",
        "like_count": 0,
        "text": "There is not ONE French accent, there are many of them, for ex the Parisian one, the Northern one, the Burgundian one, the South-Western and South-Eastern ones... and of course the Alsatian one. Then also the Belgian one, the Swiss one, the Québecois one, the African one, the Polynesian one... etc."
    },
    {
        "author": "Sharon Kay Snowton",
        "published_at": "2023-08-21T12:13:26Z",
        "updated_at": "2023-08-21T12:13:26Z",
        "like_count": 0,
        "text": "I enjoyed this video. I grew up in a home where we spoke Spanish and English.  In Grad School I took Portuguese as my 3rd language.  I am a Texan so my Spanish is Texan Spanish.  Every once in a while someone will tell me my Spanish is spoken like a Portuguese person. (ja, ja) I always laugh.  Thanks for explaining why."
    },
    {
        "author": "William Hinchcliff",
        "published_at": "2023-08-21T11:28:59Z",
        "updated_at": "2023-08-21T11:28:59Z",
        "like_count": 0,
        "text": "And you didn't even touch on the use of tone in Asian languages!"
    },
    {
        "author": "Andrea Valeri",
        "published_at": "2023-08-21T10:52:46Z",
        "updated_at": "2023-08-21T10:52:46Z",
        "like_count": 1,
        "text": "This is actual a brilliant short explanation. Kudos to you"
    },
    {
        "author": "prageruwu",
        "published_at": "2023-08-21T10:32:43Z",
        "updated_at": "2023-08-21T10:32:43Z",
        "like_count": 0,
        "text": "everyone has an accent, that's how language and speaking works"
    },
    {
        "author": "Helena McGinty",
        "published_at": "2023-08-21T10:17:32Z",
        "updated_at": "2023-08-21T10:17:32Z",
        "like_count": 0,
        "text": "Ha. Stress. I am English and struggle with Spanish dificil. Where the stress is on the 2nd syllable.  Its just too difficult."
    },
    {
        "author": "Ondřej Matějka",
        "published_at": "2023-08-21T10:03:44Z",
        "updated_at": "2023-08-21T10:10:24Z",
        "like_count": 0,
        "text": "Concept of stresses and accents is pretty new for me as a Czech speaker, we speak very monotone, pronouncing all letters the same, so I thought we don't have anything like \"accent\" but few years ago, I learnt that that we have accent always on first syllable and I was like \"what they mean by accent?\" I thought it's literally lack of any accent, we just read it, all letters the same, not growing or up and down intonation or something and they say we have accent on first syllable? Ok, that was new for me, I had to google more about what exactly means accent and stress, because it was really something not understandable for me. I thought that accent is for example what Russians are doing, how they pronounce middle of word more loud or something (english speakers also do that), but I didn't know we also have some accent.\nSo this is really hard to understand for people who speak such monotone languages are Czech is. We don't understand concept of some accents, so to learn English or Russian (both are extreme cases) is really a pain because you have to focus on correct accents or stress or what and it's really hard to constantly think about that.\n\nOfcourse accent in foreign language is something totaly different, the \"lack of accent\" is our accent in English or how to explain that, we just read it how it is written as robots. 😀 Czech accent can be pain to hear in English, but at least I understand it, which is not the case with some other speakers who skip a lot of letters (like I heard in Portugal for example) or the turn everything to Z like Russians do and with their crazy intonation, I can't understand a single word if that speaker is not really fluent, while even very bad English speaker from Czechia is still kind of understandable. But maybe it's totaly different for you when you have English as native speakers, I don't understand at all Russians, Ukrainians, most of Asians, Inds, black people and many others. Someone will say something about racism, but I just have problem to understand black people, sorry. Now I am more used to, but few years ago? No way, instead of \"my car\" they say \"m'ca\" or something like that, which is interesting that they still keep their family accents even when they are already born in UK or USA."
    },
    {
        "author": "Isa Lutfi",
        "published_at": "2023-08-21T09:14:46Z",
        "updated_at": "2023-08-21T09:14:46Z",
        "like_count": 0,
        "text": "Thank you for sharing this insightful thing"
    },
    {
        "author": "CheekiScrubb",
        "published_at": "2023-08-21T09:14:13Z",
        "updated_at": "2023-08-21T09:14:13Z",
        "like_count": 0,
        "text": "ngl the first thought that came to my mind reading the title was muscle memory lol"
    },
    {
        "author": "Mr. Shadowman™ blast! ",
        "published_at": "2023-08-21T08:46:13Z",
        "updated_at": "2023-08-21T08:46:13Z",
        "like_count": 0,
        "text": "NO MORE MONEY."
    },
    {
        "author": "Fariha Mohamed Hilmy",
        "published_at": "2023-08-21T08:45:51Z",
        "updated_at": "2023-08-21T08:45:51Z",
        "like_count": 3,
        "text": "Oh now I get it! \n\nSo the reason why foreigners have various English accents is because of \n\n1. The way they were taught to pronounce in their own language\n2. Stress on certain vowels and consonants"
    },
    {
        "author": "Jose Alcérreca",
        "published_at": "2023-08-21T08:19:34Z",
        "updated_at": "2023-08-21T08:19:34Z",
        "like_count": 1,
        "text": "A matador to represent Spain in 2023, really?"
    },
    {
        "author": "Max Zytaruk",
        "published_at": "2023-08-21T08:13:59Z",
        "updated_at": "2023-08-21T08:13:59Z",
        "like_count": 0,
        "text": "I learned a lot from this :)"
    },
    {
        "author": "Mo R.",
        "published_at": "2023-08-21T08:01:00Z",
        "updated_at": "2023-08-21T08:01:00Z",
        "like_count": 0,
        "text": "I often find myself slightly mimicking someone accent just to ensure that they can understand me."
    },
    {
        "author": "misterwiggle",
        "published_at": "2023-08-21T07:17:54Z",
        "updated_at": "2023-08-21T07:17:54Z",
        "like_count": 0,
        "text": "as Indonesian, that's funny. here we already have a minimum of 3 different languages and accents spoken everyday 😅"
    },
    {
        "author": "Siankaan Ugalde",
        "published_at": "2023-08-21T07:12:41Z",
        "updated_at": "2023-08-21T07:12:41Z",
        "like_count": 2,
        "text": "This is something that has puzzled me for a long time. As a mexican, when I hear other mexicans talking in english, their pronunciation might not be perfect but they really sound close to a native speaker (at least to me); but when you happen to find a native english speaker talking in spanish it's a big big diffenrece, most of the time they couldn't sound less native. I always wondered why is there such a big difference, I mean english has a lot of sounds that don't exist in spanish, but mexicans seem to have little trouble learning them, while spanish has almost no sounds that don't exist in english, but english speakers pronounce spanish very english like... it's just as if they didn't care at all.\n\nAnd by the way if you compare mexicans with spaniards when talking in english it's also day and night. The vast majority of spaniards I've heard also talk in english with a very spanish pronunciation... it's almost as if they didn't care."
    },
    {
        "author": "v.lls.ssss.",
        "published_at": "2023-08-21T04:25:45Z",
        "updated_at": "2023-08-21T04:25:45Z",
        "like_count": 0,
        "text": "interesting"
    },
    {
        "author": "Weeb Destroyah",
        "published_at": "2023-08-21T03:47:29Z",
        "updated_at": "2023-08-21T03:47:36Z",
        "like_count": 0,
        "text": "You are use the wrong phonemes, or your tonality is off. It's that simple."
    },
    {
        "author": "HAYNE",
        "published_at": "2023-08-21T03:44:57Z",
        "updated_at": "2023-08-21T03:44:57Z",
        "like_count": 0,
        "text": "Italian accent is so cute, just can't keep listening all day."
    },
    {
        "author": "Fernando Marcelo Landaburu",
        "published_at": "2023-08-21T00:28:40Z",
        "updated_at": "2023-08-21T00:28:40Z",
        "like_count": 0,
        "text": "Funny and real"
    },
    {
        "author": "MissusJ",
        "published_at": "2023-08-20T22:39:31Z",
        "updated_at": "2023-08-20T22:39:31Z",
        "like_count": 2,
        "text": "YES! That's why it can help to first immerse oneself in the plain listening to a language, without intent of understanding it. Take in the rhythm, cadence and stressors, before going in for actual grammar and words. I see it like choosing and preparing the soil before actually planting the seeds which then of course need nurturing to grow. Sure plants could grow in the soil you've always used, but imagine the full potential if you chose and prepared the specific soil for the specific plant you wanna grow 🌺"
    },
    {
        "author": "Eugène Ylliez",
        "published_at": "2023-08-20T22:31:17Z",
        "updated_at": "2023-08-20T22:31:17Z",
        "like_count": 281,
        "text": "As a scholar of Italian linguistics, allow me  a correction (if it is such). Actually, Italian distinguishes length for both vowels and consonants (long and short), not only in word morphology but also and especially at the prosodic level. (Nespor, 2014). The reason why English speakers notice that syllabic homorhythm is, in my opinion, due to two main causes : 1) the fact that the stereotype of the Italian accent is actually drawn from Neapolitan, 2) the fact that an Italian locutor has a tendency not to distinguish long and short vowels in English because simply from the point of view of the Italian source phonology, English words almost never present that structure that triggers vowel elongation in Italian instead. Rather, English words invite, if anything, an Italian to double the consonant and/or add a final schewa. None of this, however, implies that Italian always has syllables of equal length, for such is only a foreign ear's impression of the Italian language."
    },
    {
        "author": "Imaginative Monkey",
        "published_at": "2023-08-20T22:28:37Z",
        "updated_at": "2023-08-20T22:28:37Z",
        "like_count": 5,
        "text": "In Farsi, we don't have short vowels. So, for example, we pronounce pitch as peach. Probably, the most famous one is \"Sun of a beach\"! 😂"
    },
    {
        "author": "Fewbblb",
        "published_at": "2023-08-20T22:21:33Z",
        "updated_at": "2023-08-20T22:21:33Z",
        "like_count": 0,
        "text": "Mboscossaur"
    },
    {
        "author": "Octavi Soler",
        "published_at": "2023-08-20T22:19:14Z",
        "updated_at": "2023-08-20T22:19:14Z",
        "like_count": 0,
        "text": "Real title: why they have accent when speaking English?"
    },
    {
        "author": "NicoT",
        "published_at": "2023-08-20T22:15:08Z",
        "updated_at": "2023-08-20T22:15:08Z",
        "like_count": 0,
        "text": "Is this a music video?  Why was there music playing all the way through?  Does music in the background make communication clearer or more difficult?  Are you an expert?"
    },
    {
        "author": "Elizabeth Zenner",
        "published_at": "2023-08-20T21:32:49Z",
        "updated_at": "2023-08-20T21:32:49Z",
        "like_count": 1,
        "text": "Another reason why my hat goes off to ppl who learn English as their 2nd, 3rd+ language, especially those whose native language has a completely different script of letters 🫡"
    },
    {
        "author": "Cihloun",
        "published_at": "2023-08-20T21:14:19Z",
        "updated_at": "2023-08-20T21:14:19Z",
        "like_count": 0,
        "text": "At least other people kinda know where your homeland is"
    },
    {
        "author": "Joe Po",
        "published_at": "2023-08-20T21:11:52Z",
        "updated_at": "2023-08-21T13:32:27Z",
        "like_count": 2,
        "text": "I'd say the most distinct thing about languages is how to prononce \"R/р\"-sound. Probably every language has its own \"flavor\" about it."
    },
    {
        "author": "Oleksiy borshchevskyy",
        "published_at": "2023-08-20T20:08:57Z",
        "updated_at": "2023-08-20T20:08:57Z",
        "like_count": 3,
        "text": "My mother tougue is Ukrainian but the language I use most is English as I grew up in Ireland. I find myself sometimes speaking English with an accent out of no where if i haven't spoken it on that particular day. Usually at work due to me working with Ukrainians so I spend most of the day speaking in Ukrianian. Due to this I start trying to speak English as it was Ukrainian. Then stopping myself and quite literally freezing up in my head because I can't speak normally with my Cork Accent. I do not have this issue when I switch over from Polish though most likely due to learning later on when I was older. Now I understand how to explain this issue when it happens."
    },
    {
        "author": "Iona Tsintsadze",
        "published_at": "2023-08-20T19:59:55Z",
        "updated_at": "2023-08-20T19:59:55Z",
        "like_count": 0,
        "text": "Tbilisi, (not Tibilisi). In Georgian (the country) language we have 33 letters and the language is phonetic. Each letter has particular short sound. So funny thing is if you see on a banner written KFC in English next to it you find seven letters in Georgian: KFC - ქეიეფსი"
    },
    {
        "author": "aries fire",
        "published_at": "2023-08-20T18:57:34Z",
        "updated_at": "2023-08-20T18:57:34Z",
        "like_count": 0,
        "text": "HEAVY BRIIIIIIITISSSSSSSSSSSSH MATE !!!!!!!!!!!!!!!! NEW ZEALAND  BE LIKE  ALL ARRROOWWWWWWWWWWWWWWWWWWWWWND ONE  TWWWOOOUUUUU"
    },
    {
        "author": "Harry H.",
        "published_at": "2023-08-20T18:37:50Z",
        "updated_at": "2023-08-20T18:37:50Z",
        "like_count": 4,
        "text": "Breath control is also huge! In English (especially American English) we stereotypically let out one constant stream of air and squeak out several nasally words that run together, but in German, you use all the air in your chest to really vocalize your words, taking pauses and making several glottal stops"
    },
    {
        "author": "Harry H.",
        "published_at": "2023-08-20T18:33:50Z",
        "updated_at": "2023-08-20T18:33:50Z",
        "like_count": 2,
        "text": "Funny how difficult it is for a person to break one’s natural habits… when I was learning German in Germany, our teacher just couldn’t pronounce this Ukrainian girl’s name correctly. She pronounced it “O-len-a”, but our teacher always wanted to say “o-LEN-a”, even though our teacher was fluent in several languages"
    },
    {
        "author": "lolhwaet",
        "published_at": "2023-08-20T17:43:08Z",
        "updated_at": "2023-08-20T17:43:08Z",
        "like_count": 12,
        "text": "I'm American but have almost no noticeable accent when I speak Japanese, because not only do I speak it fluently, but I heard it spoken by native speakers for so long that I internalized what native Japanese is supposed to sound like. This long-term acclimation is the key to having a native accent."
    },
    {
        "author": "Marco",
        "published_at": "2023-08-20T17:16:53Z",
        "updated_at": "2023-08-20T17:16:53Z",
        "like_count": 0,
        "text": "Great video."
    },
    {
        "author": "Jayjack",
        "published_at": "2023-08-20T16:54:28Z",
        "updated_at": "2023-08-20T16:54:28Z",
        "like_count": 66,
        "text": "Summary: Foreign accents exist because people try to speak other languages with the stresses, timings, and intonations (and sometimes grammar) of their own language. Want to sound more like a native speaker quickly? Speak their language like how they try to speak your language. Just keep in mind what dialect of their language they speak. If you want to sound from Paris, don't copy someone from Quebec City, etc."
    },
    {
        "author": "Col0no™",
        "published_at": "2023-08-20T16:46:27Z",
        "updated_at": "2023-08-20T16:46:27Z",
        "like_count": 0,
        "text": "I have a strong german accent despise don't speaking german and having Portuguese as my mother language."
    },
    {
        "author": "qiexia",
        "published_at": "2023-08-20T16:13:45Z",
        "updated_at": "2023-08-20T16:13:45Z",
        "like_count": 2,
        "text": "The written text somehow dominates the mind beyond reason, such that people use their own language's rules for the letter instead of the target language.  For instance, it should be a trivial adjustment for Germans to switch the W and V sounds when speaking English, yet they often still get it wrong after years of fluency"
    },
    {
        "author": "Jaxon Mattox",
        "published_at": "2023-08-20T15:21:00Z",
        "updated_at": "2023-08-20T15:21:00Z",
        "like_count": 5,
        "text": "As a native English speaker who has studied many other languages and speaks Spanish the best of all the languages I've learned, properly rolling my R has been the absolute most difficult thing I've ever tried to accomplish. Despite being able to roll my Rs briefly, I cannot sustain a smooth R roll and when saying words like \"Carro\" it sounds more like \"cardo\" even though I do technically roll my R, I just can't lose the stiff English tongue. Thank goodness for Chinese"
    },
    {
        "author": "TROPICAL TREV",
        "published_at": "2023-08-20T14:16:20Z",
        "updated_at": "2023-08-20T14:16:20Z",
        "like_count": 0,
        "text": "I’m a native Brit and speak 7 languages. I agree partially but I also think there are other considerations."
    },
    {
        "author": "Walter Wilkins",
        "published_at": "2023-08-20T14:03:47Z",
        "updated_at": "2023-08-20T14:03:47Z",
        "like_count": 0,
        "text": "When I think of accents I usually think of external factors like imprinting, exposure to social context and even the musculature of the tongue. But, would it useful to hear a neuroscientist discuss the neural “circuitry” in the posterior superior temporal lobe and if the Wernicke's area and Broca's area manufactures accents?"
    },
    {
        "author": "Sam Murphy",
        "published_at": "2023-08-20T13:29:51Z",
        "updated_at": "2023-08-20T13:29:51Z",
        "like_count": 1,
        "text": "When i speak Czech in my Irish accent just ends up sounding like im making up random noises passing it off as a language. Its strange how different two people can sound speaking the same language but in different accents"
    },
    {
        "author": "mosshark",
        "published_at": "2023-08-20T13:03:45Z",
        "updated_at": "2023-08-20T13:03:45Z",
        "like_count": 0,
        "text": "I make it a point to pronounce correctly ."
    },
    {
        "author": "Afonso Amaro",
        "published_at": "2023-08-20T11:53:02Z",
        "updated_at": "2023-08-20T11:53:02Z",
        "like_count": 0,
        "text": "I learned English when i was 6 so i dont have a weird portuguese accent"
    },
    {
        "author": "Ann Sterzinger",
        "published_at": "2023-08-20T11:51:19Z",
        "updated_at": "2023-08-20T11:51:19Z",
        "like_count": 0,
        "text": "You use different muscles entirely. When I move back and forth between the US and France my face shape noticeably changes."
    },
    {
        "author": "Treinbouwer",
        "published_at": "2023-08-20T11:01:01Z",
        "updated_at": "2023-08-20T11:01:01Z",
        "like_count": 1,
        "text": "Native speakers also have regional accents.😂"
    },
    {
        "author": "A K",
        "published_at": "2023-08-20T10:35:40Z",
        "updated_at": "2023-08-20T10:35:52Z",
        "like_count": 1,
        "text": "It doesn’t need to be a foreign language to have an accent. Australian, British and American English all have distinct accents."
    },
    {
        "author": "Lisa B",
        "published_at": "2023-08-20T10:35:03Z",
        "updated_at": "2023-08-20T10:35:03Z",
        "like_count": 6,
        "text": "Yes yes and yes! This is one thing that I am always paying close attention to. (So far I have learned with varying degrees of fluency English, Spanish, Farsi and now Arabic as a native German-speaker). \nRecently I was speaking Farsi with somone (actually I learned around afghans, hence I speak more Dari) and the amazing thing was that her immediate response was that I am speaking with a Dari accent, which blew my mind. \n\nFor me the most important thing to avoid an accent (not that theres anything wrong with accents per se) is the stress of words combined with proper pronounciation. And here the importance is on listening carefully how people are speaking and repeat.\nWhen taught a new word or sentence, I always repeat them, especially because of the proper stress. And when people correct me, I repeat after them (you can even do it in your head if you're not comfortable saying it out loud). But this makes for decent progress."
    },
    {
        "author": "Mala Row",
        "published_at": "2023-08-20T10:30:13Z",
        "updated_at": "2023-08-20T10:40:26Z",
        "like_count": 4,
        "text": "Just a small mistake when it comes to French, our language doesn't have stress at the end syllable of every word, if there's one i'ts at the end of of a full sentence (and barely noticeable), we might not have lexical stress at all\nThat's mostly why stress is so hard to learn for French speakers, we don't simply have to learn a new stress pattern, we have to learn that stress exist at all, it's a foreign concept to us (except if you're a linguist or really into language), even after a decade of using english almost everyday, I still can't really tell where is the stress in any word, because the concept still feels strange to me"
    },
    {
        "author": "anonglak moonwicha",
        "published_at": "2023-08-20T09:44:36Z",
        "updated_at": "2023-08-20T09:44:36Z",
        "like_count": 178,
        "text": "My Dutch has a slight English accent. (Englsh is my first language)\nMy father once joked that I speak English like a foreigner.\nMy German friends tell me I speak German with a Dutch accent.\nMy French friends tell me I speak French with a Dutch accent.\nMy Thai friends tell me I speak Thai like Thai people. (I'm not entirely convinced)\nMy Spanish friends tell me I speak Spanish like a Peruvian (that's where I learned el Castellano)\nI rarely speak Italian, but I rather suspect it sounds not like an Italian."
    },
    {
        "author": "Learn Thai - Rapid Method",
        "published_at": "2023-08-20T09:24:49Z",
        "updated_at": "2023-08-20T09:24:49Z",
        "like_count": 4,
        "text": "This is not about “accent”, it’s basic pronunciation. I’m working on ways to develop a “native accent” (which of course could be any of a variety of ways of speaking in each language: British plummy Received Pronunciation, Geordie, West Country, Deep South, the many New York accents, Sith Afrikan accent, Australian, etc.).\n\nI think it has more to do with mimickry than pronunciation, and for that one needs to study the comics and impersonators to learn how they do it.:)"
    },
    {
        "author": "Phloneme",
        "published_at": "2023-08-20T09:05:06Z",
        "updated_at": "2023-08-20T09:05:06Z",
        "like_count": 1,
        "text": "\"If stress and rhythm were better taught\"... Easier said than done. At least in a normal school context, many students are not very receptive to phonetics. Most of them just find it boring."
    },
    {
        "author": "Adriana",
        "published_at": "2023-08-20T08:52:41Z",
        "updated_at": "2023-08-20T08:52:41Z",
        "like_count": 0,
        "text": "But I like when people have an accent. It is way more entertaining and bubbly."
    },
    {
        "author": "Bananenmüsli 27",
        "published_at": "2023-08-20T08:20:57Z",
        "updated_at": "2023-08-20T08:22:06Z",
        "like_count": 10,
        "text": "I am German and I'd say I am fluent in English and I could speak with a British, American or even Australian accent, but I choose to keep my German accent, because I feel weird when I try to imitate a native accent because you are picking the distinct sounds of a particular accent that sound weird or unnatural for my German ear and that always feels like I am making fun of other people's language. Even though it might not be a problem for other persons, it's just uncomfortable for me."
    },
    {
        "author": "Viktoria13",
        "published_at": "2023-08-20T08:01:57Z",
        "updated_at": "2023-08-20T08:01:57Z",
        "like_count": 0,
        "text": "So insightful! Thanks! :-)"
    },
    {
        "author": "Materiais de Estudos",
        "published_at": "2023-08-20T07:31:34Z",
        "updated_at": "2023-08-20T07:33:46Z",
        "like_count": 0,
        "text": "He refers to phonemes as if they were the same thing as letters, but they're not. The combinations that he refers to are phoneme combinations, not letter combinations. As spelling doesn't play an important role when it comes to accents, the explanation in the video would make a lot more sense if phonemes had been mentioned (instead of letters). Other than that, great video!"
    },
    {
        "author": "eSKAone",
        "published_at": "2023-08-20T07:01:23Z",
        "updated_at": "2023-08-20T07:01:23Z",
        "like_count": 0,
        "text": "🙂🌌💟"
    },
    {
        "author": "TysonFREE Molemela",
        "published_at": "2023-08-20T06:53:42Z",
        "updated_at": "2023-08-20T06:53:42Z",
        "like_count": 0,
        "text": "Easist way to learn a new accent/language is to make fun of yourself speaking it, coz it'll never sound correct to your ears, but it can be funny and you'll remember.."
    },
    {
        "author": "stischer47",
        "published_at": "2023-08-20T06:39:06Z",
        "updated_at": "2023-08-20T06:39:06Z",
        "like_count": 306,
        "text": "While at a conference in Denmark, I tried to learn some phrases in Danish - primarily \"I don't speak Danish, I speak English\". Everyone said I spoke with a Swedish accent. Thank you \"The Swedish Chef\" from Sesame Street."
    },
    {
        "author": "Marvellous Jacob",
        "published_at": "2023-08-20T06:12:19Z",
        "updated_at": "2023-08-20T06:12:19Z",
        "like_count": 0,
        "text": "people often use the same mouth movements from their native language when speaking another language."
    },
    {
        "author": "Efficiency Gaming",
        "published_at": "2023-08-20T06:03:37Z",
        "updated_at": "2023-08-20T06:03:37Z",
        "like_count": 2,
        "text": "I always believed it had something to do with the speaker applying the rules of their native language to the foreign language they are trying to speak; thus, an English speaker may attempt to pronounce French words as if they were English words.\n\nOne example that always fascinated me is that certain Indian English speakers do not seem to make a distinction between V and W sounds (i.e. saying \"willage\" for village and \"vindow\" for window). The reason for that is because in Hindi, the letter व may be pronounced like either V or W, and Hindi speakers apparently apply that rule to English when they speak it."
    },
    {
        "author": "BeatRoot14",
        "published_at": "2023-08-20T05:22:35Z",
        "updated_at": "2023-08-20T05:22:35Z",
        "like_count": 0,
        "text": "Worst thing of learning another language was getting told you mispronounced words but what if it's my accent. Really knocked my confidence in speakin"
    },
    {
        "author": "sweiland75",
        "published_at": "2023-08-20T05:21:31Z",
        "updated_at": "2023-08-20T05:21:31Z",
        "like_count": 1,
        "text": "In English, Houston is pronounced as House-tin."
    },
    {
        "author": "Ben Santos",
        "published_at": "2023-08-20T04:48:38Z",
        "updated_at": "2023-08-20T04:48:38Z",
        "like_count": 1,
        "text": "I noticed when I hear British speaking Catholics sing Latin hymns or songs you can still hear their British accents. It's the same for Italians that also speak Latin when they sing the same hymns.\n Anyone else notice these small discrepancies?"
    },
    {
        "author": "Gray And Grey",
        "published_at": "2023-08-20T04:48:16Z",
        "updated_at": "2023-08-20T04:48:16Z",
        "like_count": 0,
        "text": "Huh.\n\nSo that's why people assume I'm from everywhere _except_ my country of origin due to my accent. I'm bilingual in English and Spanish, completely fluent in both with what I believe to be a neutral accent in both languages."
    },
    {
        "author": "Albert Wesker 1969",
        "published_at": "2023-08-20T04:35:14Z",
        "updated_at": "2023-08-20T04:35:14Z",
        "like_count": 1,
        "text": "Quite interesting. I've been on both sides of the fence so to speak. I learned both English and Spanish simultaneously so I can switch between both languages with no accent present as when you learn any number of languages from childhood it's the ideal time to soak up all the rules of grammer and pronouciation as a child's mind is like a sponge able to learn multiple languages. Unfortunately it's a short period one has to learn this way. As soon as one reaches school age you're no longer able to learn any other languages without an accent surfacing. I learned French in high school and college. I availed myself of my dual pronunciation in Spanish and English to attempt a closer French pronunciation. I know I must have an accent but I'm uncertain which one of the other two languages is dominant over the other when speaking French."
    },
    {
        "author": "ajs11201",
        "published_at": "2023-08-20T04:34:14Z",
        "updated_at": "2023-08-20T04:34:14Z",
        "like_count": 2,
        "text": "Besides stress and rhythm, there are also elisions in many languages, especially when spoken by natives. Those, too, are seldom taught and difficult to master."
    },
    {
        "author": "Bablu Yadav",
        "published_at": "2023-08-20T04:27:17Z",
        "updated_at": "2023-08-20T04:27:17Z",
        "like_count": 0,
        "text": "Brainwashing news agency ,,fake propaganda fake agenda , brothal house news portal."
    },
    {
        "author": "Sidi",
        "published_at": "2023-08-20T04:20:17Z",
        "updated_at": "2023-08-20T04:20:17Z",
        "like_count": 0,
        "text": "But... Don't people HEAR that they pronounce words differently from natives? Or do they simply not care?\nI speak Russian, English and Hebrew, and I'm told I have no accent. No one worked with me on this.\nJust listen."
    },
    {
        "author": "Schizophrenix",
        "published_at": "2023-08-20T04:15:42Z",
        "updated_at": "2023-08-20T04:15:42Z",
        "like_count": 0,
        "text": "I have a pretty normal accent until internet created molds in my brain where my speech patterns and pronunciation degraded into memespeak.\n\nSanks, Binty Boathouse"
    },
    {
        "author": "just something",
        "published_at": "2023-08-20T03:26:19Z",
        "updated_at": "2023-08-20T03:26:19Z",
        "like_count": 0,
        "text": "Wow"
    },
    {
        "author": "Victor Paes Plinio",
        "published_at": "2023-08-20T03:23:18Z",
        "updated_at": "2023-08-20T03:28:45Z",
        "like_count": 3,
        "text": "In Brazilian Portuguese we don't have syllables that ends on a consonant other than L, M, N, R or S.\n\nIt means that we tend to add a vowel sound to English words that ends on a consonant.\nLike, \"internet\" is often pronounced \\interne tchi\\, where the final T is pronounced as Ti.\n\n\"Facebook \" is often pronounced \\feicibuki\\ sometimes with a hard K in the end, totally different from what a native speaker would expect.\n\nAlso, English has 20 vowels sounds. Portuguese has only 7 or so. It is often difficult to know what is the right way to pronounce something.\n\nOn the other hand Portuguese has nasal sounds that we don't find in English, making it difficult for non native speakers to pronounce words like \"mãe\" (mother), \"pão\" (bread), or \"chão\" (floor).\n\nI love the ideia that we have accents, it is part of our own identity"
    },
    {
        "author": "Arthur Renson",
        "published_at": "2023-08-20T02:53:57Z",
        "updated_at": "2023-08-20T02:53:57Z",
        "like_count": 0,
        "text": "Because you're lazy to do the effort."
    },
    {
        "author": "Freid Leming, Worlds Rootin'est Tootin'est Milkman",
        "published_at": "2023-08-20T02:44:29Z",
        "updated_at": "2023-08-20T02:44:29Z",
        "like_count": 0,
        "text": "That's a spicy a-meatball!"
    },
    {
        "author": "Justin Kelvianto",
        "published_at": "2023-08-20T02:31:09Z",
        "updated_at": "2023-08-20T02:31:09Z",
        "like_count": 2,
        "text": "The way you managed to put a lot of information on 3 minutes video is fascinating to me"
    },
    {
        "author": "K O",
        "published_at": "2023-08-20T01:47:21Z",
        "updated_at": "2023-08-20T01:47:21Z",
        "like_count": 6,
        "text": "Old ESL teacher here.  You forgot that students tend to pick up on the accent of their teacher, I can almost always tell (with more fluent students) if their teacher was American or British.  Except Scots, never heard a student end up with a Scots accent from a Scots teacher.  But I have had students email after arriving in Glasgow for uni, to say, \"I know they are speaking English, but I can't understand a word they are staying.\""
    },
    {
        "author": "Micheal Jones",
        "published_at": "2023-08-20T01:08:59Z",
        "updated_at": "2023-08-20T01:08:59Z",
        "like_count": 7,
        "text": "Ireland has 32 county’s I come from the county of cork and we have at least 6 distinct accents in just one county. I have a polish friend who can travel from Poland to inner city Dublin and on in to the wilds of west cork in one sentence. I love accents it’s so interesting. We have a lot of people from India coming to Ireland st the moment and I’m really excited to hear what this will produce . A Hindu from Kerry or a sheikh from Sligo the possibilities are endless. I could only wish the muppet show was brave enough to produce such puppetry but since they all ready cancelled the Swedish chef I won’t hold my breath. Shame !"
    },
    {
        "author": "RogerWilco",
        "published_at": "2023-08-20T00:31:55Z",
        "updated_at": "2023-08-20T00:31:55Z",
        "like_count": 0,
        "text": "I really don't understand why people cannot listen to themselves.\nI usually notice these things and mimic them when speaking a foreign language.\nI have been mistaken for a native speaker in several languages sometimes surprising people that it is not my native language after more than a year of daily interaction."
    },
    {
        "author": "J H",
        "published_at": "2023-08-19T23:32:16Z",
        "updated_at": "2023-08-19T23:32:16Z",
        "like_count": 0,
        "text": "I have a really accurate German accent but I’ve forgotten most of my vocab so natives think I’m a bit slow until they realise I’m just foreign."
    },
    {
        "author": "Elaine Ng",
        "published_at": "2023-08-19T23:10:35Z",
        "updated_at": "2023-08-19T23:10:35Z",
        "like_count": 0,
        "text": "Quite true"
    },
    {
        "author": "David Graham",
        "published_at": "2023-08-19T22:50:09Z",
        "updated_at": "2023-08-19T22:50:09Z",
        "like_count": 0,
        "text": "I told mrs winchester that english and beyond was not my first language but then jake came in and bully"
    },
    {
        "author": "Leonardo Menezes",
        "published_at": "2023-08-19T22:34:38Z",
        "updated_at": "2023-08-19T22:34:38Z",
        "like_count": 0,
        "text": "I speak  Brazilian Portuguese (syllable-timed), and sometimes I find easier to understand Castilian than European Portuguese (stressed-timed)."
    },
    {
        "author": "kumar pal",
        "published_at": "2023-08-19T22:31:32Z",
        "updated_at": "2023-08-19T22:31:32Z",
        "like_count": 0,
        "text": "ANGLO SAXON KKK"
    },
    {
        "author": "kumar pal",
        "published_at": "2023-08-19T22:31:11Z",
        "updated_at": "2023-08-19T22:31:11Z",
        "like_count": 0,
        "text": "YOU KKK"
    },
    {
        "author": "kumar pal",
        "published_at": "2023-08-19T22:30:58Z",
        "updated_at": "2023-08-19T22:30:58Z",
        "like_count": 0,
        "text": "KKK"
    },
    {
        "author": "Jose Luis P. C. Rocha",
        "published_at": "2023-08-19T22:02:20Z",
        "updated_at": "2023-08-19T22:02:20Z",
        "like_count": 0,
        "text": "actualy you have a accent in your own language as well"
    },
    {
        "author": "Tuquynh Nx",
        "published_at": "2023-08-19T20:47:53Z",
        "updated_at": "2023-08-19T20:47:53Z",
        "like_count": 0,
        "text": "I dont have an accent when I speak another language though"
    },
    {
        "author": "Feynstein 100",
        "published_at": "2023-08-19T20:46:21Z",
        "updated_at": "2023-08-19T20:46:21Z",
        "like_count": 5,
        "text": "Interesting. I always thought it had to do with phonemes being pronounced differently. The same way that visually, we are able to distinguish different fonts. I think perfectly replicating a native accent is a Herculean task. It might be more labor-effective to get just close enough 😅"
    },
    {
        "author": "Bill Bob",
        "published_at": "2023-08-19T20:42:39Z",
        "updated_at": "2023-08-19T20:42:39Z",
        "like_count": 2,
        "text": "This worst accent is Pakistani and Indian English accents. They sound like they have marbles in their mouths and each pronunciation sounds like they are trying to sing a tune in an off key."
    },
    {
        "author": "Milanche",
        "published_at": "2023-08-19T20:36:06Z",
        "updated_at": "2023-08-19T20:36:06Z",
        "like_count": 0,
        "text": "no i don't"
    },
    {
        "author": "Prabhdeep Dhahan",
        "published_at": "2023-08-19T20:16:16Z",
        "updated_at": "2023-08-19T20:16:16Z",
        "like_count": 1,
        "text": "The Economist is _par excellence_ !"
    },
    {
        "author": "AEG",
        "published_at": "2023-08-19T20:14:31Z",
        "updated_at": "2023-08-19T20:14:31Z",
        "like_count": 1,
        "text": "The headline isn't very accurate. People have a certain manner of speaking, or an 'accent' in any language, i.e. in the first language too.😃"
    },
    {
        "author": "Nathan A.",
        "published_at": "2023-08-19T20:06:33Z",
        "updated_at": "2023-08-19T20:06:33Z",
        "like_count": 1,
        "text": "there is no such thing as not having an accent"
    },
    {
        "author": "ronaldonmg",
        "published_at": "2023-08-19T19:53:25Z",
        "updated_at": "2023-08-19T19:53:25Z",
        "like_count": 6,
        "text": "I'm missing two crucial factors in this video\n\n1 your speechmuscles are trained to pronounce certain sounds - even in your native language(s)\n\n2 if you don't hear languages as an infant, you can lose the ability to hear that some letters are different. That's why some Anglo's have trouble distinguishing french \"vous\" from \"vue\" , or think that spanish J sounds like H  - or how some Asians have trouble with R/L,  B/P,  K/G..."
    },
    {
        "author": "prasanna kumar reddy",
        "published_at": "2023-08-19T19:43:11Z",
        "updated_at": "2023-08-19T19:43:11Z",
        "like_count": 0,
        "text": "why is it hard to earn new listeners for our lies and foreign policy ??"
    },
    {
        "author": "Byron Williams",
        "published_at": "2023-08-19T19:39:43Z",
        "updated_at": "2023-08-19T19:39:43Z",
        "like_count": 0,
        "text": "Phonemes and Prosody."
    },
    {
        "author": "Maxime Guiv",
        "published_at": "2023-08-19T19:30:53Z",
        "updated_at": "2023-08-19T19:30:53Z",
        "like_count": 1,
        "text": "En France aussi personne ne dit /mba-pé/ mais /èm-ba-pé/."
    },
    {
        "author": "GyanPrakash",
        "published_at": "2023-08-19T18:40:06Z",
        "updated_at": "2023-08-19T18:40:06Z",
        "like_count": 1,
        "text": "Remember there’s no UNIVERSAL way to speak a Language, thus Accents 😊"
    },
    {
        "author": "Aurobindo Ghosh",
        "published_at": "2023-08-19T18:33:45Z",
        "updated_at": "2023-08-19T18:33:45Z",
        "like_count": 0,
        "text": "why? recalling previous birth"
    },
    {
        "author": "Beatriz Careaga",
        "published_at": "2023-08-19T18:28:18Z",
        "updated_at": "2023-08-19T18:28:18Z",
        "like_count": 0,
        "text": "Fun creative way of learn about every language."
    },
    {
        "author": "Gali",
        "published_at": "2023-08-19T17:24:28Z",
        "updated_at": "2023-08-19T17:24:28Z",
        "like_count": 0,
        "text": "Thank you for that one!"
    },
    {
        "author": "Abheeshek Dev Roye",
        "published_at": "2023-08-19T17:20:09Z",
        "updated_at": "2023-08-19T17:20:09Z",
        "like_count": 0,
        "text": "Try explaining the impact of colonialism."
    },
    {
        "author": "NightOwl_30",
        "published_at": "2023-08-19T17:01:04Z",
        "updated_at": "2023-08-19T17:01:04Z",
        "like_count": 0,
        "text": "French people need to watch this and get over themselves."
    },
    {
        "author": "Gr3nadgr3gory",
        "published_at": "2023-08-19T16:53:00Z",
        "updated_at": "2023-08-19T16:53:00Z",
        "like_count": 0,
        "text": "Im from ohio, so my accent is as neutral as it can get. If i start speaking in another language, i quickly take their accent."
    },
    {
        "author": "Cobalt059",
        "published_at": "2023-08-19T16:50:27Z",
        "updated_at": "2023-08-19T16:50:27Z",
        "like_count": 0,
        "text": "1:48 The idea that French is stressed on each word's the last syllable is a myth, spread by terrible French teachers who probably haven't spoken to any French person in their whole life. French has no lexical stress. Which is why non-fluent French people speaking English sound \"monotone\": the concept of \"stress\" doesn't exist in their language so they ignore it. Same reason English-speaking people misgender every noun in French: the concept of gendered nouns doesn't exist in their language so they just ignore it and use random pronouns."
    },
    {
        "author": "Sba3malik",
        "published_at": "2023-08-19T16:48:32Z",
        "updated_at": "2023-08-19T16:48:32Z",
        "like_count": 1,
        "text": "I'm an Azeri speaker. I can also speak Russian. But Russians don't like our accents, they hate us😁"
    },
    {
        "author": "E DVG",
        "published_at": "2023-08-19T16:09:09Z",
        "updated_at": "2023-08-19T16:09:09Z",
        "like_count": 2,
        "text": "I’m glad to see this in a mainstream channel.  Though I expected a theory on psychology of identity…\nYes, language teachers don’t teach pronunciation because they’re not taught how phonology works, but why do even properly taught language learners sometimes resist adopting a new accent? No time to get into that, but here are reasons you should try: Having a better accent helps with intelligibility (a huge asset), shows respect for your interlocutors (speakers of that language), and makes you seem talented and smarter to them. To prove this point, simply apply all said above to your impressions of foreign speakers of English who speak near-native sounding English. Finally, accents don’t have to be perfect to be intelligible, respectful of the FL & its speakers, and to make you seem smarter…just try."
    },
    {
        "author": "abi official2019",
        "published_at": "2023-08-19T16:06:00Z",
        "updated_at": "2023-08-19T16:06:00Z",
        "like_count": 2,
        "text": "Thank you, Colin Firth."
    },
    {
        "author": "SynthRockViking",
        "published_at": "2023-08-19T15:52:35Z",
        "updated_at": "2023-08-19T15:52:35Z",
        "like_count": 1,
        "text": "I Could choose, to immitate your “official” accent, easily\nProblem is, I feel cringe af doing it, and it’s really not worth it\nI’ll rather keep the little me I have left, rather than accommodate your preferences"
    },
    {
        "author": "Leo",
        "published_at": "2023-08-19T15:42:00Z",
        "updated_at": "2023-08-19T15:42:00Z",
        "like_count": 1,
        "text": "In Japanese double consonants are not a thing. Hence, Doragon Bōru 😂"
    },
    {
        "author": "旧名A B 新名kamiyama-chairdesklamp",
        "published_at": "2023-08-19T15:22:34Z",
        "updated_at": "2023-08-19T15:22:34Z",
        "like_count": 7,
        "text": "Native Japanese speaker; English is my third language. I was hoping you'd go into why people can speak a nonnative language for a long time and *still* have trouble with the pronunciation like the intro seemed to promise."
    },
    {
        "author": "Ted Bomba",
        "published_at": "2023-08-19T14:34:33Z",
        "updated_at": "2023-08-19T14:34:33Z",
        "like_count": 2193,
        "text": "I had four years of intensive training in both written and spoken French and was considered to speak it on a near native level. When I joined the military my first tour of duty was, of course, Germany. I took several crash courses in spoken German so that I could travel around the country without a language barrier. As I traveled I was often teased that I was the first American they had ever met who spoke German like a native Frenchman. It was a wonderful ice breaker wherever I traveled !"
    },
    {
        "author": "tabby73",
        "published_at": "2023-08-19T14:32:33Z",
        "updated_at": "2023-08-19T14:32:33Z",
        "like_count": 0,
        "text": "Surprised you didn't mention the glottal stop."
    },
    {
        "author": "idiot321321321 idiot",
        "published_at": "2023-08-19T14:30:32Z",
        "updated_at": "2023-08-19T14:30:32Z",
        "like_count": 0,
        "text": "I have a Singaporean accent even when speaking my native language, English. 😆"
    },
    {
        "author": "JBU",
        "published_at": "2023-08-19T14:30:30Z",
        "updated_at": "2023-08-19T14:30:30Z",
        "like_count": 0,
        "text": "The Bottle Of Water, with a different accent, say: \nE Bo Oh Eh Wo Ah\nE Bo Ouh Eh Wo Ah\nE Bo Ouu O Wo Caa\nDe Boutel Ouf Vuatah\nDe Boteh Oh Wotah\nDe Botae Of Wodah\net.c"
    },
    {
        "author": "indian",
        "published_at": "2023-08-19T14:11:38Z",
        "updated_at": "2023-08-19T14:11:47Z",
        "like_count": 0,
        "text": "Most biased news channel. Only covers what western ears love to hear. For instance it conveniently hides problem of abortion in western world or just do a small story. But what can you expect from Low diversity news channels"
    },
    {
        "author": "Ich bin genug",
        "published_at": "2023-08-19T14:10:47Z",
        "updated_at": "2023-08-19T14:10:47Z",
        "like_count": 0,
        "text": "Interesting, but the kindergarden music makes it painful to follow."
    },
    {
        "author": "Patrick Tam",
        "published_at": "2023-08-19T13:07:25Z",
        "updated_at": "2023-08-19T13:07:25Z",
        "like_count": 0,
        "text": "I would have liked to hear him try to speak Cantonese.  Lol"
    },
    {
        "author": "Potato Face",
        "published_at": "2023-08-19T13:03:18Z",
        "updated_at": "2023-08-19T13:03:18Z",
        "like_count": 2,
        "text": "This is delightful 😊"
    },
    {
        "author": "Pierre de Cœur",
        "published_at": "2023-08-19T12:23:23Z",
        "updated_at": "2023-08-19T12:23:23Z",
        "like_count": 3,
        "text": "You also can have a local accent in a foreign language if you integrate and use it long enough.  For instance, despite being French my mother language, I speak Spanish with an accent of Seville, which is where I learned it when I was 18. In English, however, I have no specific recognizable accent, as I learned it in many different places."
    },
    {
        "author": "Francisco",
        "published_at": "2023-08-19T12:23:12Z",
        "updated_at": "2023-08-19T12:23:12Z",
        "like_count": 1,
        "text": "That is much easier said than done, monsieur. 🤣"
    },
    {
        "author": "Fire Boss _z2z_",
        "published_at": "2023-08-19T12:10:43Z",
        "updated_at": "2023-08-19T12:10:43Z",
        "like_count": 0,
        "text": "I am the type of person who can listen to different languages’ pronunciation correctly, that way I learned the difference between French and German, Russian from Polish, Indonesian from Malaysian but don’t know what they’re actually saying"
    },
    {
        "author": "Ab Ab",
        "published_at": "2023-08-19T12:09:29Z",
        "updated_at": "2023-08-19T12:09:29Z",
        "like_count": 4,
        "text": "There's nothing wrong with speaking with an accent. I find it makes people more interesting"
    },
    {
        "author": "Purple Broadcast",
        "published_at": "2023-08-19T12:00:21Z",
        "updated_at": "2023-08-19T12:00:21Z",
        "like_count": 0,
        "text": "2:48 why get rid of people's accents"
    },
    {
        "author": "Nunya Business",
        "published_at": "2023-08-19T11:59:06Z",
        "updated_at": "2023-08-19T11:59:06Z",
        "like_count": 0,
        "text": "You have an accent in a foreign language so that you sound more sexually attractive when you flirt. Its a natural quirk of human evolution!"
    },
    {
        "author": "Francisco Polatscheck",
        "published_at": "2023-08-19T11:40:36Z",
        "updated_at": "2023-08-19T11:40:36Z",
        "like_count": 0,
        "text": "Excellent explanation. But you skipped the issue of intonation."
    },
    {
        "author": "Dimityr Petrov",
        "published_at": "2023-08-19T11:33:40Z",
        "updated_at": "2023-08-19T11:33:40Z",
        "like_count": 0,
        "text": "Accent is totalling fine 🫶🏻 i love pakistani/Indian accent theyr talking so funny especially on the phone"
    },
    {
        "author": "Perpetually_Biased",
        "published_at": "2023-08-19T11:22:16Z",
        "updated_at": "2023-08-19T11:22:16Z",
        "like_count": 0,
        "text": "very interesting video. thank you"
    },
    {
        "author": "raafje",
        "published_at": "2023-08-19T10:27:13Z",
        "updated_at": "2023-08-19T10:27:13Z",
        "like_count": 5,
        "text": "Really wish I could remove my accent completely. Most of my friends from England really despise the way I speak as it's unintelligible, but Americans seem to have no issue with it. Like, it's not that my English proficiency is terrible... it's just that I'd love to speak it as well as native speakers out of respect for their native language."
    },
    {
        "author": "A Lesson",
        "published_at": "2023-08-19T08:54:31Z",
        "updated_at": "2023-08-19T08:54:31Z",
        "like_count": 2,
        "text": "Stop attacking Indian media Firstpost. Firstpost has more credibility then you will even have."
    },
    {
        "author": "Nik Mohamed",
        "published_at": "2023-08-19T08:24:02Z",
        "updated_at": "2023-08-19T08:24:02Z",
        "like_count": 15,
        "text": "I think most accent sound comes from the position of the tongue. If anyone wants to drastically reduce their accent, they need to study the *vowel position of tongue* of a language. It's way more significant factor influencing accents in non-native language. For example, for American English, the tongue has to be as flat to the bottom of the mouth as possible, whereas for British English,  the back of the tongue needs to arch up"
    },
    {
        "author": "Big Scary Steve",
        "published_at": "2023-08-19T08:22:34Z",
        "updated_at": "2023-08-19T08:22:34Z",
        "like_count": 0,
        "text": "Phonotactics."
    },
    {
        "author": "Fred Bear",
        "published_at": "2023-08-19T07:42:09Z",
        "updated_at": "2023-08-19T07:42:09Z",
        "like_count": 1,
        "text": "Syllables in Italian words equally stressed? I don’t think so. Try saying \"Italia è grande\" and see if there is any equal stress there"
    },
    {
        "author": "tanjong malim",
        "published_at": "2023-08-19T07:26:51Z",
        "updated_at": "2023-08-19T07:26:51Z",
        "like_count": 0,
        "text": "Very very concise presentation ! Bravo 👏"
    },
    {
        "author": "DevilsVendettas",
        "published_at": "2023-08-19T07:18:52Z",
        "updated_at": "2023-08-19T07:18:52Z",
        "like_count": 0,
        "text": "more wierd is how the first half of this video has much lower audio and then gets loud and quieter seems like an accent I guess lol"
    },
    {
        "author": "The Frumious Bandersnatch",
        "published_at": "2023-08-19T07:18:13Z",
        "updated_at": "2023-08-19T07:18:13Z",
        "like_count": 25,
        "text": "I am a native English speaker. I was fluent in French and Spanish, though losing now through lack of use. \n\nWhen in France, native French speakers assumed that I was also, because I naturally pick up the accents of native speakers. \n\nAlthough I have a distinct Madrilenian accent when speaking Spanish, I have, outside Spain been asked if I was Argentinian. However, Spaniards outside Madrid usually assumed that I was from the capital.\n\nEven in languages where I can only make myself understood, Dutch, German, Italian, and Welsh, I take on the accent. Sometimes this is not helpful though. People assume that I know more of their language than I do.\n\nThe only other time that I have problems is when the same occurs with English accents. I find myself using the same accent as the person that I'm talking to in lots of cases. Even though that person rarely notices, I have been criticised for mimicking by those who have overheard me. I am not, I just pick up the subtle clues naturally, and without thinking adjust my speech pattern."
    },
    {
        "author": "James Hudson",
        "published_at": "2023-08-19T06:55:23Z",
        "updated_at": "2023-08-19T06:55:23Z",
        "like_count": 0,
        "text": "that's why his proper name in spanish is: estephen espielberg."
    },
    {
        "author": "V",
        "published_at": "2023-08-19T06:21:09Z",
        "updated_at": "2023-08-19T06:21:09Z",
        "like_count": 0,
        "text": "Very interesting!   How can an English accent sound like a Thai 😊"
    },
    {
        "author": "Eng Choon TAN",
        "published_at": "2023-08-19T06:20:35Z",
        "updated_at": "2023-08-19T06:20:35Z",
        "like_count": 0,
        "text": "Plus-one on the existing conmen for the scammers to go back to school because their hatchmen learnt the plus-one"
    },
    {
        "author": "ৰোহণ Rohan",
        "published_at": "2023-08-19T06:17:03Z",
        "updated_at": "2023-08-19T06:17:03Z",
        "like_count": 4,
        "text": "A very well made linguistic video ❤❤"
    },
    {
        "author": "Zethuz",
        "published_at": "2023-08-19T06:16:48Z",
        "updated_at": "2023-08-19T06:16:48Z",
        "like_count": 0,
        "text": "What an utterly pointless video. Don't you have other more important topics to cover??"
    },
    {
        "author": "No Suffix",
        "published_at": "2023-08-19T05:03:26Z",
        "updated_at": "2023-08-19T05:03:26Z",
        "like_count": 0,
        "text": "Short & sweet!"
    },
    {
        "author": "Rudraksh",
        "published_at": "2023-08-19T04:23:56Z",
        "updated_at": "2023-08-19T04:23:56Z",
        "like_count": 0,
        "text": "Priyanka Chopra liked this video."
    },
    {
        "author": "Dave Bacon USA",
        "published_at": "2023-08-19T03:34:23Z",
        "updated_at": "2023-08-19T03:34:23Z",
        "like_count": 2,
        "text": "Now I want to hear Arnold Schwarzenegger minimize his Austrian accent and really try an american accent."
    },
    {
        "author": "Cássio Amorim",
        "published_at": "2023-08-19T02:12:20Z",
        "updated_at": "2023-08-19T02:12:20Z",
        "like_count": 8,
        "text": "Curious. I'm a native Portuguese speaker, but the languages I use the most are English and Japanese. Yet, I do notice I have an accent, although most people tell me it's mild, it is definitely there, specially in English. I thought the main reason for me was the difference in consonants, but now that I heard about this rhythm it got me wondering. I kinda feel my English got weirder after years living in Japan, and rhythm might be just the explanation, now that I think about it."
    },
    {
        "author": "Eine Geschichte Deutschlands",
        "published_at": "2023-08-19T01:09:28Z",
        "updated_at": "2023-08-19T01:09:28Z",
        "like_count": 0,
        "text": "2:10 that, looks interesting, . . .."
    },
    {
        "author": "Doctor Euge",
        "published_at": "2023-08-18T23:52:41Z",
        "updated_at": "2023-08-18T23:52:41Z",
        "like_count": 0,
        "text": "Every body has an accent and English is not the “World Language “ contrary to what monolingual English speakers would wish and like you to believe! Don’t believe these arrogant Anglo-globalists and don’t believe people who want you to speak with “their” accent, using “their” words. Use international Middle English as common language but keep your own languages, cultures and religions, you don’t need to use theirs."
    },
    {
        "author": "Jerry Filop",
        "published_at": "2023-08-18T22:37:22Z",
        "updated_at": "2023-08-18T22:37:22Z",
        "like_count": 0,
        "text": "Thanks! captain obvious."
    },
    {
        "author": "Rob Malford",
        "published_at": "2023-08-18T22:32:24Z",
        "updated_at": "2023-08-18T22:32:24Z",
        "like_count": 1,
        "text": "Because you're lazy and think that everyone should accommodate you."
    },
    {
        "author": "The Swarm",
        "published_at": "2023-08-18T22:25:44Z",
        "updated_at": "2023-08-18T22:25:44Z",
        "like_count": 40,
        "text": "That was fun!  Wish it was longer and more in depth. I'm sure different languages have their own idiosyncrasies beyond the few you mentioned here.  Even this superficial understanding would be of benefit for people seeking to understand more about other cultures.  This would be of benefit to the WORLD!"
    },
    {
        "author": "Danny Maurice",
        "published_at": "2023-08-18T22:21:17Z",
        "updated_at": "2023-08-18T22:21:17Z",
        "like_count": 0,
        "text": "This video has my brain strewn across the walls."
    },
    {
        "author": "Gal Meytes",
        "published_at": "2023-08-18T22:04:57Z",
        "updated_at": "2023-08-18T22:04:57Z",
        "like_count": 2,
        "text": "I would like to say that many times by trying to come out with the most authentic accent we speak with a forced accent that usually also sounds off. One way to fix it is to speak as freely as possible, quickly enough our mouths will find the easiest way to pronounce vowels in the foreign language, thus making us seem more fluent. Imagine a native speaker of a language, you don't see him over punctuating a syllable to sound right, they just do so by speaking in a lazy manner."
    },
    {
        "author": "Patrick Hyde",
        "published_at": "2023-08-18T21:35:29Z",
        "updated_at": "2023-08-18T21:35:29Z",
        "like_count": 3,
        "text": "This is why one month old babies learn languages better than intelligent adults. The baby knows the importance of \"picking up\" and mastering the sound and the sounds of a language BEFORE you understand what the sounds mean. Intelligent adults try to learn the \"meaning\" of words and sounds before they understand the more important aspect of repeating the sounds and putting them together phonetically. It is IMPOSSIBLE for someone to learn a language by reading it first. Put the book down and listen for months and repeat and copy. There is no tl in \"apostle\" and ther is no \"l\" in salmon. There is no sign for a liason in written french. There is no written sign for word or sound groupings in French or Spanish, \"Tu a\" is \"ta\" and \"Va a ir\" is vair. Put the book down and listen. You can learn to spell the language later."
    },
    {
        "author": "Mario87456",
        "published_at": "2023-08-18T21:24:10Z",
        "updated_at": "2023-08-18T21:24:10Z",
        "like_count": 0,
        "text": "I pronounce all French words as if they are English especially since they really should have their pronunciation changed to fit English better."
    },
    {
        "author": "quasa sawds",
        "published_at": "2023-08-18T21:13:16Z",
        "updated_at": "2023-08-18T21:13:16Z",
        "like_count": 0,
        "text": "I am Russian native speaker, and some people say that  I have a strange pronunciation)))"
    },
    {
        "author": "SIC",
        "published_at": "2023-08-18T20:52:22Z",
        "updated_at": "2023-08-18T20:52:37Z",
        "like_count": 0,
        "text": "And that is why Danish King Knud became Canute in English. It is pronounced:\nKn - no vowel between them\nu -  as oo in soon\nd - a soft th sound\n= Knooth"
    },
    {
        "author": "JEK",
        "published_at": "2023-08-18T20:23:20Z",
        "updated_at": "2023-08-18T20:23:20Z",
        "like_count": 0,
        "text": "but what is the solution?"
    },
    {
        "author": "Abaddon",
        "published_at": "2023-08-18T20:18:05Z",
        "updated_at": "2023-08-18T20:18:05Z",
        "like_count": 2,
        "text": "I have never encountered a foreigner speaking danish without an accent. Even foreigners who have lived here in decades, still have an accent."
    },
    {
        "author": "cnl1213",
        "published_at": "2023-08-18T19:48:25Z",
        "updated_at": "2023-08-18T19:48:25Z",
        "like_count": 0,
        "text": "If I have an accent speaking every language, does that mean I have no accent speaking any language?"
    },
    {
        "author": "JAPONGO",
        "published_at": "2023-08-18T19:32:20Z",
        "updated_at": "2023-08-18T19:32:20Z",
        "like_count": 2,
        "text": "As a native French speaker (of roughly the \"standard\" Parisian-originated accent), I find it always quite odd that the French accentuation is still taught to second language learners as being on the last syllable of the word. \n\nI am trained in English and Japanese, languages with stress and pitch accents, and my ears just don't hear that. As I feel it (and I definitely need to dive deeper into the studies on the matter), accent within French words - at least when they are pronounced in isolation - is on the first syllable, not the last. It probably used to be the case and surely still is for some speakers or varieties of French, but not in the most spoken version of it. \n\nPlease correct me if I'm being completely wrong here."
    },
    {
        "author": "MR",
        "published_at": "2023-08-18T18:58:26Z",
        "updated_at": "2023-08-18T18:58:26Z",
        "like_count": 2,
        "text": "Native English speaker (American English), here… former Spanish and French linguist.  Learned Spanish years and years before French. When I speak French, I’m told I speak with a Spanish accent and people don’t’ initially know I’m from the US."
    },
    {
        "author": "Virendrasinh Bhosale",
        "published_at": "2023-08-18T18:51:12Z",
        "updated_at": "2023-08-18T18:51:12Z",
        "like_count": 0,
        "text": "Shut down Economist . Biased n paid media"
    },
    {
        "author": "rudolphValentino",
        "published_at": "2023-08-18T18:50:37Z",
        "updated_at": "2023-08-18T18:50:37Z",
        "like_count": 0,
        "text": "this is helpful, thank you 😸"
    },
    {
        "author": "Yaban Namba",
        "published_at": "2023-08-18T18:35:18Z",
        "updated_at": "2023-08-18T18:35:18Z",
        "like_count": 0,
        "text": "I don't believe in jewish science."
    },
    {
        "author": "Nicolas M.",
        "published_at": "2023-08-18T18:30:24Z",
        "updated_at": "2023-08-18T18:30:24Z",
        "like_count": 36,
        "text": "There was way more information in this short 3-min video than I was expecting."
    },
    {
        "author": "tbip2001",
        "published_at": "2023-08-18T18:21:00Z",
        "updated_at": "2023-08-18T18:21:00Z",
        "like_count": 0,
        "text": "Interesting, I’m not sure it explains Arnold accent though. He doesnt seem to have softened it at all over the years"
    },
    {
        "author": "¡¡ Arko !!",
        "published_at": "2023-08-18T18:11:19Z",
        "updated_at": "2023-08-18T18:11:19Z",
        "like_count": 632,
        "text": "Stress pattern is one of the most important aspect of an accent. I have been living in the US for 5 years now, and the stress patterns were the last thing I managed to adapt to sound kinda American. It is so important that if you do the pronunciations right but don’t get the stress & pitch right, you will never sound perfect. On the flipside, if you get the stress/pitch right and pronounce a few words the non-traditional way, you will still sound very perfect."
    },
    {
        "author": "E B.",
        "published_at": "2023-08-18T18:09:22Z",
        "updated_at": "2023-08-18T18:09:22Z",
        "like_count": 0,
        "text": "yay Cantonese"
    },
    {
        "author": "Michael Deierhoi",
        "published_at": "2023-08-18T17:59:35Z",
        "updated_at": "2023-08-18T17:59:35Z",
        "like_count": 3,
        "text": "That was both amusing and insightful!!"
    },
    {
        "author": "Amuzic",
        "published_at": "2023-08-18T17:58:17Z",
        "updated_at": "2023-08-18T17:58:17Z",
        "like_count": 39,
        "text": "I am a native bengali speaker from India, and even though Bengali is an Indo European language, like all other North Indian languages(Hindi, Punjabi etc), it's pronounciations of words are completely different from those languages even though most words are just the same, so the Schwa sound is not there in Bengali which is replaced with Awe sound(as in awesome) and other languages that are in Eastern part of India and the reason is the influence of sino tibetan languages(which are prevalent in north eastern regions). So, Assamese is east to Bengal and has even though it's very similar to bengali it has more sino tibetan influence, On the other hand Odia which is south of Bengal has more dravidic influence even though it's similar to Bengali. The equivalence can be found in Hindi sister languages such as Nepali which is somewhere between Hindi and Bengali and have both the schwa sound and the Awe sound. Now, if you consider the bengali language of Bangladesh, the accent has more austro asiatic influence...and you go further east towards Sylhette, Tripura and Chitagong, in addition to the austro asiatic, you also get additional sino tibetan influence and even though it's bengali, it becomes completely unintelligible. So, aforementioned Assamese or Odia is more intelligible to a Bengali speaker of Indian Bengal than the Bengali speaker of Syllhette, Tripura and Chitagong..."
    },
    {
        "author": "Leberteich",
        "published_at": "2023-08-18T17:53:32Z",
        "updated_at": "2023-08-18T17:53:32Z",
        "like_count": 1,
        "text": "'To have success in Hollywood, you need to do two things: Lose that accent and change your name' (An acting agent's advice to Arnold Schwarzenegger)."
    },
    {
        "author": "Amuzic",
        "published_at": "2023-08-18T17:45:31Z",
        "updated_at": "2023-08-18T17:45:31Z",
        "like_count": 0,
        "text": "Wow.."
    },
    {
        "author": "robert robert",
        "published_at": "2023-08-18T17:43:11Z",
        "updated_at": "2023-08-18T17:43:11Z",
        "like_count": 123,
        "text": "I am an American Mid Atlantic English speaker who took German language classes from middle school thru college.  I have also watched 60 years worth of WW2 movies with German actors speaking English and German.  When I flew back to the USA via Lufthansa, I only spoke a few polite words to the Attendant  in German.  She thought I was a German national and gave me the incorrect US Customs Questionaire to fill out.  Ich bin ein Amerikaner."
    },
    {
        "author": "Ray Dawson",
        "published_at": "2023-08-18T17:43:09Z",
        "updated_at": "2023-08-18T17:43:09Z",
        "like_count": 1,
        "text": "It also depends on your teacher and where they come from."
    },
    {
        "author": "MegaSquiff",
        "published_at": "2023-08-18T17:38:17Z",
        "updated_at": "2023-08-18T17:38:17Z",
        "like_count": 0,
        "text": "Excellente…!"
    },
    {
        "author": "Mariusz Kozłowski",
        "published_at": "2023-08-18T17:30:02Z",
        "updated_at": "2023-08-18T17:30:02Z",
        "like_count": 0,
        "text": "Some people have an ability to loose accent and some will not be able to do it in their lifetime."
    },
    {
        "author": "Wolfie",
        "published_at": "2023-08-18T17:29:29Z",
        "updated_at": "2023-08-18T17:29:29Z",
        "like_count": 0,
        "text": "I have an accent where I live but when I talk to people back home they say I have an accent! 😭"
    },
    {
        "author": "HotelPapa100",
        "published_at": "2023-08-18T17:25:30Z",
        "updated_at": "2023-08-18T17:26:34Z",
        "like_count": 3,
        "text": "You also have an accent when you speak your own language. It may be the most standard and accepted in your culture, but it's still an accent\nRegarding the Mbapé thing: you even do this with your own historic figures: Case in point: Knut..."
    },
    {
        "author": "Shoaib",
        "published_at": "2023-08-18T17:24:46Z",
        "updated_at": "2023-08-18T17:24:46Z",
        "like_count": 0,
        "text": "Wow! that was succinct."
    },
    {
        "author": "Andrew",
        "published_at": "2023-08-18T17:20:19Z",
        "updated_at": "2023-08-18T17:20:19Z",
        "like_count": 0,
        "text": "This is common sense"
    },
    {
        "author": "Luis YL",
        "published_at": "2023-08-18T17:19:50Z",
        "updated_at": "2023-08-18T17:19:50Z",
        "like_count": 6,
        "text": "Native speaker should appreciate the effort others for learning & using your language"
    },
    {
        "author": "akdvjb;vfbv#8ajeifv]vwrv",
        "published_at": "2023-08-18T16:51:14Z",
        "updated_at": "2023-08-18T16:51:14Z",
        "like_count": 0,
        "text": "So many want to learn English yet can't even get the #1 most common word right,  'the'.  All you have to do is put your tongue between your teeth.  If you're saying 'zee' then your tongue is NOT between your teeth."
    },
    {
        "author": "Rami Yazje",
        "published_at": "2023-08-18T16:42:44Z",
        "updated_at": "2023-08-18T16:42:44Z",
        "like_count": 1,
        "text": "Super cool video"
    },
    {
        "author": "El Proctólogo",
        "published_at": "2023-08-18T16:13:54Z",
        "updated_at": "2023-08-18T16:13:54Z",
        "like_count": 0,
        "text": "Because\nتشلنا عليه"
    },
    {
        "author": "Vineet Kansotia",
        "published_at": "2023-08-18T14:44:40Z",
        "updated_at": "2023-08-18T14:45:43Z",
        "like_count": 2,
        "text": "The algorithm has blown me away by suggesting this video. Nice going, mister algorithm."
    },
    {
        "author": "Steven Schilizzi",
        "published_at": "2023-08-18T14:18:15Z",
        "updated_at": "2023-08-18T14:18:15Z",
        "like_count": 74,
        "text": "Very true! And it’s rarely taught in language courses, let alone in schools. It’d be great to have more of these videos on specifics for different languages, at least for native English speakers. Cheers!"
    },
    {
        "author": "Ayyash Ayyash",
        "published_at": "2023-08-18T13:50:00Z",
        "updated_at": "2023-08-18T13:50:00Z",
        "like_count": 0,
        "text": "i always forgive Arabs when they go ekisuse me or eksi-use me, because i know Arabic does not allow consecutive silents but it's still funny to hear 😅"
    },
    {
        "author": "Beatriz Cascelli",
        "published_at": "2023-08-18T13:39:20Z",
        "updated_at": "2023-08-18T13:39:20Z",
        "like_count": 0,
        "text": "Loved the video and the edit!"
    },
    {
        "author": "one Dr",
        "published_at": "2023-08-18T12:35:25Z",
        "updated_at": "2023-08-18T12:35:25Z",
        "like_count": 0,
        "text": "A weird hybrid 😢accent"
    },
    {
        "author": "Leif Goodwin",
        "published_at": "2023-08-18T12:01:29Z",
        "updated_at": "2023-08-18T12:01:29Z",
        "like_count": 3,
        "text": "Excellent video, people tend not to talk about accent in such depth."
    },
    {
        "author": "GandalfTheTartan",
        "published_at": "2023-08-18T09:53:16Z",
        "updated_at": "2023-08-18T09:53:16Z",
        "like_count": 0,
        "text": "The narrator has a great voice!"
    },
    {
        "author": "Тара Fusion351",
        "published_at": "2023-08-18T09:15:43Z",
        "updated_at": "2023-08-18T09:15:43Z",
        "like_count": 40,
        "text": "MOST rich people stay rich by spending like the poor and investing without stopping then most poor people stay poor by spending like the rich yet not investing like the rich but impressing them"
    },
    {
        "author": "plasmacannon 11",
        "published_at": "2023-08-18T08:44:54Z",
        "updated_at": "2023-08-18T08:44:54Z",
        "like_count": 0,
        "text": "I don’t tho in all 4 languages :D and I don’t even have dual citizenship"
    },
    {
        "author": "Daniel Fittipaldi",
        "published_at": "2023-08-18T07:38:46Z",
        "updated_at": "2023-08-18T07:38:46Z",
        "like_count": 1,
        "text": "This reporter is great"
    },
    {
        "author": "Brian Mathews",
        "published_at": "2023-08-18T06:28:36Z",
        "updated_at": "2023-08-18T06:28:36Z",
        "like_count": 17,
        "text": "You have an accent all the time in any language, including your own."
    },
    {
        "author": "Christopher Singer",
        "published_at": "2023-08-18T06:09:24Z",
        "updated_at": "2023-08-18T06:09:24Z",
        "like_count": 89,
        "text": "Mainly these are the things that foreign language learners neglect when they learn a new language. If you study opera, you have learn to sound like a native in whatever language you are speaking."
    },
    {
        "author": "PwP",
        "published_at": "2023-08-18T05:22:32Z",
        "updated_at": "2023-08-18T05:22:32Z",
        "like_count": 52,
        "text": "I taught conversational English in a European country, and when I was asked how to lose one's accent I replied \"stop using the rules of your native language and listen to how the other language's natives speak theirs\". Not sure if my students listened to my advice, but as I was teaching English I was also learning their language and have achieved virtually zero accent, though my vocabulary is merely adequate."
    },
    {
        "author": "Shriram Rammohan",
        "published_at": "2023-08-18T04:23:22Z",
        "updated_at": "2023-08-18T04:23:22Z",
        "like_count": 1,
        "text": "Fantastically made"
    },
    {
        "author": "losvideosdu2",
        "published_at": "2023-08-18T03:47:19Z",
        "updated_at": "2023-08-18T03:47:19Z",
        "like_count": 1,
        "text": "Exellent!…"
    },
    {
        "author": "Kwan-Wu Chin",
        "published_at": "2023-08-18T03:12:13Z",
        "updated_at": "2023-08-18T03:12:13Z",
        "like_count": 0,
        "text": "Wonderful."
    },
    {
        "author": "Raj",
        "published_at": "2023-08-18T02:43:03Z",
        "updated_at": "2023-08-18T02:43:03Z",
        "like_count": 480,
        "text": "I’m bilingual in English and Tamil (a Dravidian language from southern India). \nAlong the years I’ve learnt Hindi, Spanish and German to varying degrees of fluency. \nMy struggles with these latter languages have given me new respect for people who strive to speak in languages other than own, even if their speech is heavily accented. \nWhat’s important after all is communication between different cultures, even if said communication is not perfect! 😊"
    },
    {
        "author": "abansalify",
        "published_at": "2023-08-18T02:27:43Z",
        "updated_at": "2023-08-18T02:27:43Z",
        "like_count": 7,
        "text": "In Hindi there is no stress. You write what you speak and you speak what you write. The only exception is half syllable and in that case you speak that syllable for less duration."
    },
    {
        "author": "ANIMALS_AND_MORE",
        "published_at": "2023-08-18T01:56:28Z",
        "updated_at": "2023-08-18T01:56:28Z",
        "like_count": 0,
        "text": "Honestly, the headline - Why We Have An Accent In A Foreign Language - would have been more on the point."
    },
    {
        "author": "March Lopez",
        "published_at": "2023-08-18T01:50:08Z",
        "updated_at": "2023-08-18T01:50:08Z",
        "like_count": 14,
        "text": "The reason why non-native speakers may have a different accent when speaking a foreign language, even when fluent, is due to differences in sound, stress and rhythm between languages. The sounds of letters differ between languages and learning about letters individually does not provide an understanding of how they work together. For example, certain consonant combinations may be forbidden in a native language, so people may insert sounds to make them pronounceable in a foreign language. Additionally, stress patterns in languages vary, with French words being stressed on the final syllable, whereas English words often have a secondary stress in addition to the primary one. Finally, the rhythm of a language can be syllable-timed or stress-timed, with Cantonese and Italian being syllable-timed and English being stress-timed. These differences can make it difficult for non-native speakers to adjust their pronunciation, stress and rhythm to fit the rules of the foreign language."
    },
    {
        "author": "bazingacurta",
        "published_at": "2023-08-18T00:29:24Z",
        "updated_at": "2023-08-18T00:29:24Z",
        "like_count": 25,
        "text": "I'm glad pronunciation, stress and rhythm are not taught. I love to hear people speaking with different accents."
    },
    {
        "author": "Sai",
        "published_at": "2023-08-18T00:11:44Z",
        "updated_at": "2023-08-18T00:11:44Z",
        "like_count": 0,
        "text": "Just wow AMAZING!!!!\nThank youuuu"
    },
    {
        "author": "dresdenkiller",
        "published_at": "2023-08-18T00:02:20Z",
        "updated_at": "2023-08-18T00:02:20Z",
        "like_count": 1,
        "text": "But why are there different accents in the same language."
    },
    {
        "author": "Mateo Bravo",
        "published_at": "2023-08-17T23:57:13Z",
        "updated_at": "2023-08-17T23:57:13Z",
        "like_count": 3,
        "text": "It helps if the Spaniards spoke Spanish. None that I know do! Greetings from Aragon 😂"
    },
    {
        "author": "Me",
        "published_at": "2023-08-17T23:26:03Z",
        "updated_at": "2023-08-17T23:26:03Z",
        "like_count": 2,
        "text": "Great video!! I will consider showing it to my childiren."
    },
    {
        "author": "Michael Christensen",
        "published_at": "2023-08-17T23:01:46Z",
        "updated_at": "2023-08-17T23:01:46Z",
        "like_count": 3,
        "text": "I know using the aspirated plosive \"P\" as an example was just that - an example - but a *much* bigger accent problem for English to French would be VOWELS and, like the video said, prosody."
    },
    {
        "author": "欺软怕硬",
        "published_at": "2023-08-17T22:04:00Z",
        "updated_at": "2023-08-17T22:04:00Z",
        "like_count": 4,
        "text": "Global spread of English has much more profound impact. For example, psyop would not be possible in modern warfare without popularization of English. It's also the foundation of our current world economy. I'm quite uncertain about how the popularity of English will change in the next hundreds of years or so. My guess is that it will remain as the de facto global language for as long as humanity exists. Maybe it will evolve, but it will still be the origin of the global common language thanks to UK, ships/trade, and industrialization."
    },
    {
        "author": "Jose Rafael Bermudez",
        "published_at": "2023-08-17T21:22:33Z",
        "updated_at": "2023-08-17T21:22:33Z",
        "like_count": 1,
        "text": "Who’s the ESpeakER?"
    },
    {
        "author": "B F T E",
        "published_at": "2023-08-17T20:58:34Z",
        "updated_at": "2023-08-17T20:58:34Z",
        "like_count": 1,
        "text": "How can you make a video about accents without mentioning differences in intonation across languages"
    },
    {
        "author": "Adrien Cichocki Gendron",
        "published_at": "2023-08-17T20:39:24Z",
        "updated_at": "2023-08-17T20:39:24Z",
        "like_count": 1,
        "text": "Of course of course, where is my baguette"
    },
    {
        "author": "Kareem Husseini",
        "published_at": "2023-08-17T18:47:40Z",
        "updated_at": "2023-08-17T18:47:40Z",
        "like_count": 1,
        "text": "Awesome video"
    },
    {
        "author": "Barcelona",
        "published_at": "2023-08-17T17:52:57Z",
        "updated_at": "2023-08-17T17:52:57Z",
        "like_count": 0,
        "text": "I work with Wixpool. In just 5 months, I made a profit of +150%."
    },
    {
        "author": "XanderDDS",
        "published_at": "2023-08-17T17:48:56Z",
        "updated_at": "2023-08-17T17:48:56Z",
        "like_count": 1,
        "text": "trust me, you wouldn't have wanted to lean your ear against a wall with berlusconi in the next room"
    },
    {
        "author": "Casey Inge",
        "published_at": "2023-08-17T16:59:34Z",
        "updated_at": "2023-08-17T16:59:34Z",
        "like_count": 1,
        "text": "Cheers to Cantonese"
    },
    {
        "author": "Jose Asuaje",
        "published_at": "2023-08-17T16:50:51Z",
        "updated_at": "2023-08-17T16:50:51Z",
        "like_count": 3,
        "text": "this is one of the best videos i've seen on the subject"
    },
    {
        "author": "Lance Kerrigan",
        "published_at": "2023-08-17T16:24:49Z",
        "updated_at": "2023-08-17T16:24:49Z",
        "like_count": 70,
        "text": "😂 I learnt more in those 3 minutes than I did in 15 years of language class in school 🙈💡"
    },
    {
        "author": "Leonardo Gnoato",
        "published_at": "2023-08-17T16:11:32Z",
        "updated_at": "2023-08-17T16:11:32Z",
        "like_count": 187,
        "text": "Awesome video! And how about the differences on the same language? Brazilian Portuguese is syllable-timed (similar to Spanish and Italian), whereas European Portuguese is stress-timed, with stressed and unstressed syllables in words."
    },
    {
        "author": "Rendrick",
        "published_at": "2023-08-17T16:06:52Z",
        "updated_at": "2023-08-17T16:06:52Z",
        "like_count": 1,
        "text": "Cool 😂"
    },
    {
        "author": "Qasem Niksefat",
        "published_at": "2023-08-17T16:05:24Z",
        "updated_at": "2023-08-17T16:05:24Z",
        "like_count": 2,
        "text": "amazing!"
    },
    {
        "author": "bbygrlpt2",
        "published_at": "2023-08-17T16:02:15Z",
        "updated_at": "2023-08-17T16:02:15Z",
        "like_count": 17,
        "text": "I speak fluent Spanish and can tell when someone has a Spanish accent while speaking English lol I cant tell the country theyre from but can tell their first language is Spanish🥰"
    },
    {
        "author": "POTHIK المسافر পথিক",
        "published_at": "2023-08-17T15:27:52Z",
        "updated_at": "2023-08-17T15:27:52Z",
        "like_count": 2,
        "text": "Excellent presentation 👏"
    },
    {
        "author": "Dani de Janeiro",
        "published_at": "2023-08-17T15:01:01Z",
        "updated_at": "2023-08-17T15:01:01Z",
        "like_count": 312,
        "text": "Also some sounds just simply don’t exist in your target language. Many foreigners struggle with the two “TH” sounds in English whereas many anglophones struggle with the trilled “R” of Spanish."
    },
    {
        "author": "Op-Ed",
        "published_at": "2023-08-17T14:55:50Z",
        "updated_at": "2023-08-17T14:55:50Z",
        "like_count": 2,
        "text": "Best thing is to never say Spanish words in the goofy accent they always expect non-native speakers to use, like pronounce the two \"L's\" in the word \"tortilla\" and watch how they desperately try to hide how upset they get."
    },
    {
        "author": "hoi",
        "published_at": "2023-08-17T14:50:06Z",
        "updated_at": "2023-08-18T09:36:47Z",
        "like_count": 206,
        "text": "I am a native Mandarin speaker from Malaysia.\n\nMy friends from China usually find my accent strange/funny. Even I try my best to speak in \"standard Beijing accent\", but to no avail. It's still wildly different from theirs (especially those from northern China). Nonetheless, it's COMPLETELY MUTUALLY INTELLIGIBLE as long as we speak in the standard Mandarin regardless of accents.\n\nMy advice is... just make sure you pronounce clearly in the standard varieties of your target languages, accents don't really matter."
    },
    {
        "author": "Emilio Solorzano",
        "published_at": "2023-08-17T14:46:08Z",
        "updated_at": "2023-08-17T14:46:08Z",
        "like_count": 13,
        "text": "I liked this video because I'm a spanish speaker and when I speak english I have a very strong latino accent. Not as strong as Sofia Vergara though haha. 😅"
    },
    {
        "author": "turbofanlover",
        "published_at": "2023-08-17T14:40:18Z",
        "updated_at": "2023-08-17T14:40:18Z",
        "like_count": 2,
        "text": "As a Canadian, I actually enjoyed this vid, eh.  ;)"
    },
    {
        "author": "Alan LEE",
        "published_at": "2023-08-17T14:36:36Z",
        "updated_at": "2023-08-17T14:37:16Z",
        "like_count": 2097,
        "text": "Interesting. I am a native Cantonese speaker. It would be in my wildest dream to imagine that Cantonese and Italian actually have something in common😅"
    },
    {
        "author": "Guillermo Gil",
        "published_at": "2023-08-17T14:31:01Z",
        "updated_at": "2023-08-17T14:31:01Z",
        "like_count": 6,
        "text": "you have an accent in every language."
    },
    {
        "author": "Guff",
        "published_at": "2023-08-17T14:28:36Z",
        "updated_at": "2023-08-17T14:28:36Z",
        "like_count": 0,
        "text": "There are no foreigners any more. We've had our Brexit, and they've all been deported"
    },
    {
        "author": "Death at Intervals",
        "published_at": "2023-08-17T14:27:21Z",
        "updated_at": "2023-08-17T14:27:21Z",
        "like_count": 1,
        "text": "Why do they keep asking the same silly question?  And  \"someone who doesn't sound like a native speaker even when thery're fluent\"  (0:05-0:10) is hillarious. What is a \"native speaker\" after all? And what does \"to be fluent\" really mean?\n\nMy imperessaion is that the bloke has never been to the UK.\n\nThe best, the funniest and the most meaningful reply is @-PanchoVilla: \"I have an accent in my native language.\"\n\nGreat reply, Pancho. It says it all."
    },
    {
        "author": "FamiStudio",
        "published_at": "2023-08-17T14:24:17Z",
        "updated_at": "2023-08-17T14:24:17Z",
        "like_count": 2,
        "text": "Super interesting!"
    },
    {
        "author": "Guillaume Giroux",
        "published_at": "2023-08-17T14:20:27Z",
        "updated_at": "2023-08-17T14:20:27Z",
        "like_count": 12,
        "text": "My accent is my identity. It shows I’m from abroad and makes me exotic. I barely try to fix it."
    },
    {
        "author": "Yellow Flash",
        "published_at": "2023-08-17T14:04:18Z",
        "updated_at": "2023-08-17T14:04:18Z",
        "like_count": 5,
        "text": "This is general knowledge. Why make a video on this?"
    },
    {
        "author": "Makainternational",
        "published_at": "2023-08-17T14:03:52Z",
        "updated_at": "2023-08-17T14:03:52Z",
        "like_count": 0,
        "text": "I wonder if actors know about this and work on this, when playing a role in a film."
    },
    {
        "author": "Pat Breit",
        "published_at": "2023-08-17T14:03:06Z",
        "updated_at": "2023-08-17T14:03:06Z",
        "like_count": 4,
        "text": "Amazing video! Thank you!"
    },
    {
        "author": "Ludo Lustig",
        "published_at": "2023-08-17T13:54:10Z",
        "updated_at": "2023-08-17T13:54:10Z",
        "like_count": 13,
        "text": "Berlusconi is a bad example when it comes to listening through walls these days."
    },
    {
        "author": "Gancarz PL",
        "published_at": "2023-08-17T13:53:54Z",
        "updated_at": "2023-08-17T13:53:54Z",
        "like_count": 2,
        "text": "People who don't have an ear for music, can't carry a tune, will always speak with accent."
    },
    {
        "author": "Jason Bourne",
        "published_at": "2023-08-17T13:53:00Z",
        "updated_at": "2023-08-17T13:53:00Z",
        "like_count": 2,
        "text": "I have an accent within the accent"
    },
    {
        "author": "Julia Naylor",
        "published_at": "2023-08-17T13:51:29Z",
        "updated_at": "2023-08-17T13:52:11Z",
        "like_count": 30,
        "text": "As an Art student from London, living in South Wales in the early eighties, in what used to be Monmouthshire, with a lot of other students from the west of England, I picked up a west country twank, which took weeks to disappear, when I left college and returned to London. My normal English accent is North West London middle class. So I can see how what is being spoken about could happen."
    },
    {
        "author": "SavagePro",
        "published_at": "2023-08-17T13:49:01Z",
        "updated_at": "2023-08-17T13:49:01Z",
        "like_count": 3,
        "text": "Merci, Messy, Mercy . . . agghhh, I'm so stressed"
    },
    {
        "author": "Callan",
        "published_at": "2023-08-17T13:47:47Z",
        "updated_at": "2023-08-17T13:47:47Z",
        "like_count": 4,
        "text": "That was gold. Thanks.  ❤"
    },
    {
        "author": "SavagePro",
        "published_at": "2023-08-17T13:47:43Z",
        "updated_at": "2023-08-17T13:47:43Z",
        "like_count": 12,
        "text": "Putting stress on words should be illegal. Come on, imagine how they feel, and worse can't even express their own hardships in  . . . words!"
    },
    {
        "author": "Pancho Villa",
        "published_at": "2023-08-17T13:43:35Z",
        "updated_at": "2023-08-17T13:43:35Z",
        "like_count": 26,
        "text": "I have an accent in my native language."
    },
    {
        "author": "Pai de meninos",
        "published_at": "2023-08-17T13:32:59Z",
        "updated_at": "2023-08-17T13:32:59Z",
        "like_count": 0,
        "text": "Gente por favor  veja meu pedido estou desesperado sou pai de dois meninos estou sem trabalho estamos passando necessidade não temos nada pra comer hoje n comemos nada meus filhos me pedem e eu n tenho... Vim pedi ajuda com cesta básica por favor nos ajude...moro de aluguel e serei mando embora iremos mora na rua pior estou com depressão forte desejo de suicídio... Aceito trabalho em troca de comida ou moradia nós ajude"
    },
    {
        "author": "Andrew Harland",
        "published_at": "2023-08-17T13:31:56Z",
        "updated_at": "2023-08-17T13:31:56Z",
        "like_count": 2,
        "text": "firbst"
    }
]