[
    {
        "text": "DAILY  DOSE UPLAODED?"
    },
    {
        "text": "he's so dumb, including adhd chat"
    },
    {
        "text": "Surprised you're uploading stuff on the main channel as opposed to XQC's YouTube channel"
    },
    {
        "text": "There's a reason why Lord of the Rings trilogy is so highly regarded. Practical effects, real costumes and makeup instead of green suit, weird camera perspectives to make the hobbits smaller instead doing it in post (highly recommend looking into that it's super interesting), just make a way more appealing imagery than knowing that everything you see is basically a video game cutscene. That's why the Hobbit is so dogshit in comparison because relied HEAVILY on cgi"
    },
    {
        "text": "XQC? more like Mr. Yappington."
    },
    {
        "text": "he should learn this"
    },
    {
        "text": "blud really thinks he's xQspielberg"
    },
    {
        "text": "NAW cos I was literally watching this on my own time the other day and next thing you know he is too 💀😭"
    },
    {
        "text": "Mr. beast has better CGI than some movies"
    },
    {
        "text": "Ъ.ъ"
    },
    {
        "text": "he was definitely missing red mist in his render"
    },
    {
        "text": "Mr. Editor, did mr. Cow fired you D: and now you're back with this channel PepeHands"
    },
    {
        "text": "Mr. Editor Got Fired  7  "
    },
    {
        "text": "Cgi fatigue. I recomend watch drama or romance movie nowdays"
    },
    {
        "text": "i just wanna see the before and after bro..."
    },
    {
        "text": "Honestly, I'm going to check out that channel *right now.* I want to watch the recreation of The Last of Us house. Thanks for sharing this, X"
    },
    {
        "text": "AINT NO WAY YOU GOT FIRED?!"
    },
    {
        "text": "I watched this on strean and here, why? Idk actually.."
    },
    {
        "text": "MR EDITOR!!!"
    },
    {
        "text": "WePaid 100% ad revenue"
    },
    {
        "text": "Yeah but what X is missing, is that it took this guy like a little over a week to get a result that looks 75% of what the original did. \n\nFor one guy working from home that's really good, and technology is only going to improve."
    },
    {
        "text": "this account still exists ?"
    },
    {
        "text": "Why are you still posting."
    },
    {
        "text": "I just enjoy practical effects, it invites the viewer into the movie making process, most of the force awakens aliens were practical costumes, and i loved it. Even if it was cg and it looked the same, id still prefer practical."
    },
    {
        "text": "Personally as long as the shot looks good I don&#39;t give a fuck how they did it. I saw Oppenheimer at cinemas and the huge explosion that was hyped up was pretty mediocre as far as movie explosions go. Nowhere close to what Michael Bay has done with practical effects for explosions."
    },
    {
        "text": "Never thought I'd see the day xQc watched a Blender video."
    },
    {
        "text": "Xqc watch blender tutorial ,POG"
    },
    {
        "text": "Arthium fell off so now we resort to a dead channel OmegaLuL"
    },
    {
        "text": "who the fuck is xqc"
    },
    {
        "text": "\"nerdemoji\"\nman... imagine being knowledgable is considered to be nerdy."
    },
    {
        "text": "🤓"
    },
    {
        "text": "🤓"
    },
    {
        "text": "🤓"
    },
    {
        "text": "Actually yoinkingYou're going to get fired"
    },
    {
        "text": "finally real comments and not npcs commenting in the same format over and over again on xqcs channel."
    },
    {
        "text": "bro is xqc not giving you enough. stop complicating shit with all these fucking channels. Just upload on one or two. holy shit dude"
    },
    {
        "text": "What if they didn't have the source material from the movie to go after?"
    },
    {
        "text": "It&#39;d be hard independently but if it were a studio they&#39;d probably use references for a better understanding anyway"
    },
    {
        "text": "Xqc is becoming unwatchable tbh"
    },
    {
        "text": "Editor actually yoinking all the ad revenue EZ"
    },
    {
        "text": "editors on his main channels already get all the revenue"
    },
    {
        "text": "Uh oh editor got fired "
    },
    {
        "text": "FLIPMYBURGER"
    },
    {
        "text": "Daily dose of xqc casually coming back after 2years and started posting some entertaining vids. Xqc's editor fell off😢"
    },
    {
        "text": "<a href=\"about:invalid#zCSafez\"></a>"
    },
    {
        "text": "Daily dose is his 2nd editor 😂"
    },
    {
        "text": "Mr Editor didn&#39;t fall off<a href=\"about:invalid#zCSafez\"></a>"
    },
    {
        "text": "daily dose IS one of xqc&#39;s editors"
    },
    {
        "text": "Bro should first complete all the pending games before starting 3D in blender"
    },
    {
        "text": "@TannedBatman  I think it&#39;ll be fine if he sticks to tutorials on youtube. Most are step-by-step and is hard to f up. This blender guru dude has a bunch of mini tutorials that x (even with his addy filled brain) can follow pretty easily."
    },
    {
        "text": "I hope he doesnt, its just gunna be a bunch of pretentious and patronising chatters trying to help which will be aids."
    },
    {
        "text": "fired o7"
    },
    {
        "text": "ty mr editor for using ur channel"
    },
    {
        "text": "Keep uploading here please"
    },
    {
        "text": "i like this channel better anyways xd"
    },
    {
        "text": "yikes bro....@lurtzy"
    },
    {
        "text": "its spelled xD. xd is a sad face"
    },
    {
        "text": "xd"
    },
    {
        "text": "EDITOR ANSWER US WHAT HAPPENED WHY ARE U UPLOADING ON HERE"
    },
    {
        "text": "Did X say something? If not, dont worry"
    },
    {
        "text": "It really is crazy how far CGI has come, even just on YouTube channels like Kane Pixels, his video with the staircase and mall is all completely CGI, looks insane  and it's just one dude with computer software"
    },
    {
        "text": "Its not a solo project but I love how corridor crew challenges how special effects are made, not only with commentary and criticisms but good creative works with new tools available hollywood is barely starting to play with."
    },
    {
        "text": "@buggoly bug It really was, not even trying to glaze but that might have been the best &quot;found footage&quot; styled horror I&#39;ve ever seen"
    },
    {
        "text": "Rolling giant was so good"
    },
    {
        "text": "Cold Ones is a good example too, lately they&#39;ve been using sm cg/blender for such small gags that a lot of ppl don&#39;t even notice, Prezoh goat editor"
    },
    {
        "text": "Yeah I&#39;m studying Computer Science and the fundamental reason I love it so much, is because you can litterally create Worlds.<br>Look at Minecraft and No Man&#39;s Sky for example.<br>Randomly generated endless terrains, physic simulations etc. You can basically play god and the only thing holding you back, is knowledge and creativity.<br><br>It&#39;s not even computational power, though it makes things easier since you don&#39;t have to spend so much time on being super efficient"
    },
    {
        "text": "Yo editor actually got fired? Came back to the old one"
    },
    {
        "text": "im p sure he said he has to upload here every so often to not get marked inactive or sum sht"
    },
    {
        "text": "What do u mean"
    },
    {
        "text": "the reactor "
    }
]